{
    "id": "attack-pattern--59bd0dec-f8b2-4b9a-9141-37a1e6899761",
    "name": "Unused/Unsupported Cloud Regions",
    "description": "Adversaries may create cloud instances in unused geographic service regions in order to evade detection. Access is usually obtained through compromising accounts used to manage cloud infrastructure.\n\nCloud service providers often provide infrastructure throughout the world in order to improve performance, provide redundancy, and allow customers to meet compliance requirements. Oftentimes, a customer will only use a subset of the available regions and may not actively monitor other regions. If an adversary creates resources in an unused region, they may be able to operate undetected.\n\nA variation on this behavior takes advantage of differences in functionality across cloud regions. An adversary could utilize regions which do not support advanced detection services in order to avoid detection of their activity. For example, AWS GuardDuty is not supported in every region.(Citation: AWS Region Service Table)\n\nAn example of adversary use of unused AWS regions is to mine cryptocurrency through [Resource Hijacking](https://attack.mitre.org/techniques/T1496), which can cost organizations substantial amounts of money over time depending on the processing power used.(Citation: CloudSploit - Unused AWS Regions)",
    "references": [
        {
            "external_id": "T1535",
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1535"
        },
        {
            "source_name": "AWS Region Service Table",
            "url": "https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/",
            "description": "Amazon. (2019, October 22). Region Table. Retrieved October 22, 2019."
        },
        {
            "source_name": "CloudSploit - Unused AWS Regions",
            "url": "https://blog.cloudsploit.com/the-danger-of-unused-aws-regions-af0bf1b878fc",
            "description": "CloudSploit. (2019, June 8). The Danger of Unused AWS Regions. Retrieved October 8, 2019."
        }
    ],
    "platforms": [
        "AWS",
        "GCP",
        "Azure"
    ],
    "kill_chain": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "defense-evasion"
        }
    ],
    "permissions": [
        "User"
    ]
}