{
    "name": "Argentina",
    "background": "In 1816, the United Provinces of the Rio Plata declared their independence from Spain. After Bolivia, Paraguay, and Uruguay went their separate ways, the area that remained became Argentina. The country's population and culture were heavily shaped by immigrants from throughout Europe, with Italy and Spain providing the largest percentage of newcomers from 1860 to 1930. Up until about the mid-20th century, much of Argentina's history was dominated by periods of internal political unrest and conflict between civilian and military factions.\nAfter World War II, an era of Peronist populism and direct and indirect military interference in subsequent governments was followed by a military junta that took power in 1976. Democracy returned in 1983 after a failed bid to seize the Falkland Islands (Islas Malvinas) by force, and has persisted despite numerous challenges, the most formidable of which was a severe economic crisis in 2001-02 that led to violent public protests and the successive resignations of several presidents. The years 2003-15 saw Peronist rule by Nestor and Cristina FERNANDEZ de KIRCHNER, whose policies isolated Argentina and caused economic stagnation. With the election of Mauricio MACRI in November 2015, Argentina began a period of reform and international reintegration.",
    "coordinates": "34 00 S, 64 00 W",
    "region": "South America",
    "total_area": "2,780,400 sq km",
    "land_area": "2,736,690 sq km",
    "water_area": "43,710 sq km",
    "land_boundary": "11,968 km",
    "neighbors": {
        "Brazil": "1263 km",
        "Chile": "6691 km",
        "Paraguay": "2531 km",
        "Uruguay": "541 km"
    },
    "climate": "mostly temperate; arid in southeast; subantarctic in southwest",
    "coastline": "4,989 km",
    "natural_hazards": [
        "San Miguel de Tucuman and Mendoza areas in the Andes subject to earthquakes",
        "pamperos are violent windstorms that can strike the pampas and northeast",
        "heavy flooding in some areas",
        "volcanism: volcanic activity in the Andes Mountains along the Chilean border; Copahue (2,997 m) last erupted in 2000; other historically active volcanoes include Llullaillaco, Maipo, Planchon-Peteroa, San Jose, Tromen, Tupungatito, and Viedma"
    ],
    "terrain": "rich plains of the Pampas in northern half, flat to rolling plateau of Patagonia in south, rugged Andes along western border",
    "population_distribution": "one-third of the population lives in Buenos Aires; pockets of agglomeration occur throughout the northern and central parts of the country; Patagonia to the south remains sparsely populated",
    "natural_resources": [
        "fertile plains of the pampas",
        "lead",
        "zinc",
        "tin",
        "copper",
        "iron ore",
        "manganese",
        "petroleum",
        "uranium",
        "arable land"
    ],
    "population": "45,479,118",
    "nationality": "Argentine(s)",
    "ethnic_groups": {
        "European and mestizo": "97.2%",
        "Amerindian": "2.4%",
        "African": "0.4%"
    },
    "languages": {
        "Spanish (official)": "",
        "Italian": "",
        "English": "",
        "German": "",
        "French": "",
        "indigenous": ""
    },
    "religions": {
        "nominally Roman Catholic": "92%",
        "Protestant": "2%",
        "Jewish": "2%",
        "other": "4%"
    },
    "government_type": "presidential republic",
    "national_symbols": "Sun of May (a sun-with-face symbol)",
    "national_colors": [
        "sky blue",
        "white"
    ],
    "gdp": "$637.6 billion",
    "agriculture": [
        "sunflower seeds",
        "lemons",
        "soybeans",
        "grapes",
        "corn",
        "tobacco",
        "peanuts",
        "tea",
        "wheat",
        "livestock"
    ],
    "industries": [
        "food processing",
        "motor vehicles",
        "consumer durables",
        "textiles",
        "chemicals and petrochemicals",
        "printing",
        "metallurgy",
        "steel"
    ],
    "exports": [
        "soybeans and derivatives",
        "petroleum and gas",
        "vehicles",
        "corn",
        "wheat"
    ],
    "imports": [
        "machinery",
        "motor vehicles",
        "petroleum and natural gas",
        "organic chemicals",
        "plastics"
    ],
    "broadband_subscriptions": "8,473,655",
    "internet_users": "30,786,889",
    "mobile_subscriptions": "58,598,041",
    "internet_country_code": ".ar",
    "military_and_security_forces": "Armed Forces of the Argentine Republic (Fuerzas Armadas de la República Argentina): Argentine Army (Ejercito Argentino), Navy of the Argentine Republic (Armada Republica; includes naval aviation and naval infantry), Argentine Air Force (Fuerza Aerea Argentina, FAA); Ministry of Security: Gendarmerie, Prefectura Naval (coast guard)",
    "percent_GDP_on_military": "0.7%",
    "pipelines": [
        "29930 km gas",
        "41 km liquid petroleum gas",
        "6248 km oil",
        "3631 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Bahia Blanca, Buenos Aires, La Plata, Punta Colorada, Ushuaia",
        "container port(s) (TEUs)": "Buenos Aires (1,851,701)",
        "LNG terminal(s) (import)": "Bahia Blanca",
        "river port(s)": "Arroyo Seco, Rosario, San Lorenzo-San Martin (Parana)"
    },
    "waterways": "11,000 km",
    "number_of_airports": "916",
    "international_disputes": "Argentina continues to assert its claims to the UK-administered Falkland Islands (Islas Malvinas), South Georgia, and the South Sandwich Islands in its constitution, forcibly occupying the Falklands in 1982, but in 1995 agreed to no longer seek settlement by force; UK continues to reject Argentine requests for sovereignty talks; territorial claim in Antarctica partially overlaps UK and Chilean claims; uncontested dispute between Brazil and Uruguay over Braziliera/Brasiliera Island in the Quarai/Cuareim River leaves the tripoint with Argentina in question; in 2010, the ICJ ruled in favor of Uruguay's operation of two paper mills on the Uruguay River, which forms the border with Argentina; the two countries formed a joint pollution monitoring regime; the joint boundary commission, established by Chile and Argentina in 2001 has yet to map and demarcate the delimited boundary in the inhospitable Andean Southern Ice Field (Campo de Hielo Sur); contraband smuggling, human trafficking, and illegal narcotic trafficking are problems in the porous areas of the border with Bolivia"
}