{
    "name": "Australia",
    "background": "Prehistoric settlers arrived on the continent from Southeast Asia at least 40,000 years before the first Europeans began exploration in the 17th century. No formal territorial claims were made until 1770, when Capt. James COOK took possession of the east coast in the name of Great Britain (all of Australia was claimed as British territory in 1829 with the creation of the colony of Western Australia). Six colonies were created in the late 18th and 19th centuries; they federated and became the Commonwealth of Australia in 1901. The new country took advantage of its natural resources to rapidly develop agricultural and manufacturing industries and to make a major contribution to the Allied effort in World Wars I and II.\nIn recent decades, Australia has become an internationally competitive, advanced market economy due in large part to economic reforms adopted in the 1980s and its location in one of the fastest growing regions of the world economy. Long-term concerns include an aging population, pressure on infrastructure, and environmental issues such as floods, droughts, and bushfires. Australia is the driest inhabited continent on earth, making it particularly vulnerable to the challenges of climate change. Australia is home to 10% of the world's biodiversity, and a great number of its flora and fauna exist nowhere else in the world.",
    "coordinates": "27 00 S, 133 00 E",
    "region": "Oceania",
    "total_area": "7,741,220 sq km",
    "land_area": "7,682,300 sq km",
    "water_area": "58,920 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "generally arid to semiarid; temperate in south and east; tropical in north",
    "coastline": "25,760 km",
    "natural_hazards": [
        "cyclones along the coast",
        "severe droughts",
        "forest firesvolcanism: volcanic activity on Heard and McDonald Islands"
    ],
    "terrain": "mostly low plateau with deserts; fertile plain in southeast",
    "population_distribution": "population is primarily located on the periphery, with the highest concentration of people residing in the east and southeast; a secondary population center is located in and around Perth in the west; of the States and Territories, New South Wales has, by far, the largest population; the interior, or \"outback\", has a very sparse population",
    "natural_resources": [
        "alumina",
        "coal",
        "iron ore",
        "copper",
        "tin",
        "gold",
        "silver",
        "uranium",
        "nickel",
        "tungsten",
        "rare earth elements",
        "mineral sands",
        "lead",
        "zinc",
        "diamonds",
        "natural gas",
        "petroleum"
    ],
    "population": "25,466,459",
    "nationality": "Australian(s)",
    "ethnic_groups": {
        "English": "25.9%",
        "Australian": "25.4%",
        "Irish": "7.5%",
        "Scottish": "6.4%",
        "Italian": "3.3%",
        "German": "3.2%",
        "Chinese": "3.1%",
        "Indian": "1.4%",
        "Greek": "1.4%",
        "Dutch": "1.2%",
        "other": "15.8%",
        "unspecified": "5.4%"
    },
    "languages": {
        "English": "72.7%",
        "Mandarin": "2.5%",
        "Arabic": "1.4%",
        "Cantonese": "1.2%",
        "Vietnamese": "1.2%",
        "Italian": "1.2%",
        "Greek": "1%",
        "other": "14.8%",
        "unspecified": "6.5%"
    },
    "religions": {
        "Protestant": "23.1%", 
        "Roman Catholic": "22.6%", 
        "other Christian": "4.2%", 
        "Muslim": "2.6%", 
        "Buddhist": "2.4%", 
        "Orthodox": "2.3%", 
        "Hindu": "1.9%", 
        "other": "1.3%", 
        "none": "30.1%", 
        "unspecified": "9.6%"
    },
    "government_type": "federal parliamentary democracy under a constitutional monarchy; a Commonwealth realm",
    "national_symbols": "Commonwealth Star (seven-pointed Star of Federation), golden wattle tree (Acacia pycnantha Benth), kangaroo, emu",
    "national_colors": ["green", "gold"],
    "gdp": "$1,380 billion",
    "agriculture": [
        "wheat",
        "barley",
        "sugarcane",
        "fruits",
        "cattle",
        "sheep",
        "poultry"
    ],
    "industries": [
        "mining",
        "industrial and transportation equipment",
        "food processing",
        "chemicals",
        "steel"
    ],
    "exports": [
        "iron ore",
        "coal",
        "gold",
        "natural gas",
        "beef",
        "aluminum ores",
        "wheat",
        "meat (excluding beef)",
        "wool",
        "alumina",
        "alcohol"
    ],
    "imports": [
        "motor vehicles",
        "refined petroleum",
        "telecommunication equipment and parts",
        "crude petroleum",
        "medicaments",
        "goods vehicles",
        "gold",
        "computers"
    ],
    "broadband_subscriptions": "7,640,000",
    "internet_users": "20,288,409",
    "mobile_subscriptions": "28,279,000",
    "internet_country_code": ".au",
    "military_and_security_forces": "Australian Defense Force (ADF): Australian Army (includes Special Operations Command), Royal Australian Navy (includes Naval Aviation Force), Royal Australian Air Force, Joint Operations Command (JOC)",
    "pipelines": [
        "637 km condensate/gas",
        "30054 km gas",
        "240 km liquid petroleum gas",
        "3609 km oil",
        "110 km oil/gas/water",
        "72 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Brisbane, Cairns, Darwin, Fremantle, Geelong, Gladstone, Hobart, Melbourne, Newcastle, Port Adelaide, Port Kembla, Sydney",
        "container port(s) (TEUs)": "Melbourne (2,806,436), Sydney (2,530,122)",
        "LNG terminal(s) (export)": "Australia Pacific, Barrow Island, Burrup (Pluto), Curtis Island, Darwin, Karratha, Bladin Point (Ichthys), Gladstone, Prelude (offshore FLNG), Wheatstone",
        "dry bulk cargo port(s)": "Dampier (iron ore), Dalrymple Bay (coal), Hay Point (coal), Port Hedland (iron ore), Port Walcott (iron ore)"
    },
    "waterways": "2,000 km",
    "number_of_airports": "480",
    "international_disputes": "In 2007, Australia and Timor-Leste agreed to a 50-year development zone and revenue sharing arrangement and deferred a maritime boundary; Australia asserts land and maritime claims to Antarctica; Australia's 2004 submission to the Commission on the Limits of the Continental Shelf extends its continental margins over 3.37 million square kilometers, expanding its seabed roughly 30 percent beyond its claimed EEZ; all borders between Indonesia and Australia have been agreed upon bilaterally, but a 1997 treaty that would settle the last of their maritime and EEZ boundary has yet to be ratified by Indonesia's legislature; Indonesian groups challenge Australia's claim to Ashmore Reef; Australia closed parts of the Ashmore and Cartier reserve to Indonesian traditional fishing"
}