{
    "name": "Cabo Verde",
    "background": "The uninhabited islands were discovered and colonized by the Portuguese in the 15th century; Cabo Verde subsequently became a trading center for African slaves and later an important coaling and resupply stop for whaling and transatlantic shipping. The fusing of European and various African cultural traditions is reflected in Cabo Verde's Krioulo language, music, and pano textiles. Following independence in 1975, and a tentative interest in unification with Guinea-Bissau, a one-party system was established and maintained until multi-party elections were held in 1990. Cabo Verde continues to sustain one of Africa's most stable democratic governments and one of its most stable economies, maintaining a currency formerly pegged to the Portuguese escudo and then the euro since 1998. Repeated droughts during the second half of the 20th century caused significant hardship and prompted heavy emigration. As a result, Cabo Verde's expatriate population - concentrated in Boston and Western Europe - is greater than its domestic one. Most Cabo Verdeans have both African and Portuguese antecedents. Cabo Verde's population descends from its first permanent inhabitants in the late 15th-century – a preponderance of West African slaves, a small share of Portuguese colonists, and even fewer Italians, Spaniards, and Portuguese Jews. Among the nine inhabited islands, population distribution is variable. Islands in the east are very dry and are home to the country's growing tourism industry. The more western islands receive more precipitation and support larger populations, but agriculture and livestock grazing have damaged their soil fertility and vegetation. For centuries, the country's overall population size has fluctuated significantly, as recurring periods of famine and epidemics have caused high death tolls and emigration.",
    "coordinates": "16 00 N, 24 00 W",
    "region": "Africa",
    "total_area": "4,033 sq km",
    "land_area": "4,033 sq km",
    "water_area": "0 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "temperate; warm, dry summer; precipitation meager and erratic",
    "coastline": "965 km",
    "natural_hazards": [
        "prolonged droughts",
        "seasonal harmattan wind produces obscuring dust",
        "volcanically and seismically active",
        "volcanism: Fogo (2,829 m), which last erupted in 1995, is Cabo Verde's only active volcano"
    ],
    "terrain": "steep, rugged, rocky, volcanic",
    "population_distribution": "among the nine inhabited islands, population distribution is variable; islands in the east are very dry and are only sparsely settled to exploit their extensive salt deposits; the more southerly islands receive more precipitation and support larger populations, but agriculture and livestock grazing have damaged the soil fertility and vegetation; approximately half of the population lives on Sao Tiago Island, which is the location of the capital of Praia; Mindelo, on the northern island of Sao Vicente, also has a large urban population",
    "natural_resources": [
        "salt",
        "basalt rock",
        "limestone",
        "kaolin",
        "fish",
        "clay",
        "gypsum"
    ],
    "population": "583,255",
    "nationality": "Cabo Verdean(s)",
    "ethnic_groups": {
        "Creole": "71%",
        "African": "28%",
        "European": "1%"
    },
    "languages": [
        "Portuguese (official)",
        "Krioulo"
    ],
    "religions": {
        "Roman Catholic": "77.3%",
        "Protestant": "4.6%",
        "other Christian": "3.4%",
        "Muslim": "1.8%",
        "other": "1.3%",
        "none": "10.8%",
        "unspecified": "0.7%"
    },
    "government_type": "parliamentary republic",
    "national_symbols": "ten, five-pointed, yellow stars",
    "national_colors": [
        "blue",
        "white",
        "red",
        "yellow"
    ],
    "gdp": "$1.776 billion",
    "agriculture": [
        "bananas",
        "corn",
        "beans",
        "sweet potatoes",
        "sugarcane",
        "coffee",
        "peanuts",
        "fish"
    ],
    "industries": [
        "food and beverages",
        "fish processing",
        "shoes and garments",
        "salt mining",
        "ship repair"
    ],
    "exports": [
        "fuel (re-exports)",
        "shoes",
        "garments",
        "fish",
        "hides"
    ],
    "imports": [
        "foodstuffs",
        "industrial products",
        "transport equipment",
        "fuels"
    ],
    "broadband_subscriptions": "15,657",
    "internet_users": "266,562",
    "mobile_subscriptions": "610,328",
    "internet_country_code": ".cv",
    "military_and_security_forces": "Cabo Verdean Armed Forces (FACV): Army (also called the National Guard, GN), Cabo Verde Coast Guard (Guardia Costeira de Cabo Verde, GCCV, includes naval infantry)",
    "percent_GDP_on_military": "0.5%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Porto Grande"
    },
    "waterways": "Unknown",
    "number_of_airports": "9",
    "international_disputes": "none",
    "terrorism": "None/Unknown"
}