{
    "name": "Central African Republic",
    "background": "The former French colony of Ubangi-Shari became the Central African Republic upon independence in 1960. After three tumultuous decades of misrule - mostly by military governments - civilian rule was established in 1993 but lasted only a decade. In March 2003, President Ange-Felix PATASSE was deposed in a military coup led by General Francois BOZIZE, who established a transitional government. Elections held in 2005 affirmed General BOZIZE as president; he was reelected in 2011 in voting widely viewed as flawed. Several rebel groups joined together in early December 2012 to launch a series of attacks that left them in control of numerous towns in the northern and central parts of the country. The rebels - unhappy with BOZIZE's government - participated in peace talks in early January 2013 which resulted in a coalition government including the rebellion's leadership. In March 2013, the coalition government dissolved, rebels seized the capital, and President BOZIZE fled the country. Rebel leader Michel DJOTODIA assumed the presidency and the following month established a National Transitional Council (CNT). In January 2014, the CNT elected Catherine SAMBA-PANZA as interim president. Elections completed in March 2016 installed independent candidate Faustin-Archange TOUADERA as president; he continues to work towards peace between the government and armed groups, and is developing a disarmament, demobilization, reintegration, and repatriation program to reintegrate the armed groups into society. Nonetheless, as of early 2020 widespread violence continued, and the government in Bangui remains unable to extend control outside the capital. Peace agreements signed in 2017 and 2019 between the government and the main armed factions have had little effect and armed groups operate openly and control large swaths - as much as two thirds by some estimates - of the country's territory.",
    "coordinates": "7 00 N, 21 00 E",
    "region": "Africa",
    "total_area": "622,984 sq km",
    "land_area": "622,984 sq km",
    "water_area": "0 sq km",
    "land_boundary": "5,920 km",
    "neighbors": {
        "Chad": "1556 km",
        "Democratic Republic of the Congo": "1747 km",
        "Republic of the Congo": "487 km",
        "South Sudan": "1055 km",
        "Sudan": "174 km"
    },
    "climate": "tropical; hot, dry winters; mild to hot, wet summers",
    "coastline": "0 km",
    "natural_hazards": [
        "hot, dry, dusty harmattan winds affect northern areas",
        "floods are common"
    ],
    "terrain": "vast, flat to rolling plateau; scattered hills in northeast and southwest",
    "population_distribution": "majority of residents live in the western and central areas of the country, especially in and around the capital of Bangui",
    "natural_resources": [
        "diamonds",
        "uranium",
        "timber",
        "gold",
        "oil",
        "hydropower"
    ],
    "population": "5,990,855",
    "nationality": "Central African(s)",
    "ethnic_groups": {
        "Baya": "28.8%",
        "Banda": "22.9%",
        "Mandjia": "9.9%",
        "Sara": "7.9%",
        "M'Baka-Bantu": "7.9%",
        "Arab-Fulani": "6%",
        "Mbum": "6%",
        "Ngbanki": "5.5%",
        "Zande-Nzakara": "3%",
        "other Central African Republic ethnic groups": "2%",
        "non-Central African Republic ethnic groups": ".1%"
    },
    "languages": {
        "French (official)": "",
        "Sangho": "",
        "tribal languages": ""
    },
    "religions": {
        "Christian": "89.5%",
        "Muslim": "8.5%",
        "folk": "1%",
        "unaffiliated": "1%"
    },
    "government_type": "presidential republic",
    "national_symbols": "elephant",
    "national_colors": [
        "blue",
        "white",
        "green",
        "yellow",
        "red"
    ],
    "gdp": "$1.937 billion",
    "agriculture": [
        "cotton",
        "coffee",
        "tobacco",
        "cassava",
        "yams",
        "millet",
        "corn",
        "bananas",
        "timber"
    ],
    "industries": [
        "gold and diamond mining",
        "logging",
        "brewing",
        "sugar refining"
    ],
    "exports": [
        "diamonds",
        "timber",
        "cotton",
        "coffee"
    ],
    "imports": [
        "food",
        "textiles",
        "petroleum products",
        "machinery",
        "electrical equipment",
        "motor vehicles",
        "chemicals",
        "pharmaceuticals"
    ],
    "broadband_subscriptions": "608",
    "internet_users": "246,000",
    "mobile_subscriptions": "1,279,261",
    "internet_country_code": ".cf",
    "military_and_security_forces": "Central African Armed Forces (Forces Armees Centrafricaines, FACA): Ground Forces (includes Military Air Service), General Directorate of Gendarmerie Inspection (DGIG); National Police",
    "percent_GDP_on_military": "1.5%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "river port(s)": "Bangui (Oubangui)"
    },
    "waterways": "2,800 km",
    "number_of_airports": "39",
    "international_disputes": "periodic skirmishes persist over water and grazing rights among related pastoral populations along the border with southern Sudan",
    "terrorism": "Unknown"
}