{
    "name": "Costa Rica",
    "background": "Although explored by the Spanish early in the 16th century, initial attempts at colonizing Costa Rica proved unsuccessful due to a combination of factors, including disease from mosquito-infested swamps, brutal heat, resistance by natives, and pirate raids. It was not until 1563 that a permanent settlement of Cartago was established in the cooler, fertile central highlands. The area remained a colony for some two and a half centuries. In 1821, Costa Rica became one of several Central American provinces that jointly declared their independence from Spain. Two years later it joined the United Provinces of Central America, but this federation disintegrated in 1838, at which time Costa Rica proclaimed its sovereignty and independence. Since the late 19th century, only two brief periods of violence have marred the country's democratic development. On 1 December 1948, Costa Rica dissolved its armed forces. Although it still maintains a large agricultural sector, Costa Rica has expanded its economy to include strong technology and tourism industries. The standard of living is relatively high. Land ownership is widespread.",
    "coordinates": "10 00 N, 84 00 W",
    "region": "Central America and the Caribbean",
    "total_area": "51,100 sq km",
    "land_area": "51,060 sq km",
    "water_area": "40 sq km",
    "land_boundary": "661 km",
    "neighbors": {
        "Panama": "348 km"
    },
    "climate": "tropical and subtropical; dry season (December to April); rainy season (May to November); cooler in highlands",
    "coastline": "1,290 km",
    "natural_hazards": [
        "occasional earthquakes, hurricanes along Atlantic coast",
        "frequent flooding of lowlands at onset of rainy season and landslides",
        "active volcanoes - volcanism: Arenal (1,670 m), which erupted in 2010, is the most active volcano in Costa Rica; a 1968 eruption destroyed the town of Tabacon; Irazu (3,432 m), situated just east of San Jose, has the potential to spew ash over the capital city as it did between 1963 and 1965; other historically active volcanoes include Miravalles, Poas, Rincon de la Vieja, and Turrialba"
    ],
    "terrain": "coastal plains separated by rugged mountains including over 100 volcanic cones, of which several are major active volcanoes",
    "population_distribution": "roughly half of the nation's population resides in urban areas; the capital of San Jose is the largest city and home to approximately one-fifth of the population",
    "natural_resources": [
        "hydropower"
    ],
    "population": "5,097,988",
    "nationality": "Costa Rican(s)",
    "ethnic_groups": {
        "white or mestizo": "83.6%",
        "mulatto": "6.7%",
        "indigenous": "2.4%",
        "black of African descent": "1.1%",
        "other": "1.1%",
        "none": "2.9%",
        "unspecified": "2.2%"
    },
    "languages": {
        "Spanish (official)": "",
        "English": ""
    },
    "religions": {
        "Roman Catholic": "71.8%", 
        "Evangelical and Pentecostal": "12.3%", 
        "other Protestant": "2.6%", 
        "Jehovah's Witness": "0.5%", 
        "other": "2.4%", 
        "none": "10.4%"},
    "government_type": "presidential republic",
    "national_symbols": "yiguirro (clay-colored robin)",
    "national_colors": ["blue", "white", "red"],
    "gdp": "$58.27 billion",
    "agriculture": [
        "bananas",
        "pineapples",
        "coffee",
        "melons",
        "ornamental plants",
        "sugar",
        "corn",
        "rice",
        "beans",
        "potatoes",
        "beef",
        "poultry",
        "dairy",
        "timber"
    ],
    "industries": [
        "medical equipment",
        "food processing",
        "textiles and clothing",
        "construction materials",
        "fertilizer",
        "plastic products"
    ],
    "exports": [
        "bananas",
        "pineapples",
        "coffee",
        "melons",
        "ornamental plants",
        "sugar",
        "beef",
        "seafood",
        "electronic components",
        "medical equipment"
    ],
    "imports": [
        "raw materials",
        "consumer goods",
        "capital equipment",
        "petroleum",
        "construction materials"
    ],
    "broadband_subscriptions": "834,784",
    "internet_users": "3,217,277",
    "mobile_subscriptions": "8,495,585",
    "internet_country_code": ".cr",
    "military_and_security_forces": "no regular military forces; Ministry of Public Security commands the Public Forces of Costa Rica, which includes the Public Force (National Police), Anti-Drug Police, and National Coast Guard Service",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "662 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Atlantic Ocean (Caribbean) - Puerto Limon"
    },
    "waterways": "730 km",
    "number_of_airports": "161",
    "international_disputes": "Costa Rica and Nicaragua regularly file border dispute cases over the delimitations of the San Juan River and the northern tip of Calero Island to the International Court of Justice (ICJ); in 2009, the ICJ ruled that Costa Rican vessels carrying out police activities could not use the river, but official Costa Rican vessels providing essential services to riverside inhabitants and Costa Rican tourists could travel freely on the river; in 2011, the ICJ provisionally ruled that both countries must remove personnel from the disputed area; in 2013, the ICJ rejected Nicaragua's 2012 suit to halt Costa Rica's construction of a highway paralleling the river on the grounds of irreparable environmental damage; in 2013, the ICJ, regarding the disputed territory, ordered that Nicaragua should refrain from dredging or canal construction and refill and repair damage caused by trenches connecting the river to the Caribbean and upheld its 2010 ruling that Nicaragua must remove all personnel; in early 2014, Costa Rica brought Nicaragua to the ICJ over offshore oil concessions in the disputed region"
}