{
    "name": "Cyprus",
    "background": "A former British colony, Cyprus became independent in 1960 following years of resistance to British rule. Tensions between the Greek Cypriot majority and Turkish Cypriot minority communities came to a head in December 1963, when violence broke out in the capital of Nicosia. Despite the deployment of UN peacekeepers in 1964, sporadic intercommunal violence continued, forcing most Turkish Cypriots into enclaves throughout the island. In 1974, a Greek Government-sponsored attempt to overthrow the elected president of Cyprus was met by military intervention from Turkey, which soon controlled more than a third of the island. In 1983, the Turkish Cypriot administered area declared itself the \"Turkish Republic of Northern Cyprus\" (\"TRNC\"), but it is recognized only by Turkey. An UN-mediated agreement, the Annan Plan, failed to win approval by both communities in 2004. In February 2014, after a hiatus of nearly two years, the leaders of the two communities resumed formal discussions under UN auspices aimed at reuniting the divided island. The most recent round of negotiations to reunify the island were suspended in July 2017 after failure to achieve a breakthrough. The entire island entered the EU on 1 May 2004, although the EU acquis - the body of common rights and obligations - applies only to the areas under the internationally recognized government, and is suspended in the \"TRNC.\" However, individual Turkish Cypriots able to document their eligibility for Republic of Cyprus citizenship legally enjoy the same rights accorded to other citizens of EU states.",
    "coordinates": "35 00 N, 33 00 E",
    "region": "Middle East",
    "total_area": "9,251 sq km",
    "land_area": "9,241 sq km",
    "water_area": "10 sq km",
    "land_boundary": "156 km",
    "neighbors": {
        "Dhekelia": "108 km"
    },
    "climate": "temperate; Mediterranean with hot, dry summers and cool winters",
    "coastline": "648 km",
    "natural_hazards": [
        "moderate earthquake activity",
        "droughts"
    ],
    "terrain": "central plain with mountains to north and south; scattered but significant plains along southern coast",
    "population_distribution": "population concentrated in central Nicosia and in the major cities of the south: Paphos, Limassol, and Larnaca",
    "natural_resources": [
        "copper",
        "pyrites",
        "asbestos",
        "gypsum",
        "timber",
        "salt",
        "marble",
        "clay earth pigment"
    ],
    "population": "1,266,676",
    "nationality": "Cypriot(s)",
    "ethnic_groups": {
        "Greek": "98.8%",
        "other": "1%",
        "unspecified": "0.2%"
    },
    "languages": {
        "Greek (official)": "80.9%",
        "Turkish (official)": "0.2%",
        "English": "4.1%",
        "Romanian": "2.9%",
        "Russian": "2.5%",
        "Bulgarian": "2.2%",
        "Arabic": "1.2%",
        "Filipino": "1.1%",
        "other": "4.3%",
        "unspecified": "0.6%"
    },
    "religions": {
        "Orthodox Christian": "89.1%", "Roman Catholic": "2.9%", 
        "Protestant/Anglican": "2%", "Muslim": "1.8%", "Buddhist": "1%", 
        "other": "1.4%", "unknown": "1.1%", "none/atheist": "0.6%"},
    "government_type": "Republic of Cyprus - presidential republic; \"Turkish Republic of Northern Cyprus\" (self-declared) - parliamentary republic with enhanced presidency\n        \n      \n\nnote: a separation of the two main ethnic communities inhabiting the island began following the outbreak of communal strife in 1963; this separation was further solidified when a Greek military-junta-supported coup attempt prompted the Turkish military intervention in July 1974 that gave the Turkish Cypriots de facto control in the north; Greek Cypriots control the only internationally recognized government on the island; on 15 November 1983, then Turkish Cypriot \"President\" Rauf DENKTAS declared independence and the formation of the \"TRNC,” which is recognized only by Turkey",
    "national_symbols": "Cypriot mouflon (wild sheep), white dove",
    "national_colors": ["blue", "white"],
    "gdp": "$21.7 billion",
    "agriculture": [
        "citrus",
        "vegetables",
        "barley",
        "grapes",
        "olives",
        "vegetables",
        "poultry",
        "pork",
        "lamb",
        "dairy",
        "cheese"
    ],
    "industries": [
        "tourism",
        "food and beverage processing",
        "cement and gypsum",
        "ship repair and refurbishment",
        "textiles",
        "light chemicals",
        "metal products",
        "wood",
        "paper",
        "stone and clay products"
    ],
    "exports": [
        "citrus",
        "potatoes",
        "pharmaceuticals",
        "cement",
        "clothing"
    ],
    "imports": [
        "consumer goods",
        "petroleum and lubricants",
        "machinery",
        "transport equipment"
    ],
    "broadband_subscriptions": "313,462",
    "internet_users": "915,036",
    "mobile_subscriptions": "1,200,378",
    "internet_country_code": ".cy",
    "military_and_security_forces": "Republic of Cyprus: Cypriot National Guard (Ethniki Froura, EF, includes ground, naval, and air elements); \"Turkish Republic of Northern Cyprus\": Turkish Cypriot Security Force (GKK)",
    "pipelines": [
        "0 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "area under government control: Larnaca, Limassol, Vasilikos"
    },
    "waterways": "Unknown",
    "number_of_airports": "15",
    "international_disputes": "hostilities in 1974 divided the island into two de facto autonomous entities, the internationally recognized Cypriot Government and a Turkish-Cypriot community (north Cyprus); the 1,000-strong UN Peacekeeping Force in Cyprus (UNFICYP) has served in Cyprus since 1964 and maintains the buffer zone between north and south; on 1 May 2004, Cyprus entered the EU still divided, with the EU's body of legislation and standards (acquis communitaire) suspended in the north; Turkey protests Cypriot Government creating hydrocarbon blocks and maritime boundary with Lebanon in March 2007"
}