{
    "name": "Eritrea",
    "background": "After independence from Italian colonial control in 1941 and 10 years of British administrative control, the UN established Eritrea as an autonomous region within the Ethiopian federation in 1952. Ethiopia's full annexation of Eritrea as a province 10 years later sparked a violent 30-year struggle for independence that ended in 1991 with Eritrean rebels defeating government forces. Eritreans overwhelmingly approved independence in a 1993 referendum. ISAIAS Afwerki has been Eritrea's only president since independence; his rule, particularly since 2001, has been highly autocratic and repressive. His government has created a highly militarized society by pursuing an unpopular program of mandatory conscription into national service – divided between military and civilian service – of indefinite length. A two-and-a-half-year border war with Ethiopia that erupted in 1998 ended under UN auspices in December 2000. A subsequent 2007 Eritrea-Ethiopia Boundary Commission (EEBC) demarcation was rejected by Ethiopia. More than a decade of a tense “no peace, no war” stalemate ended in 2018 after the newly elected Ethiopian prime minister accepted the EEBC's 2007 ruling, and the two countries signed declarations of peace and friendship. Following the July 2018 peace agreement with Ethiopia, Eritrean leaders engaged in intensive diplomacy around the Horn of Africa, bolstering regional peace, security, and cooperation, as well as brokering rapprochements between governments and opposition groups. In November 2018, the UN Security Council lifted an arms embargo that had been imposed on Eritrea since 2009, after the UN Somalia-Eritrea Monitoring Group reported they had not found evidence of Eritrean support in recent years for Al-Shabaab. The country's rapprochement with Ethiopia has led to a steady resumption of economic ties, with increased air transport, trade, tourism, and port activities, but the economy remains agriculture-dependent, and Eritrea is still one of Africa's poorest nations. Despite the country's improved relations with its neighbors, ISAIAS has not let up on repression and conscription and militarization continue.",
    "coordinates": "15 00 N, 39 00 E",
    "region": "Africa",
    "total_area": "117,600 sq km",
    "land_area": "101,000 sq km",
    "water_area": "16,600 sq km",
    "land_boundary": "1,840 km",
    "neighbors": {
        "Ethiopia": "1033 km",
        "Sudan": "682 km"
    },
    "climate": "hot, dry desert strip along Red Sea coast; cooler and wetter in the central highlands (up to 61 cm of rainfall annually, heaviest June to September); semiarid in western hills and lowlands",
    "coastline": "2,234 km",
    "natural_hazards": [
        "frequent droughts, rare earthquakes and volcanoes",
        "locust swarms",
        "volcanism: Dubbi (1,625 m), which last erupted in 1861, was the country's only historically active volcano until Nabro (2,218 m) came to life on 12 June 2011"
    ],
    "terrain": "dominated by extension of Ethiopian north-south trending highlands, descending on the east to a coastal desert plain, on the northwest to hilly terrain and on the southwest to flat-to-rolling plains",
    "population_distribution": "density is highest in the center of the country in and around the cities of Asmara (capital) and Keren; smaller settlements exist in the north and south",
    "natural_resources": [
        "gold",
        "potash",
        "zinc",
        "copper",
        "salt",
        "possibly oil and natural gas",
        "fish"
    ],
    "population": "6,081,196",
    "nationality": "Eritrean(s)",
    "ethnic_groups": {
        "Tigrinya": "55%",
        "Tigre": "30%",
        "Saho": "4%",
        "Kunama": "2%",
        "Rashaida": "2%",
        "Bilen": "2%",
        "other": "5%"
    },
    "languages": [
        "Tigrinya (official)",
        "Arabic (official)",
        "English (official)",
        "Tigre",
        "Kunama",
        "Afar",
        "other Cushitic languages"
    ],
    "religions": [
        "Sunni Muslim",
        "Coptic Christian",
        "Roman Catholic",
        "Protestant"
    ],
    "government_type": "presidential republic",
    "national_symbols": "camel",
    "national_colors": [
        "green",
        "red",
        "blue"
    ],
    "gdp": "$5.813 billion",
    "agriculture": [
        "sorghum",
        "lentils",
        "vegetables",
        "corn",
        "cotton",
        "tobacco",
        "sisal",
        "livestock",
        "goats",
        "fish"
    ],
    "industries": [
        "food processing",
        "beverages",
        "clothing and textiles",
        "light manufacturing",
        "salt",
        "cement"
    ],
    "exports": [
        "gold and other minerals",
        "livestock",
        "sorghum",
        "textiles",
        "food",
        "small industry manufactures"
    ],
    "imports": [
        "machinery",
        "petroleum products",
        "food",
        "manufactured goods"
    ],
    "broadband_subscriptions": "600",
    "internet_users": "69,095",
    "mobile_subscriptions": "506,000",
    "internet_country_code": ".er",
    "military_and_security_forces": "Eritrean Defense Forces: Eritrean Ground Forces, Eritrean Navy, Eritrean Air Force (includes Air Defense Force)",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Assab, Massawa"
    },
    "waterways": "Unknown",
    "number_of_airports": "13",
    "international_disputes": "Eritrea and Ethiopia agreed to abide by 2002 Ethiopia-Eritrea Boundary Commission's (EEBC) delimitation decision, but neither party responded to the revised line detailed in the November 2006 EEBC Demarcation Statement; Sudan accuses Eritrea of supporting eastern Sudanese rebel groups; in 2008, Eritrean troops moved across the border on Ras Doumera peninsula and occupied Doumera Island with undefined sovereignty in the Red Sea",
    "terrorism": "None/Unknown"
}