{
    "name": "Ethiopia",
    "background": "Unique among African countries, the ancient Ethiopian monarchy maintained its freedom from colonial rule with the exception of a short-lived Italian occupation from 1936-41. In 1974, a military junta, the Derg, deposed Emperor Haile SELASSIE (who had ruled since 1930) and established a socialist state. Torn by bloody coups, uprisings, wide-scale drought, and massive refugee problems, the regime was finally toppled in 1991 by a coalition of rebel forces, the Ethiopian People's Revolutionary Democratic Front (EPRDF). A constitution was adopted in 1994, and Ethiopia's first multiparty elections were held in 1995. A border war with Eritrea in the late 1990s ended with a peace treaty in December 2000. In November 2007, the Eritrea-Ethiopia Border Commission (EEBC) issued specific coordinates as virtually demarcating the border and pronounced its work finished. Alleging that the EEBC acted beyond its mandate in issuing the coordinates, Ethiopia did not accept them and maintained troops in previously contested areas pronounced by the EEBC as belonging to Eritrea. This intransigence resulted in years of heightened tension between the two countries. In August 2012, longtime leader Prime Minister MELES Zenawi died in office and was replaced by his Deputy Prime Minister HAILEMARIAM Desalegn, marking the first peaceful transition of power in decades. Following a wave of popular dissent and anti-government protest that began in 2015, HAILEMARIAM resigned in February 2018 and ABIY Ahmed Ali took office in April 2018 as Ethiopia's first ethnic Oromo prime minister. In June 2018, ABIY announced Ethiopia would accept the border ruling of 2000, prompting rapprochement between Ethiopia and Eritrea that was marked with a peace agreement in July 2018 and a reopening of the border in September 2018. In November 2019, Ethiopia's nearly 30-year ethnic-based ruling coalition - the EPRDF - merged into a single unity party called the Prosperity Party, however, one of the four constituent parties refused to join.",
    "coordinates": "8 00 N, 38 00 E",
    "region": "Africa",
    "total_area": "1,104,300 sq km",
    "land_area": "1,096,570 sq km",
    "water_area": "7,730 sq km",
    "land_boundary": "5,925 km",
    "neighbors": {
        "Eritrea": "1033 km",
        "Kenya": "867 km",
        "Somalia": "1640 km",
        "South Sudan": "1299 km",
        "Sudan": "744 km"
    },
    "climate": "tropical monsoon with wide topographic-induced variation",
    "coastline": "0 km",
    "natural_hazards": [
        "geologically active Great Rift Valley susceptible to earthquakes, volcanic eruptions",
        "frequent droughts",
        "volcanism: volcanic activity in the Great Rift Valley; Erta Ale (613 m), which has caused frequent lava flows in recent years, is the country's most active volcano; Dabbahu became active in 2005, forcing evacuations; other historically active volcanoes include Alayta, Dalaffilla, Dallol, Dama Ali, Fentale, Kone, Manda Hararo, and Manda-Inakir"
    ],
    "terrain": "high plateau with central mountain range divided by Great Rift Valley",
    "population_distribution": "highest density is found in the highlands of the north and middle areas of the country, particularly around the centrally located capital city of Addis Ababa; the far east and southeast are sparsely populated",
    "natural_resources": [
        "small reserves of gold",
        "platinum",
        "copper",
        "potash",
        "natural gas",
        "hydropower"
    ],
    "population": "108,113,150",
    "nationality": "Ethiopian(s)",
    "ethnic_groups": {
        "Oromo": "34.4%",
        "Amhara (Amara)": "27%",
        "Somali (Somalie)": "6.2%",
        "Tigray (Tigrinya)": "6.1%",
        "Sidama": "4%",
        "Gurage": "2.5%",
        "Welaita": "2.3%",
        "Hadiya": "1.7%",
        "Afar (Affar)": "1.7%",
        "Gamo": "1.5%",
        "Gedeo": "1.3%",
        "Silte": "1.3%",
        "Kefficho": "1.2%",
        "other": "8.8%"
    },
    "languages": {
        "Oromo (official)": "33.8%",
        "Amharic (official)": "29.3%",
        "Somali (official)": "6.2%",
        "Tigrigna (official)": "5.9%",
        "Sidamo": "4%",
        "Wolaytta": "2.2%",
        "Gurage": "2%",
        "Afar (official)": "1.7%",
        "Hadiyya": "1.7%",
        "Gamo": "1.55%",
        "Gedeo": "1.3%",
        "Opuuo": "1.2%",
        "Kafa": "1.1%",
        "other": "8.1%",
        "English": "",
        "Arabic": ""
    },
    "religions": {
        "Ethiopian Orthodox": "43.5%", 
        "Muslim": "33.9%", 
        "Protestant": "18.5%", 
        "traditional": "2.7%", 
        "Catholic": "0.7%", 
        "other": "0.6%"},
    "government_type": "federal parliamentary republic",
    "national_symbols": "Abyssinian lion (traditional), yellow pentagram with five rays of light on a blue field (promoted by current government)",
    "national_colors": ["green", "yellow", "red"],
    "gdp": "$80.87 billion",
    "agriculture": [
        "cereals",
        "coffee",
        "oilseed",
        "cotton",
        "sugarcane",
        "vegetables",
        "khat",
        "cut flowers",
        "hides",
        "cattle",
        "sheep",
        "goats",
        "fish"
    ],
    "industries": [
        "food processing",
        "beverages",
        "textiles",
        "leather",
        "garments",
        "chemicals",
        "metals processing",
        "cement"
    ],
    "exports": [
        "coffee",
        "oilseeds",
        "edible vegetables including khat",
        "gold",
        "flowers",
        "live animals",
        "raw leather products",
        "meat products"
    ],
    "imports": [
        "machinery and aircraft",
        "metal and metal products",
        "electrical materials",
        "petroleum products",
        "motor vehicles",
        "chemicals and fertilizers"
    ],
    "broadband_subscriptions": "580,120",
    "internet_users": "15,731,741",
    "mobile_subscriptions": "62,617,000",
    "internet_country_code": ".et",
    "military_and_security_forces": "Ethiopian National Defense Force (ENDF): Ground Forces, Ethiopian Air Force (Ye Ityopya Ayer Hayl, ETAF)",
    "percent_GDP_on_military": "0.6%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {},
    "waterways": "Unknown",
    "number_of_airports": "57",
    "international_disputes": "Eritrea and Ethiopia agreed to abide by the 2002 Eritrea-Ethiopia Boundary Commission's (EEBC) delimitation decision, but neither party responded to the revised line detailed in the November 2006 EEBC Demarcation Statement; the undemarcated former British administrative line has little meaning as a political separation to rival clans within Ethiopia's Ogaden and southern Somalia's Oromo region; Ethiopian forces invaded southern Somalia and routed Islamist courts from Mogadishu in January 2007; \"Somaliland\" secessionists provide port facilities in Berbera and trade ties to landlocked Ethiopia; civil unrest in eastern Sudan has hampered efforts to demarcate the porous boundary with Ethiopia"
}