{
    "name": "Gaza Strip",
    "background": "Inhabited since at least the 15th century B.C., the Gaza Strip has been dominated by many different peoples and empires throughout its history; it was incorporated into the Ottoman Empire in the early 16th century. The Gaza Strip fell to British forces during World War I, becoming a part of the British Mandate of Palestine. Following the 1948 Arab-Israeli War, Egypt administered the newly formed Gaza Strip; Israel captured it in the Six-Day War in 1967. Under a series of agreements known as the Oslo accords signed between 1993 and 1999, Israel transferred to the newly-created Palestinian Authority (PA) security and civilian responsibility for many Palestinian-populated areas of the Gaza Strip as well as the West Bank. In 2000, a violent intifada or uprising began, and in 2001 negotiations to determine the permanent status of the West bank and Gaza Strip stalled. Subsequent attempts to re-start negotiations have not resulted in progress toward determining final status of the Israeli-Palestinian conflict.\nIsrael by late 2005 unilaterally withdrew all of its settlers and soldiers and dismantled its military facilities in the Gaza Strip, but it continues to control the Gaza Strip’s land and maritime borders and airspace. In early 2006, the Islamic Resistance Movement (HAMAS) won a majority in the Palestinian Legislative Council election. Attempts to form a unity government between Fatah, the dominant Palestinian political faction in the West Bank, and HAMAS failed, leading to violent clashes between their respective supporters and HAMAS's violent seizure of all military and governmental institutions in the Gaza Strip in June 2007. Since HAMAS’s takeover, Israel and Egypt have enforced tight restrictions on movement and access of goods and individuals into and out of the territory. Fatah and HAMAS have since reached a series of agreements aimed at restoring political unity between the Gaza Strip and the West Bank but have struggled to enact them; a reconciliation agreement signed in October 2017 remains unimplemented.\nIn July 2014, HAMAS and other Gaza-based militant groups engaged in a 51-day conflict with Israel culminating in late August with an open-ended truce. Since 2014, Palestinian militants and the Israel Defense Forces have exchanged projectiles and air strikes respectively, sometimes lasting multiple days and resulting in multiple deaths on both sides. Egypt, Qatar, and the UN Special Coordinator for the Middle East Peace Process have negotiated multiple ceasefires to avert a broader conflict. Since March 2018, HAMAS has coordinated weekly demonstrations along the Gaza security fence, many of which have turned violent, resulting in one Israeli soldier death and several Israeli soldier injuries as well as more than 200 Palestinian deaths and thousands of injuries.",
    "coordinates": "31 25 N, 34 20 E",
    "region": "Middle East",
    "total_area": "360 sq km",
    "land_area": "360 sq km",
    "water_area": "0 sq km",
    "land_boundary": "72 km",
    "neighbors": {
        "Israel": "59 km"
    },
    "climate": "temperate, mild winters, dry and warm to hot summers",
    "coastline": "40 km",
    "natural_hazards": [
        "droughts"
    ],
    "terrain": "flat to rolling, sand- and dune-covered coastal plain",
    "population_distribution": "population concentrated in major cities, particularly Gaza City in the north",
    "natural_resources": [
        "arable land",
        "natural gas"
    ],
    "population": "1,918,221",
    "nationality": "NA",
    "ethnic_groups": {"Palestinian Arab":""},
    "languages": {
        "Arabic": "",
        "Hebrew": "",
        "English": ""
    },
    "religions": {
        "Muslim": "98.0%", 
        "Christian": "1.0%", 
        "other, unaffiliated, unspecified": "1.0%"},
    "government_type": "Unknown",
    "national_symbols": "Unknown",
    "national_colors": [],
    "gdp": "$2.938 billion",
    "agriculture": [
        "olives",
        "fruit",
        "vegetables",
        "flowers",
        "beef",
        "dairy products"
    ],
    "industries": [
        "textiles",
        "food processing",
        "furniture"
    ],
    "exports": [
        "strawberries",
        "carnations",
        "vegetables",
        "fish"
    ],
    "imports": [
        "food",
        "consumer goods",
        "fuel"
    ],
    "broadband_subscriptions": "320,500",
    "internet_users": "2,673,000",
    "mobile_subscriptions": "4,135,363",
    "internet_country_code": ".ps",
    "military_and_security_forces": "HAMAS does not have a conventional military in the Gaza Strip but maintains security forces in addition to its military wing, the 'Izz al-Din al-Qassam Brigades; the military wing reports to the HAMAS Political Bureau leadership; there are several other militant groups operating in Gaza, most notably the Al-Quds Brigades of Palestine Islamic Jihad, which are usually but not always beholden to HAMAS's authority",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Gaza"
    },
    "waterways": "Unknown",
    "number_of_airports": "1",
    "international_disputes": "the status of the Gaza Strip is a final status issue to be resolved through negotiations; Israel removed settlers and military personnel from Gaza Strip in September 2005"
}