{
    "name": "Georgia",
    "background": "The region of present day Georgia contained the ancient kingdoms of Colchis and Kartli-Iberia. The area came under Roman influence in the first centuries A.D., and Christianity became the state religion in the 330s. Domination by Persians, Arabs, and Turks was followed by a Georgian golden age (11th-13th centuries) that was cut short by the Mongol invasion of 1236. Subsequently, the Ottoman and Persian empires competed for influence in the region. Georgia was absorbed into the Russian Empire in the 19th century. Independent for three years (1918-1921) following the Russian revolution, it was forcibly incorporated into the USSR in 1921 and regained its independence when the Soviet Union dissolved in 1991.\nMounting public discontent over rampant corruption and ineffective government services, followed by an attempt by the incumbent Georgian Government to manipulate parliamentary elections in November 2003, touched off widespread protests that led to the resignation of Eduard SHEVARDNADZE, president since 1995. In the aftermath of that popular movement, which became known as the \"Rose Revolution,\" new elections in early 2004 swept Mikheil SAAKASHVILI into power along with his United National Movement (UNM) party. Progress on market reforms and democratization has been made in the years since independence, but this progress has been complicated by Russian assistance and support to the separatist regions of Abkhazia and South Ossetia. Periodic flare-ups in tension and violence culminated in a five-day conflict in August 2008 between Russia and Georgia, including the invasion of large portions of undisputed Georgian territory. Russian troops pledged to pull back from most occupied Georgian territory, but in late August 2008 Russia unilaterally recognized the independence of Abkhazia and South Ossetia, and Russian military forces remain in those regions.\nBillionaire Bidzina IVANISHVILI's unexpected entry into politics in October 2011 brought the divided opposition together under his Georgian Dream coalition, which won a majority of seats in the October 2012 parliamentary elections and removed UNM from power. Conceding defeat, SAAKASHVILI named IVANISHVILI as prime minister and allowed Georgian Dream to create a new government. Giorgi MARGVELASHVILI was inaugurated as president on 17 November 2013, ending a tense year of power-sharing between SAAKASHVILI and IVANISHVILI. At the time, these changes in leadership represented unique examples of a former Soviet state that emerged to conduct democratic and peaceful government transitions of power. IVANISHVILI voluntarily resigned from office after the presidential succession, and Georgia's legislature on 20 November 2013 confirmed Irakli GARIBASHVILI as his replacement. GARIBASHVILI was replaced by Giorgi KVIRIKASHVILI in December 2015. KVIRIKASHVILI remained prime minister following Georgian Dream’s success in the October 2016 parliamentary elections, where the party won a constitutional majority. IVANISHVILI reemerged as Georgian Dream party chairman in April 2018. KVIRIKASHVILI resigned in June 2018 and was replaced by Mamuka BAKHTADZE. In September 2019, BAKHTADZE resigned and Giorgi GAKHARIA was named the country's new head of government, Georgia's fifth prime minister in seven years. Popular and government support for integration with the West is high in Georgia. Joining the EU and NATO are among the country's top foreign policy goals.",
    "coordinates": "42 00 N, 43 30 E",
    "region": "Asia",
    "total_area": "69,700 sq km",
    "land_area": "69,700 sq km",
    "water_area": "0 sq km",
    "land_boundary": "1,814 km",
    "neighbors": {
        "Azerbaijan": "428 km",
        "Russia": "894 km",
        "Turkey": "273 km"
    },
    "climate": "warm and pleasant; Mediterranean-like on Black Sea coast",
    "coastline": "310 km",
    "natural_hazards": [
        "earthquakes"
    ],
    "terrain": "largely mountainous with Great Caucasus Mountains in the north and Lesser Caucasus Mountains in the south; Kolkhet'is Dablobi (Kolkhida Lowland) opens to the Black Sea in the west; Mtkvari River Basin in the east; fertile soils in river valley flood plains and foothills of Kolkhida Lowland",
    "population_distribution": "settlement concentrated in the central valley, particularly in the capital city of Tbilisi in the east; smaller urban agglomerations dot the Black Sea coast, with Bat'umi being the largest",
    "natural_resources": [
        "timber",
        "hydropower",
        "manganese deposits",
        "iron ore",
        "copper",
        "minor coal and oil deposits",
        "coastal climate and soils allow for important tea and citrus growth"
    ],
    "population": "3,997,000",
    "nationality": "Georgian(s)",
    "ethnic_groups": {
        "Georgian": "86.8%",
        "Azeri": "6.3%",
        "Armenian": "4.5%",
        "other": "2.3%"
    },
    "languages": {
        "Georgian (official)": "87.6%",
        "Azeri": "6.2%",
        "Armenian": "3.9%",
        "Russian": "1.2%",
        "other": "1%"
    },
    "religions": {
        "Orthodox (official)": "83.4%", 
        "Muslim": "10.7%", 
        "Armenian Apostolic": "2.9%", 
        "other": "1.2%", 
        "none": "0.5%", 
        "unspecified/no answer": "1.2%"},
    "government_type": "semi-presidential republic",
    "national_symbols": "Saint George, lion",
    "national_colors": ["red", "white"],
    "gdp": "$15.16 billion",
    "agriculture": [
        "citrus",
        "grapes",
        "tea",
        "hazelnuts",
        "vegetables",
        "livestock"
    ],
    "industries": [
        "steel",
        "machine tools",
        "electrical appliances",
        "manganese",
        "copper",
        "gold",
        "chemicals",
        "wood products",
        "wine"
    ],
    "exports": [
        "vehicles",
        "ferro-alloys",
        "fertilizers",
        "nuts",
        "scrap metal",
        "gold",
        "copper ores"
    ],
    "imports": [
        "fuels",
        "vehicles",
        "machinery and parts",
        "grain and other foods",
        "pharmaceuticals"
    ],
    "broadband_subscriptions": "840,603",
    "internet_users": "2,464,107",
    "mobile_subscriptions": "5,459,239",
    "internet_country_code": ".ge",
    "military_and_security_forces": "Georgian Defense Forces: Land Forces (include Air and Air Defense Forces); separatist Abkhazia Armed Forces: Ground Forces, Air Forces; separatist South Ossetia Armed Forces",
    "percent_GDP_on_military": "2%",
    "pipelines": [
        "1596 km gas",
        "1175 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Black Sea - Bat'umi, P'ot'i"
    },
    "waterways": "Unknown",
    "number_of_airports": "22",
    "international_disputes": "Russia's military support and subsequent recognition of Abkhazia and South Ossetia independence in 2008 continue to sour relations with Georgia"
}