{
    "name": "Haiti",
    "background": "The native Taino - who inhabited the island of Hispaniola when Christopher COLUMBUS first landed on it in 1492 - were virtually wiped out by Spanish settlers within 25 years. In the early 17th century, the French established a presence on Hispaniola. In 1697, Spain ceded to the French the western third of the island, which later became Haiti. The French colony, based on forestry and sugar-related industries, became one of the wealthiest in the Caribbean but relied heavily on the forced labor of enslaved Africans and environmentally degrading practices. In the late 18th century, Toussaint L'OUVERTURE led a revolution of Haiti's nearly half a million slaves that ended France's rule on the island. After a prolonged struggle, and under the leadership of Jean-Jacques DESSALINES, Haiti became the first country in the world led by former slaves after declaring its independence in 1804, but it was forced to pay an indemnity to France for more than a century and was shunned by other countries for nearly 40 years. After the US occupied Haiti from 1915-1934, Francois \"Papa Doc\" DUVALIER and then his son Jean-Claude “Baby Doc” DUVALIER led repressive and corrupt regimes that ruled Haiti from 1957-1971 and 1971-1986, respectively. A massive magnitude 7.0 earthquake struck Haiti in January 2010 with an epicenter about 25 km (15 mi) west of the capital, Port-au-Prince. Estimates are that over 300,000 people were killed and some 1.5 million left homeless. The earthquake was assessed as the worst in this region over the last 200 years. On 4 October 2016, Hurricane Matthew made landfall in Haiti, resulting in over 500 deaths and causing extensive damage to crops, houses, livestock, and infrastructure. Currently the poorest country in the Western Hemisphere, Haiti continues to experience bouts of political instability.",
    "coordinates": "19 00 N, 72 25 W",
    "region": "Central America and the Caribbean",
    "total_area": "27,750 sq km",
    "land_area": "27,560 sq km",
    "water_area": "190 sq km",
    "land_boundary": "376 km",
    "neighbors": {},
    "climate": "tropical; semiarid where mountains in east cut off trade winds",
    "coastline": "1,771 km",
    "natural_hazards": [
        "lies in the middle of the hurricane belt and subject to severe storms from June to October",
        "occasional flooding and earthquakes",
        "periodic droughts"
    ],
    "terrain": "mostly rough and mountainous",
    "population_distribution": "fairly even distribution; largest concentrations located near coastal areas",
    "natural_resources": [
        "bauxite",
        "copper",
        "calcium carbonate",
        "gold",
        "marble",
        "hydropower",
        "arable land"
    ],
    "population": "11,067,777",
    "nationality": "Haitian(s)",
    "ethnic_groups": {"black": "95%", "mixed and white": "5%"},
    "languages": {
        "French (official)": "",
        "Creole (official)": ""
    },
    "religions": {
        "Roman Catholic": "54.7%", "Protestant": "28.5%", "Vodou": "2.1%", 
        "other": "4.6%", "none": "10.2%"},
    "government_type": "semi-presidential republic",
    "national_symbols": "Hispaniolan trogon (bird), hibiscus flower",
    "national_colors": ["blue", "red"],
    "gdp": "$8.608 billion",
    "agriculture": [
        "coffee",
        "mangoes",
        "cocoa",
        "sugarcane",
        "rice",
        "corn",
        "sorghum",
        "wood",
        "vetiver"
    ],
    "industries": [
        "textiles",
        "sugar refining",
        "flour milling",
        "cement",
        "light assembly using imported parts"
    ],
    "exports": [
        "apparel",
        "manufactures",
        "oils",
        "cocoa",
        "mangoes",
        "coffee"
    ],
    "imports": [
        "food",
        "manufactured goods",
        "machinery and transport equipment",
        "fuels",
        "raw materials"
    ],
    "broadband_subscriptions": "31,100",
    "internet_users": "1,282,686",
    "mobile_subscriptions": "6,399,044",
    "internet_country_code": ".ht",
    "military_and_security_forces": "the Haitian Armed Forces (FAdH), disbanded in 1995, began to be reconstituted in 2017 to assist with natural disaster relief, border security, and combating transnational crime; the small Coast Guard is not part of the military, but rather the Haitian National Police.",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Cap-Haitien, Gonaives, Jacmel, Port-au-Prince"
    },
    "waterways": "Unknown",
    "number_of_airports": "14",
    "international_disputes": "since 2004, peacekeepers from the UN Stabilization Mission in Haiti have assisted in maintaining civil order in Haiti; the mission currently includes 6,685 military, 2,607 police, and 443 civilian personnel; despite efforts to control illegal migration, Haitians cross into the Dominican Republic and sail to neighboring countries; Haiti claims US-administered Navassa Island"
}