{
    "name": "India",
    "background": "The Indus Valley civilization, one of the world's oldest, flourished during the 3rd and 2nd millennia B.C. and extended into northwestern India. Aryan tribes from the northwest infiltrated the Indian subcontinent about 1500 B.C.; their merger with the earlier Dravidian inhabitants created the classical Indian culture. The Maurya Empire of the 4th and 3rd centuries B.C. - which reached its zenith under ASHOKA - united much of South Asia. The Golden Age ushered in by the Gupta dynasty (4th to 6th centuries A.D.) saw a flowering of Indian science, art, and culture. Islam spread across the subcontinent over a period of 700 years. In the 10th and 11th centuries, Turks and Afghans invaded India and established the Delhi Sultanate. In the early 16th century, the Emperor BABUR established the Mughal Dynasty, which ruled India for more than three centuries. European explorers began establishing footholds in India during the 16th century.\nBy the 19th century, Great Britain had become the dominant political power on the subcontinent and India was seen as the \"Jewel in the Crown\" of the British Empire. The British Indian Army played a vital role in both World Wars. Years of nonviolent resistance to British rule, led by Mohandas GANDHI and Jawaharlal NEHRU, eventually resulted in Indian independence in 1947. Large-scale communal violence took place before and after the subcontinent partition into two separate states - India and Pakistan. The neighboring countries have fought three wars since independence, the last of which was in 1971 and resulted in East Pakistan becoming the separate nation of Bangladesh. India's nuclear weapons tests in 1998 emboldened Pakistan to conduct its own tests that same year. In November 2008, terrorists originating from Pakistan conducted a series of coordinated attacks in Mumbai, India's financial capital. India's economic growth following the launch of economic reforms in 1991, a massive youthful population, and a strategic geographic location have contributed to India's emergence as a regional and global power. However, India still faces pressing problems such as environmental degradation, extensive poverty, and widespread corruption, and its restrictive business climate is dampening economic growth expectations.",
    "coordinates": "20 00 N, 77 00 E",
    "region": "Asia",
    "total_area": "3,287,263 sq km",
    "land_area": "2,973,193 sq km",
    "water_area": "314,070 sq km",
    "land_boundary": "13,888 km",
    "neighbors": {
        "Bhutan": "659 km",
        "Burma": "1468 km",
        "China": "2659 km",
        "Nepal": "1770 km",
        "Pakistan": "3190 km"
    },
    "climate": "varies from tropical monsoon in south to temperate in north",
    "coastline": "7,000 km",
    "natural_hazards": [
        "droughts",
        "flash floods, as well as widespread and destructive flooding from monsoonal rains",
        "severe thunderstorms",
        "earthquakes",
        "volcanism: Barren Island (354 m) in the Andaman Sea has been active in recent years"
    ],
    "terrain": "upland plain (Deccan Plateau) in south, flat to rolling plain along the Ganges, deserts in west, Himalayas in north",
    "population_distribution": "with the notable exception of the deserts in the northwest, including the Thar Desert, and the mountain fringe in the north, a very high population density exists throughout most of the country; the core of the population is in the north along the banks of the Ganges, with other river valleys and southern coastal areas also having large population concentrations",
    "natural_resources": [
        "coal (fourth-largest reserves in the world)",
        "antimony",
        "iron ore",
        "lead",
        "manganese",
        "mica",
        "bauxite",
        "rare earth elements",
        "titanium ore",
        "chromite",
        "natural gas",
        "diamonds",
        "petroleum",
        "limestone",
        "arable land"
    ],
    "population": "1,326,093,247",
    "nationality": "Indian(s)",
    "ethnic_groups": {
        "Indo-Aryan": "72%",
        "Dravidian": "25%",
        "Mongoloid and other": "3%"
    },
    "languages": {
        "Hindi": "43.6%",
        "Bengali": "8%",
        "Marathi": "6.9%",
        "Telugu": "6.7%",
        "Tamil": "5.7%",
        "Gujarati": "4.6%",
        "Urdu": "4.2%",
        "Kannada": "3.6%",
        "Odia": "3.1%",
        "Malayalam": "2.9%",
        "Punjabi": "2.7%",
        "Assamese": "1.3%",
        "Maithili": "1.1%",
        "other": "5.6%"
    },
    "religions": {
        "Hindu": "79.8%",
        "Muslim": "14.2%",
        "Christian": "2.3%",
        "Sikh": "1.7%",
        "other and unspecified": "2%"
    },
    "government_type": "federal parliamentary republic",
    "national_symbols": "the Lion Capital of Ashoka, which depicts four Asiatic lions standing back to back mounted on a circular abacus, is the official emblem; Bengal tiger; lotus flower",
    "national_colors": [
        "saffron",
        "white",
        "green"
    ],
    "gdp": "$2,602 billion",
    "agriculture": [
        "rice",
        "wheat",
        "oilseed",
        "cotton",
        "jute",
        "tea",
        "sugarcane",
        "lentils",
        "onions",
        "potatoes",
        "dairy products",
        "sheep",
        "goats",
        "poultry",
        "fish"
    ],
    "industries": [
        "textiles",
        "chemicals",
        "food processing",
        "steel",
        "transportation equipment",
        "cement",
        "mining",
        "petroleum",
        "machinery",
        "software",
        "pharmaceuticals"
    ],
    "exports": [
        "petroleum products",
        "precious stones",
        "vehicles",
        "machinery",
        "iron and steel",
        "chemicals",
        "pharmaceutical products",
        "cereals",
        "apparel"
    ],
    "imports": [
        "crude oil",
        "precious stones",
        "machinery",
        "chemicals",
        "fertilizer",
        "plastics",
        "iron and steel"
    ],
    "broadband_subscriptions": "18,170,000",
    "internet_users": "374,328,160",
    "mobile_subscriptions": "1,176,021,869",
    "internet_country_code": ".in",
    "military_and_security_forces": "Indian Armed Forces: Army, Navy (includes marines), Air Force, Coast Guard; Defense Security Corps (paramilitary forces); Ministry of Home Affairs paramilitary forces: Central Armed Police Force (includes Assam Rifles, Border Security Force, Central Industrial Security Force, Central Reserve Police Force, Indo-Tibetan Border Police, National Security Guards, Sashastra Seema Bal)",
    "percent_GDP_on_military": "2.4%",
    "pipelines": [
        "9 km condensate/gas",
        "13581 km gas",
        "2054 km liquid petroleum gas",
        "8943 km oil",
        "20 km oil/gas/water",
        "11069 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Chennai, Jawaharal Nehru Port, Kandla, Kolkata (Calcutta), Mumbai (Bombay), Sikka, Vishakhapatnam",
        "container port(s) (TEUs)": "Chennai (1,549,457), Jawaharal Nehru Port (4,833,397), Mundra (4,240,260)",
        "LNG terminal(s) (import)": "Dabhol, Dahej, Hazira"
    },
    "waterways": "14,500 km",
    "number_of_airports": "346",
    "international_disputes": "since China and India launched a security and foreign policy dialogue in 2005, consolidated discussions related to the dispute over most of their rugged, militarized boundary, regional nuclear proliferation, Indian claims that China transferred missiles to Pakistan, and other matters continue; Kashmir remains the site of the world's largest and most militarized territorial dispute with portions under the de facto administration of China (Aksai Chin), India (Jammu and Kashmir), and Pakistan (Azad Kashmir and Northern Areas); India and Pakistan resumed bilateral dialogue in February 2011 after a two-year hiatus, have maintained the 2003 cease-fire in Kashmir, and continue to have disputes over water sharing of the Indus River and its tributaries; UN Military Observer Group in India and Pakistan has maintained a small group of peacekeepers since 1949; India does not recognize Pakistan's ceding historic Kashmir lands to China in 1964; to defuse tensions and prepare for discussions on a maritime boundary, India and Pakistan seek technical resolution of the disputed boundary in Sir Creek estuary at the mouth of the Rann of Kutch in the Arabian Sea; Pakistani maps continue to show its Junagadh claim in Indian Gujarat State; Prime Minister Singh's September 2011 visit to Bangladesh resulted in the signing of a Protocol to the 1974 Land Boundary Agreement between India and Bangladesh, which had called for the settlement of longstanding boundary disputes over undemarcated areas and the exchange of territorial enclaves, but which had never been implemented; Bangladesh referred its maritime boundary claims with Burma and India to the International Tribunal on the Law of the Sea; Joint Border Committee with Nepal continues to examine contested boundary sections, including the 400 sq km dispute over the source of the Kalapani River; India maintains a strict border regime to keep out Maoist insurgents and control illegal cross-border activities from Nepal",
    "terrorism": {
        "Hizbul Mujahideen (HM)": "annex the state of Jammu and Kashmir to Pakistanarea(s) of operation",
        "Indian Mujahedeen (IM)": "establish Islamic rule in India and, ultimately, convert all non-Muslims to Islam; stated goal is to carry out terrorist attacks against Indians for perceived atrocities against Indian Muslimsarea(s) of operation",
        "al-Qa'ida (AQ)": "overthrow the Indian Government and, ultimately, establish a pan-Islamic caliphate under a strict Salafi Muslim interpretation of shariaarea(s) of operation",
        "al-Qa'ida in the Indian Subcontinent (AQIS)": "establish an Islamic caliphate in the Indian subcontinentarea(s) of operation",
        "Harakat ul-Mujahidin (HUM)": "enhance its networks and paramilitary training in India and, ultimately, annex Kashmir into Pakistan and establish an Islamic state in Kashmirarea(s) of operation",
        "Harakat ul-Jihad-i-Islami (HUJI)": "enhance its networks and operational capabilities in Indiaarea(s) of operation",
        "Harakat ul-Jihad-i-Islami/Bangladesh (HUJI-B)": "enhance its networks in India and, ultimately, install an Islamic state in Bangladesharea(s) of operation",
        "Islamic State of Iraq and ash-Sham-Khorasan (ISIS-K)": " spread the ISIS caliphate by eliminating the Indian Government and, ultimately, unite Kashmir with Pakistanarea(s) of operation",
        "Jaish-e-Mohammed (JEM)": "annex Jammu and Kashmir to Pakistanarea(s) of operation",
        "Lashkar-e Tayyiba (LT)": "annex Jammu and Kashmir State to Pakistan and, ultimately, install Islamic rule throughout South Asiaarea(s) of operation",
        "Liberation Tigers of Tamil Eelam (LTTE)": "enhance its networks in India and, ultimately, revive the movement to establish a Tamil homelandarea(s) of operation"
    }
}