{
    "name": "Japan",
    "background": "In 1603, after decades of civil warfare, the Tokugawa shogunate (a military-led, dynastic government) ushered in a long period of relative political stability and isolation from foreign influence. For more than two centuries this policy enabled Japan to enjoy a flowering of its indigenous culture. Japan opened its ports after signing the Treaty of Kanagawa with the US in 1854 and began to intensively modernize and industrialize. During the late 19th and early 20th centuries, Japan became a regional power that was able to defeat the forces of both China and Russia. It occupied Korea, Formosa (Taiwan), and southern Sakhalin Island. In 1931-32 Japan occupied Manchuria, and in 1937 it launched a full-scale invasion of China. Japan attacked US forces in 1941 - triggering America's entry into World War II - and soon occupied much of East and Southeast Asia. After its defeat in World War II, Japan recovered to become an economic power and an ally of the US. While the emperor retains his throne as a symbol of national unity, elected politicians hold actual decision-making power. Following three decades of unprecedented growth, Japan's economy experienced a major slowdown starting in the 1990s, but the country remains an economic power. In March 2011, Japan's strongest-ever earthquake, and an accompanying tsunami, devastated the northeast part of Honshu island, killed thousands, and damaged several nuclear power plants. Prime Minister Shinzo ABE was reelected to office in December 2012, and has since embarked on ambitious economic and security reforms to improve Japan's economy and bolster the country's international standing. In November 2019, ABE became Japan's longest-serving post-war prime minister.",
    "coordinates": "36 00 N, 138 00 E",
    "region": "Asia",
    "total_area": "377,915 sq km",
    "land_area": "364,485 sq km",
    "water_area": "13,430 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "varies from tropical in south to cool temperate in north",
    "coastline": "29,751 km",
    "natural_hazards": [
        "many dormant and some active volcanoes",
        "about 1,500 seismic occurrences (mostly tremors but occasional severe earthquakes) every year",
        "tsunamis",
        "typhoons",
        "volcanism: both Unzen (1,500 m) and Sakura-jima (1,117 m), which lies near the densely populated city of Kagoshima, have been deemed Decade Volcanoes by the International Association of Volcanology and Chemistry of the Earth's Interior, worthy of study due to their explosive history and close proximity to human populations; other notable historically active volcanoes include Asama, Honshu Island's most active volcano, Aso, Bandai, Fuji, Iwo-Jima, Kikai, Kirishima, Komaga-take, Oshima, Suwanosejima, Tokachi, Yake-dake, and Usu; see note 2 under \"Geography - note\""
    ],
    "terrain": "mostly rugged and mountainous",
    "population_distribution": "all primary and secondary regions of high population density lie on the coast; one-third of the population resides in and around Tokyo on the central plain (Kanto Plain)",
    "natural_resources": [
        "negligible mineral resources",
        "fish",
        "note",
        "with virtually no natural energy resources",
        "Japan is the world's largest importer of coal and liquefied natural gas",
        "as well as the second largest importer of oil"
    ],
    "population": "125,507,472",
    "nationality": "Japanese (singular and plural)",
    "ethnic_groups": {
        "Japanese": "98.1%",
        "Chinese": "0.5%",
        "Korean": "0.4%",
        "other": "1%"
    },
    "languages": [
        "Japanese"
    ],
    "religions": {
        "Shintoism": "70.4%",
        "Buddhism": "69.8%",
        "Christianity": "1.5%",
        "other": "6.9%"
    },
    "government_type": "parliamentary constitutional monarchy",
    "national_symbols": "red sun disc, chrysanthemum",
    "national_colors": [
        "red",
        "white"
    ],
    "gdp": "$4,873 billion",
    "agriculture": [
        "vegetables",
        "rice",
        "fish",
        "poultry",
        "fruit",
        "dairy products",
        "pork",
        "beef",
        "flowers",
        "potatoes/taros/yams",
        "sugarcane",
        "tea",
        "legumes",
        "wheat and barley"
    ],
    "industries": [
        "among world's largest and most technologically advanced producers of motor vehicles",
        "electronic equipment",
        "machine tools",
        "steel and nonferrous metals",
        "ships",
        "chemicals",
        "textiles",
        "processed foods"
    ],
    "exports": [
        "14.9 motor vehicles5.4 iron and steel products5 semiconductors4.8 auto parts3.5 power generating machinery3.3 plastic materials"
    ],
    "imports": [
        "16.1 petroleum9.1 liquid natural gas3.8 clothing3.3 semiconductors2.4 coal1.4 audio and visual apparatus"
    ],
    "broadband_subscriptions": "41,496,293",
    "internet_users": "116,565,962",
    "mobile_subscriptions": "179,872,794",
    "internet_country_code": ".jp",
    "military_and_security_forces": "Japan Self-Defense Force (JSDF): Ground Self-Defense Force (Rikujou Jieitai, GSDF; includes aviation), Maritime Self-Defense Force (Kaijou Jieitai, MSDF; includes naval aviation), Air Self-Defense Force (Koukuu Jieitai, ASDF); Japan Coast Guard (Ministry of Land, Transport, Infrastructure and Tourism)",
    "percent_GDP_on_military": "0.93%",
    "pipelines": [
        "4456 km gas",
        "174 km oil",
        "104 km oil/gas/water"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Chiba, Kawasaki, Kobe, Mizushima, Moji, Nagoya, Osaka, Tokyo, Tomakomai, Yokohama",
        "container port(s) (TEUs)": "Kobe (2,924,179), Nagoya (2,784,109), Osaka (2,326,852), Tokyo (4,500,156), Yokohama (2,926,698)",
        "LNG terminal(s) (import)": "Chita, Fukwoke, Futtsu, Hachinone, Hakodate, Hatsukaichi, Higashi Ohgishima, Higashi Niigata, Himeiji, Joetsu, Kagoshima, Kawagoe, Kita Kyushu, Mizushima, Nagasaki, Naoetsu, Negishi, Ohgishima, Oita, Sakai, Sakaide, Senboku, Shimizu, Shin Minato, Sodegaura, Tobata, Yanai, Yokkaichi"
    },
    "waterways": "1,770 km",
    "number_of_airports": "175",
    "international_disputes": "the sovereignty dispute over the islands of Etorofu, Kunashiri, and Shikotan, and the Habomai group, known in Japan as the \"Northern Territories\" and in Russia as the \"Southern Kuril Islands,\" occupied by the Soviet Union in 1945, now administered by Russia and claimed by Japan, remains the primary sticking point to signing a peace treaty formally ending World War II hostilities; Japan and South Korea claim Liancourt Rocks (Take-shima/Tok-do) occupied by South Korea since 1954; the Japanese-administered Senkaku Islands are also claimed by China and Taiwan",
    "terrorism": "None/Unknown"
}