{
    "name": "Korea, South",
    "background": "An independent kingdom for much of its long history, Korea was occupied by Japan beginning in 1905 following the Russo-Japanese War. In 1910, Tokyo formally annexed the entire Peninsula. Korea regained its independence following Japan's surrender to the US in 1945. After World War II, a democratic government (Republic of Korea, ROK) was set up in the southern half of the Korean Peninsula while a communist-style government was installed in the north (Democratic People's Republic of Korea, DPRK). During the Korean War (1950-53), US troops and UN forces fought alongside ROK soldiers to defend South Korea from a DPRK invasion supported by communist China and the Soviet Union. A 1953 armistice split the Peninsula along a demilitarized zone at about the 38th parallel. PARK Chung-hee took over leadership of the country in a 1961 coup. During his regime, from 1961 to 1979, South Korea achieved rapid economic growth, with per capita income rising to roughly 17 times the level of North Korea in 1979.\nSouth Korea held its first free presidential election under a revised democratic constitution in 1987, with former ROK Army general ROH Tae-woo winning a close race. In 1993, KIM Young-sam (1993-98) became the first civilian president of South Korea's new democratic era. President KIM Dae-jung (1998-2003) won the Nobel Peace Prize in 2000 for his contributions to South Korean democracy and his \"Sunshine\" policy of engagement with North Korea. President PARK Geun-hye, daughter of former ROK President PARK Chung-hee, took office in February 2013 as South Korea's first female leader. In December 2016, the National Assembly passed an impeachment motion against President PARK over her alleged involvement in a corruption and influence-peddling scandal, immediately suspending her presidential authorities. The impeachment was upheld in March 2017, triggering an early presidential election in May 2017 won by MOON Jae-in. South Korea hosted the Winter Olympic and Paralympic Games in February 2018, in which North Korea also participated. Discord with North Korea has permeated inter-Korean relations for much of the past decade, highlighted by the North's attacks on a South Korean ship and island in 2010, the exchange of artillery fire across the DMZ in 2015, and multiple nuclear and missile tests in 2016 and 2017. North Korea's participation in the Winter Olympics, dispatch of a senior delegation to Seoul, and three inter-Korean summits in 2018 appear to have ushered in a temporary period of respite, buoyed by the historic US-DPRK summits in 2018 and 2019.",
    "coordinates": "37 00 N, 127 30 E",
    "region": "Asia",
    "total_area": "99,720 sq km",
    "land_area": "96,920 sq km",
    "water_area": "2,800 sq km",
    "land_boundary": "237 km",
    "neighbors": {},
    "climate": "temperate, with rainfall heavier in summer than winter; cold winters",
    "coastline": "2,413 km",
    "natural_hazards": [
        "occasional typhoons bring high winds and floods",
        "low-level seismic activity common in southwest",
        "volcanism: Halla (1,950 m) is considered historically active although it has not erupted in many centuries"
    ],
    "terrain": "mostly hills and mountains; wide coastal plains in west and south",
    "population_distribution": "with approximately 70% of the country considered mountainous, the country's population is primarily concentrated in the lowland areas, where density is quite high; Gyeonggi Province in the northwest, which surrounds the capital of Seoul and contains the port of Incheon, is the most densely populated province; Gangwon in the northeast is the least populated",
    "natural_resources": [
        "coal",
        "tungsten",
        "graphite",
        "molybdenum",
        "lead",
        "hydropower potential"
    ],
    "population": "51,835,110",
    "nationality": "Korean(s)",
    "ethnic_groups": {
        "homogeneous": ""
    },
    "languages": {
        "Korean": "",
        "English": ""
    },
    "religions": {
        "Protestant": "19.7%",
        "Buddhist": "15.5%",
        "Catholic": "7.9%",
        "none": "56.9%"
    },
    "government_type": "presidential republic",
    "national_symbols": "taegeuk (yin yang symbol), Hibiscus syriacus (Rose of Sharon), Siberian tiger",
    "national_colors": [
        "red",
        "white",
        "blue",
        "black"
    ],
    "gdp": "$1,540 billion",
    "agriculture": [
        "rice",
        "root crops",
        "barley",
        "vegetables",
        "fruit",
        "cattle",
        "pigs",
        "chickens",
        "milk",
        "eggs",
        "fish"
    ],
    "industries": [
        "electronics",
        "telecommunications",
        "automobile production",
        "chemicals",
        "shipbuilding",
        "steel"
    ],
    "exports": [
        "semiconductors",
        "petrochemicals",
        "automobile/auto parts",
        "ships",
        "wireless communication equipment",
        "flat displays",
        "steel",
        "electronics",
        "plastics",
        "computers"
    ],
    "imports": [
        "crude oil/petroleum products",
        "semiconductors",
        "natural gas",
        "coal",
        "steel",
        "computers",
        "wireless communication equipment",
        "automobiles",
        "fine chemicals",
        "textiles"
    ],
    "broadband_subscriptions": "21,285,858",
    "internet_users": "44.153 million",
    "mobile_subscriptions": "66,355,778",
    "internet_country_code": ".kr",
    "military_and_security_forces": "Armed Forces of the Republic of Korea: Republic of Korea Army (ROKA), Navy (ROKN, includes Marine Corps, ROKMC), Air Force (ROKAF); Military reserves include Mobilization Reserve Forces (First Combat Forces) and Homeland Defense Forces (Regional Combat Forces); Ministry of Maritime Affairs and Fisheries: Korea Coast Guard",
    "percent_GDP_on_military": "2.7%",
    "pipelines": [
        "3790 km gas",
        "16 km oil",
        "889 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Busan, Incheon, Gunsan, Kwangyang, Mokpo, Pohang, Ulsan, Yeosu",
        "container port(s) (TEUs)": "Busan (20,493,000), Incheon (3,050,000), Kwangyang (2,230,000)",
        "LNG terminal(s) (import)": "Incheon, Kwangyang, Pyeongtaek, Samcheok, Tongyeong, Yeosu"
    },
    "waterways": "1,600 km",
    "number_of_airports": "111",
    "international_disputes": "Military Demarcation Line within the 4-km-wide Demilitarized Zone has separated North from South Korea since 1953; periodic incidents with North Korea in the Yellow Sea over the Northern Limit Line, which South Korea claims as a maritime boundary; South Korea and Japan claim Liancourt Rocks (Tok-do/Take-shima), occupied by South Korea since 1954",
    "terrorism": "Unknown"
}