{
    "id": "location--110",
    "name": "Kosovo",
    "background": "The central Balkans were part of the Roman and Byzantine Empires before ethnic Serbs migrated to the territories of modern Kosovo in the 7th century. During the medieval period, Kosovo became the center of a Serbian Empire and saw the construction of many important Serb religious sites, including many architecturally significant Serbian Orthodox monasteries. The defeat of Serbian forces at the Battle of Kosovo in 1389 led to five centuries of Ottoman rule during which large numbers of Turks and Albanians moved to Kosovo. By the end of the 19th century, Albanians replaced Serbs as the dominant ethnic group in Kosovo. Serbia reacquired control over the region from the Ottoman Empire during the First Balkan War of 1912. After World War II, Kosovo's present-day boundaries were established when Kosovo became an autonomous province of Serbia in the Socialist Federal Republic of Yugoslavia (S.F.R.Y.). Despite legislative concessions, Albanian nationalism increased in the 1980s, which led to riots and calls for Kosovo's independence. The Serbs - many of whom viewed Kosovo as their cultural heartland - instituted a new constitution in 1989 revoking Kosovo's autonomous status. Kosovo's Albanian leaders responded in 1991 by organizing a referendum declaring Kosovo independent. Serbia undertook repressive measures against the Kosovar Albanians in the 1990s, provoking a Kosovar Albanian insurgency.\nBeginning in 1998, Serbia conducted a brutal counterinsurgency campaign that resulted in massacres and massive expulsions of ethnic Albanians (some 800,000 ethnic Albanians were forced from their homes in Kosovo). After international attempts to mediate the conflict failed, a three-month NATO military operation against Serbia beginning in March 1999 forced the Serbs to agree to withdraw their military and police forces from Kosovo. UN Security Council Resolution 1244 (1999) placed Kosovo under a transitional administration, the UN Interim Administration Mission in Kosovo (UNMIK), pending a determination of Kosovo's future status. A UN-led process began in late 2005 to determine Kosovo's final status. The 2006-07 negotiations ended without agreement between Belgrade and Pristina, though the UN issued a comprehensive report on Kosovo's final status that endorsed independence. On 17 February 2008, the Kosovo Assembly declared Kosovo independent. Since then, over 100 countries have recognized Kosovo, and it has joined numerous international organizations. In October 2008, Serbia sought an advisory opinion from the International Court of Justice (ICJ) on the legality under international law of Kosovo's declaration of independence. The ICJ released the advisory opinion in July 2010 affirming that Kosovo's declaration of independence did not violate general principles of international law, UN Security Council Resolution 1244, or the Constitutive Framework. The opinion was closely tailored to Kosovo's unique history and circumstances.\nDemonstrating Kosovo's development into a sovereign, multi-ethnic, democratic country the international community ended the period of Supervised Independence in 2012. Kosovo held its most recent national and municipal elections in 2017. Serbia continues to reject Kosovo's independence, but the two countries agreed in April 2013 to normalize their relations through EU-facilitated talks, which produced several subsequent agreements the parties are engaged in implementing, though they have not yet reached a comprehensive normalization of relations. Kosovo seeks full integration into the international community, and has pursued bilateral recognitions and memberships in international organizations. Kosovo signed a Stabilization and Association Agreement with the EU in 2015, and was named by a 2018 EU report as one of six Western Balkan countries that will be able to join the organization once it meets the criteria to accede. Kosovo also seeks memberships in the UN and in NATO.",
    "coordinates": "42 35 N, 21 00 E",
    "region": "Europe",
    "total_area": "10,887 sq km",
    "land_area": "10,887 sq km",
    "water_area": "0 sq km",
    "land_boundary": "714 km",
    "neighbors": {
        "Macedonia": "160 km",
        "Montenegro": "76 km",
        "Serbia": "366 km"
    },
    "climate": "influenced by continental air masses resulting in relatively cold winters with heavy snowfall and hot, dry summers and autumns; Mediterranean and alpine influences create regional variation; maximum rainfall between October and December",
    "coastline": "0 km",
    "natural_hazards": "Unknown",
    "terrain": "flat fluvial basin at an elevation of 400-700 m above sea level surrounded by several high mountain ranges with elevations of 2,000 to 2,500 m",
    "population_distribution": "population clusters exist throughout the country, the largest being in the east in and around the capital of Pristina",
    "natural_resources": [
        "nickel",
        "lead",
        "zinc",
        "magnesium",
        "lignite",
        "kaolin",
        "chrome",
        "bauxite"
    ],
    "population": "1,932,774",
    "nationality": "Kosovar (Albanian)",
    "ethnic_groups": {
        "Albanians": "92.9%",
        "Bosniaks": "1.6%",
        "Serbs": "1.5%",
        "Turk": "1.1%",
        "Ashkali": "0.9%",
        "Egyptian": "0.7%",
        "Gorani": "0.6%",
        "Romani": "0.5%",
        "other/unspecified": "0.2%"
    },
    "languages": {
        "Albanian (official)": "94.5%",
        "Bosnian": "1.7%",
        "Serbian (official)": "1.6%",
        "Turkish": "1.1%",
        "other": "0.9%",
        "unspecified": "0.1%"
    },
    "religions": {
        "Muslim": "95.6%",
        "Roman Catholic": "2.2%",
        "Orthodox": "1.5%",
        "other": "0.1%",
        "none": "0.1%",
        "unspecified": "0.6%"
    },
    "government_type": "parliamentary republic",
    "national_symbol": "six, five-pointed, white stars",
    "national_colors": [
        "blue",
        "gold",
        "white"
    ],
    "gdp": "$7.094 billion",
    "agriculture": [
        "wheat",
        "corn",
        "berries",
        "potatoes",
        "peppers",
        "fruit",
        "dairy",
        "livestock",
        "fish"
    ],
    "industries": [
        "mineral mining",
        "construction materials",
        "base metals",
        "leather",
        "machinery",
        "appliances",
        "foodstuffs and beverages",
        "textiles"
    ],
    "exports": [
        "mining and processed metal products",
        "scrap metals",
        "leather products",
        "machinery",
        "appliances",
        "prepared foodstuffs",
        "beverages and tobacco",
        "vegetable products",
        "textiles and apparel"
    ],
    "imports": [
        "foodstuffs",
        "livestock",
        "wood",
        "petroleum",
        "chemicals",
        "machinery",
        "minerals",
        "textiles",
        "stone",
        "ceramic and glass products",
        "electrical equipment"
    ],
    "broadband_subscriptions": "Unknown",
    "internet_users": "1,706,150",
    "mobile_subscriptions": "562,000",
    "internet_country_code": ".xk\n        \n      \n\nnote: assigned as a temporary code under UN Security Council resolution 1244/99",
    "military_and_security_forces": "in December 2018, Kosovo adopted a legislative package to initiate a ten-year transition of the Kosovo Security Force (KSF) into a professional multi-ethnic force with a limited territorial defense mandate",
    "percent_GDP_on_military": "0.8%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "6",
    "international_disputes": "Serbia with several other states protest the US and other states' recognition of Kosovo's declaration of its status as a sovereign and independent state in February 2008; ethnic Serbian municipalities along Kosovo's northern border challenge final status of Kosovo-Serbia boundary; NATO-led Kosovo Force peacekeepers under UN Interim Administration Mission in Kosovo authority continue to ensure a safe and secure environment and freedom of movement for all Kosovo citizens; Kosovo and North Macedonia completed demarcation of their boundary in September 2008; Kosovo ratified the border demarcation agreement with Montenegro in March 2018, but the actual demarcation has not been completed",
    "terrorism": "None/Unknown"
}