{
    "id": "location--185",
    "name": "South Sudan",
    "background": "British explorer Samuel BAKER established the colony of Equatoria in 1870, in the name of the Ottoman Khedive of Egypt who claimed the territory. Headquartered in Gondokoro (near modern day Juba), Equatoria in theory composed most of what is now South Sudan. After being cut off from colonial administration during the Mahdist War from 1885-1898, Equatoria was made a state under the Anglo-Egyptian condominium in 1899. It was largely left to itself over the following decades, but Christian missionaries converted much of the population and facilitated the spread of English, rather than Arabic. Equatoria was ruled by British colonial administrators separately from what is now Sudan until the two colonies were combined at the 1947 Juba Conference, as part of British plans to prepare the region for independence. When Sudan gained its independence in 1956, it was with the understanding that the southerners would be able to participate fully in the political system. When the Arab Khartoum government reneged on its promises, a mutiny began that led to two prolonged periods of conflict (1955-1972 and 1983-2005) in which perhaps 2.5 million people died - mostly civilians - due to starvation and drought. Ongoing peace talks finally resulted in a Comprehensive Peace Agreement, signed in January 2005. As part of this agreement, the south was granted a six-year period of autonomy to be followed by a referendum on final status. The result of this referendum, held in January 2011, was a vote of 98% in favor of secession.Since independence on 9 July 2011, South Sudan has struggled with good governance and nation building and has attempted to control opposition forces operating in its territory. Economic conditions have deteriorated since January 2012 when the government decided to shut down oil production following bilateral disagreements with Sudan. In December 2013, conflict between government and opposition forces killed tens of thousands and led to a dire humanitarian crisis with millions of South Sudanese displaced and food insecure. The warring parties signed a peace agreement in August 2015 that created a transitional government of national unity in April 2016. However, in July 2016, fighting broke out in Juba between the two principal signatories, plunging the country back into conflict. A \"revitalized\" peace agreement was signed in September 2018 ending the fighting. Under the agreement, the government and various rebel groups agreed that the sides would form a unified national army and create a transitional government by May 2019. The agreement was extended until November 2019 and then subsequently to February 2020. However, implementation has been stalled, in part by a failure to agree on the country's internal political boundaries.",
    "coordinates": "8 00 N, 30 00 E",
    "region": "Africa",
    "total_area": "644,329 sq km",
    "land_area": "",
    "water_area": "",
    "land_boundary": "6,018 km",
    "neighbors": {
        "Democratic Republic of the Congo": "714 km",
        "Ethiopia": "1299 km",
        "Kenya": "317 km",
        "Sudan": "2158 km",
        "Uganda": "475 km"
    },
    "climate": "hot with seasonal rainfall influenced by the annual shift of the Inter-Tropical Convergence Zone; rainfall heaviest in upland areas of the south and diminishes to the north",
    "coastline": "0 km",
    "natural_hazards": "Unknown",
    "terrain": "plains in the north and center rise to southern highlands along the border with Uganda and Kenya; the White Nile, flowing north out of the uplands of Central Africa, is the major geographic feature of the country; The Sudd (a name derived from floating vegetation that hinders navigation) is a large swampy area of more than 100,000 sq km fed by the waters of the White Nile that dominates the center of the country",
    "population_distribution": "clusters found in urban areas, particularly in the western interior and around the White Nile as shown in this population distribution map",
    "natural_resources": [
        "hydropower",
        "fertile agricultural land",
        "gold",
        "diamonds",
        "petroleum",
        "hardwoods",
        "limestone",
        "iron ore",
        "copper",
        "chromium ore",
        "zinc",
        "tungsten",
        "mica",
        "silver"
    ],
    "population": "10,561,244",
    "nationality": "South Sudanese (singular and plural)",
    "ethnic_groups": {
        "Dinka": "35.8%",
        "Nuer": "15.6%",
        "Shilluk": "",
        "Azande": "",
        "Bari": "",
        "Kakwa": "",
        "Kuku": "",
        "Murle": "",
        "Mandari": "",
        "Didinga": "",
        "Ndogo": "",
        "Bviri": "",
        "Lndi": "",
        "Anuak": "",
        "Bongo": "",
        "Lango": "",
        "Dungotona": "",
        "Acholi": "",
        "Baka": "",
        "Fertit": ""
    },
    "languages": [
        "English (official)",
        "Arabic",
        "regional languages include Dinka",
        "Nuer",
        "Bari",
        "Zande",
        "Shilluk"
    ],
    "religions": [
        "animist",
        "Christian",
        "Muslim"
    ],
    "government_type": "presidential republic",
    "national_symbol": "African fish eagle",
    "national_colors": [
        "red",
        "green",
        "blue",
        "yellow",
        "black",
        "white"
    ],
    "gdp": "$3.06 billion",
    "agriculture": [
        "sorghum",
        "maize",
        "rice",
        "millet",
        "wheat",
        "gum arabic",
        "sugarcane",
        "mangoes",
        "papayas",
        "bananas",
        "sweet potatoes",
        "sunflower seeds",
        "cotton",
        "sesame seeds",
        "cassava",
        "beans",
        "peanuts",
        "cattle",
        "sheep"
    ],
    "industries": "Unknown",
    "exports": "Unknown",
    "imports": "Unknown",
    "broadband_subscriptions": "200",
    "internet_users": "814,326",
    "mobile_subscriptions": "3,672,871",
    "internet_country_code": ".ss",
    "military_and_security_forces": "South Sudan People’s Defence Force (SSPDF): Ground Force, Air Force, Air Defense Forces, Presidential Guard",
    "percent_GDP_on_military": "3.5%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "89",
    "international_disputes": "South Sudan-Sudan boundary represents 1 January 1956 alignment, final alignment pending negotiations and demarcation; final sovereignty status of Abyei Area pending negotiations between South Sudan and Sudan; periodic violent skirmishes with South Sudanese residents over water and grazing rights persist among related pastoral populations along the border with the Central African Republic; the boundary that separates Kenya and South Sudan's sovereignty is unclear in the \"Ilemi Triangle,\" which Kenya has administered since colonial times",
    "terrorism": "None/Unknown"
}