{
    "id": "location--136",
    "name": "Mongolia",
    "background": "The Mongols gained fame in the 13th century when under Chinggis KHAAN they established a huge Eurasian empire through conquest. After his death the empire was divided into several powerful Mongol states, but these broke apart in the 14th century. The Mongols eventually retired to their original steppe homelands and in the late 17th century came under Chinese rule. Mongolia declared its independence from the Manchu-led Qing Empire in 1911 and achieved limited autonomy until 1919, when it again came under Chinese control. The Mongolian Revolution of 1921 ended Chinese dominance, and a communist regime, the Mongolian People's Republic, took power in 1924.\nThe modern country of Mongolia, represents only part of the Mongols' historical homeland; today, more ethnic Mongolians live in the Inner Mongolia Autonomous Region in the People's Republic of China than in Mongolia. Since the country's peaceful democratic revolution in 1990, the ex-communist Mongolian People's Revolutionary Party (MPRP) - which took the name Mongolian People's Party (MPP) in 2010 - has competed for political power with the Democratic Party (DP) and several other smaller parties, including a new party formed by former President ENKHBAYAR, which confusingly adopted for itself the MPRP name. In the country's most recent parliamentary elections in June 2016, Mongolians handed the MPP overwhelming control of Parliament, largely pushing out the DP, which had overseen a sharp decline in Mongolia's economy during its control of Parliament in the preceding years. Mongolians elected a DP member, Khaltmaa BATTULGA, as president in 2017.",
    "coordinates": "46 00 N, 105 00 E",
    "region": "Asia",
    "total_area": "1,564,116 sq km",
    "land_area": "1,553,556 sq km",
    "water_area": "10,560 sq km",
    "land_boundary": "8,082 km",
    "neighbors": {
        "Russia": "3452 km"
    },
    "climate": "desert; continental (large daily and seasonal temperature ranges)",
    "coastline": "0 km",
    "natural_hazards": [
        "dust storms",
        "grassland and forest fires",
        "drought",
        "\"zud,\" which is harsh winter conditions"
    ],
    "terrain": "vast semidesert and desert plains, grassy steppe, mountains in west and southwest; Gobi Desert in south-central",
    "population_distribution": "sparsely distributed population throughout the country; the capital of Ulaanbaatar and the northern city of Darhan support the highest population densities",
    "natural_resources": [
        "oil",
        "coal",
        "copper",
        "molybdenum",
        "tungsten",
        "phosphates",
        "tin",
        "nickel",
        "zinc",
        "fluorspar",
        "gold",
        "silver",
        "iron"
    ],
    "population": "3,168,026",
    "nationality": "Mongolian(s)",
    "ethnic_groups": {
        "Khalkh": "84.5%",
        "Kazak": "3.9%",
        "Dorvod": "2.4%",
        "Bayad": "1.7%",
        "Buryat-Bouriates": "1.3%",
        "Zakhchin": "1%",
        "other": "5.2%"
    },
    "languages": {
        "Mongolian (official)": "90%",
        "Turkic": "",
        "Russian": ""
    },
    "religions": {
        "Buddhist": "53%",
        "Muslim": "3%",
        "Shamanist": "2.9%",
        "Christian": "2.2%",
        "other": "0.4%",
        "none": "38.6%"
    },
    "government_type": "semi-presidential republic",
    "national_symbols": "soyombo emblem",
    "national_colors": [
        "red",
        "blue",
        "yellow"
    ],
    "gdp": "$11.14 billion",
    "agriculture": [
        "wheat",
        "barley",
        "vegetables",
        "forage crops",
        "sheep",
        "goats",
        "cattle",
        "camels",
        "horses"
    ],
    "industries": [
        "construction and construction materials",
        "mining (coal, copper, molybdenum, fluorspar, tin, tungsten, gold)",
        "oil",
        "food and beverages",
        "processing of animal products",
        "cashmere and natural fiber manufacturing"
    ],
    "exports": [
        "copper",
        "apparel",
        "livestock",
        "animal products",
        "cashmere",
        "wool",
        "hides",
        "fluorspar",
        "other nonferrous metals",
        "coal",
        "crude oil"
    ],
    "imports": [
        "machinery and equipment",
        "fuel",
        "cars",
        "food products",
        "industrial consumer goods",
        "chemicals",
        "building materials",
        "cigarettes and tobacco",
        "appliances",
        "soap and detergent"
    ],
    "broadband_subscriptions": "306,150",
    "internet_users": "735,823",
    "mobile_subscriptions": "4,222,041",
    "internet_country_code": ".mn",
    "military_and_security_forces": "Mongolian Armed Forces (Mongol ulsyn zevsegt huchin): Mongolian Army (includes Border Troops), Mongolian Air Force, National Center for Emergency and Disaster Relief (coordinates the military's efforts as first-responders for earthquakes, wildfires, and forest fires; contagious diseases; and snow and dust storms as well as severe winters (known as zud); paramilitary forces: Internal Security Troops",
    "percent_GDP_on_military": "0.7%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "580 km",
    "number_of_airports": "44",
    "international_disputes": "none",
    "terrorism": "None/Unknown"
}