{
    "id": "location--62",
    "name": "Equatorial Guinea",
    "background": "Equatorial Guinea gained independence in 1968 after 190 years of Spanish rule; it is one of the smallest countries in Africa consisting of a mainland territory and five inhabited islands. The capital of Malabo is located on the island of Bioko, approximately 25 km from the Cameroonian coastline in the Gulf of Guinea. Between 1968 and 1979, autocratic President Francisco MACIAS NGUEMA virtually destroyed all of the country's political, economic, and social institutions before being deposed by his nephew Teodoro OBIANG NGUEMA MBASOGO in a coup. President OBIANG has ruled since October 1979. He has been elected several times since 1996, and was most recently reelected in 2016. Although nominally a constitutional democracy since 1991, presidential and legislative elections since 1996 have generally been labeled as flawed. The president exerts almost total control over the political system and has placed legal and bureaucratic barriers that hinder political opposition. Equatorial Guinea experienced rapid economic growth in the early years of the 21st century due to the discovery of large offshore oil reserves in 1996. Production peaked in late 2004 and has slowly declined since, although aggressive searches for new oil fields continue. Despite the country's economic windfall from oil production, resulting in massive increases in government revenue in past years, the drop in global oil prices as of 2014 has placed significant strain on the state budget and pushed the country into recession. Oil revenues have mainly been used for the development of infrastructure and there have been limited improvements in the population's living standards. Equatorial Guinea continues to seek to diversify its economy and to increase foreign investment. The country hosts major regional and international conferences and continues to seek a greater role in international affairs, and leadership in the sub-region.",
    "coordinates": "2 00 N, 10 00 E",
    "region": "Africa",
    "total_area": "28,051 sq km",
    "land_area": "28,051 sq km",
    "water_area": "0 sq km",
    "land_boundary": "528 km",
    "neighbors": {
        "Gabon": "345 km"
    },
    "climate": "tropical; always hot, humid",
    "coastline": "296 km",
    "natural_hazards": [
        "violent windstorms",
        "flash floods",
        "volcanism: Santa Isabel (3,007 m), which last erupted in 1923, is the country's only historically active volcano; Santa Isabel, along with two dormant volcanoes, form Bioko Island in the Gulf of Guinea"
    ],
    "terrain": "coastal plains rise to interior hills; islands are volcanic",
    "population_distribution": "only two large cities over 30,000 people (Bata on the mainland, and the capital Malabo on the island of Bioko); small communities are scattered throughout the mainland and the five inhabited islands as shown in this population distribution map",
    "natural_resources": [
        "petroleum",
        "natural gas",
        "timber",
        "gold",
        "bauxite",
        "diamonds",
        "tantalum",
        "sand and gravel",
        "clay"
    ],
    "population": "836,178",
    "nationality": "Equatorial Guinean(s) or Equatoguinean(s)",
    "ethnic_groups": {
        "Fang": "85.7%",
        "Bubi": "6.5%",
        "Mdowe": "3.6%",
        "Annobon": "1.6%",
        "Bujeba": "1.1%",
        "other": "1.4%"
    },
    "languages": {
        "Spanish (official)": "67.6%",
        "other": "",
        "French) (official)": "32.4%"
    },
    "religions": [
        "nominally Christian and predominantly Roman Catholic",
        "Muslim",
        "Baha'i",
        "animist",
        "indigenous"
    ],
    "government_type": "presidential republic",
    "national_symbols": "silk cotton tree",
    "national_colors": [
        "green",
        "white",
        "red",
        "blue"
    ],
    "gdp": "$12.49 billion",
    "agriculture": [
        "coffee",
        "cocoa",
        "rice",
        "yams",
        "cassava",
        "bananas",
        "palm oil nuts",
        "livestock",
        "timber"
    ],
    "industries": [
        "petroleum",
        "natural gas",
        "sawmilling"
    ],
    "exports": [
        "petroleum products",
        "timber"
    ],
    "imports": [
        "petroleum sector equipment",
        "other equipment",
        "construction materials",
        "vehicles"
    ],
    "broadband_subscriptions": "1,620",
    "internet_users": "209,253",
    "mobile_subscriptions": "591,223",
    "internet_country_code": ".gq",
    "military_and_security_forces": "Equatorial Guinea Armed Forces (FAGE): Equatorial Guinea National Guard (Guardia Nacional de Guinea Ecuatorial, GNGE (Army), Navy, Air Force; Guardia Civil (paramilitary force for internal security)",
    "percent_GDP_on_military": "1.1%",
    "pipelines": [
        "42 km condensate",
        "5 km condensate/gas",
        "79 km gas",
        "71 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Bata, Luba, Malabo",
        "LNG terminal(s) (export)": "Bioko Island"
    },
    "waterways": "Unknown",
    "number_of_airports": "7",
    "international_disputes": "in 2002, ICJ ruled on an equidistance settlement of Cameroon-Equatorial Guinea-Nigeria maritime boundary in the Gulf of Guinea, but a dispute between Equatorial Guinea and Cameroon over an island at the mouth of the Ntem River and imprecisely defined maritime coordinates in the ICJ decision delayed final delimitation; UN urged Equatorial Guinea and Gabon to resolve the sovereignty dispute over Gabon-occupied Mbane and lesser islands and to create a maritime boundary in the hydrocarbon-rich Corisco Bay",
    "terrorism": "None/Unknown"
}