{
    "id": "location--209",
    "name": "United Kingdom",
    "background": "The United Kingdom has historically played a leading role in developing parliamentary democracy and in advancing literature and science. At its zenith in the 19th century, the British Empire stretched over one-fourth of the earth's surface. The first half of the 20th century saw the UK's strength seriously depleted in two world wars and the Irish Republic's withdrawal from the union. The second half witnessed the dismantling of the Empire and the UK rebuilding itself into a modern and prosperous European nation. As one of five permanent members of the UN Security Council and a founding member of NATO and the Commonwealth, the UK pursues a global approach to foreign policy. The Scottish Parliament, the National Assembly for Wales, and the Northern Ireland Assembly were established in 1998.\nThe UK has been an active member of the EU since its accession in 1973, although it chose to remain outside the Economic and Monetary Union. However, motivated in part by frustration at a remote bureaucracy in Brussels and massive migration into the country, UK citizens on 23 June 2016 narrowly voted to leave the EU. The UK is scheduled to depart the EU on 31 January 2020, but negotiations on the future EU-UK economic and security relationship will continue throughout 2020 and potentially beyond.",
    "coordinates": "54 00 N, 2 00 W",
    "region": "Europe",
    "total_area": "243,610 sq km",
    "land_area": "241,930 sq km",
    "water_area": "1,680 sq km",
    "land_boundary": "499 km",
    "neighbors": {},
    "climate": "temperate; moderated by prevailing southwest winds over the North Atlantic Current; more than one-half of the days are overcast",
    "coastline": "12,429 km",
    "natural_hazards": [
        "winter windstorms",
        "floods"
    ],
    "terrain": "mostly rugged hills and low mountains; level to rolling plains in east and southeast",
    "population_distribution": "the core of the population lies in and around London, with significant clusters found in central Britain around Manchester and Liverpool, in the Scotish lowlands between Endinburgh and Glasgow, southern Wales in and around Cardiff, and far eastern Northern Ireland centered on Belfast",
    "natural_resources": [
        "coal",
        "petroleum",
        "natural gas",
        "iron ore",
        "lead",
        "zinc",
        "gold",
        "tin",
        "limestone",
        "salt",
        "clay",
        "chalk",
        "gypsum",
        "potash",
        "silica sand",
        "slate",
        "arable land"
    ],
    "population": "65,761,117",
    "nationality": "Briton(s), British (collective plural)",
    "ethnic_groups": {
        "white": "87.2%",
        "black/African/Caribbean/black British": "3%",
        "Asian/Asian British: Indian": "2.3%",
        "Asian/Asian British: Pakistani": "1.9%",
        "mixed": "2%",
        "other": "3.7%"
    },
    "languages": [
        "English"
    ],
    "religions": {
        "Christian": "59.5%",
        "Muslim": "4.4%",
        "Hindu": "1.3%",
        "other": "2%",
        "unspecified": "7.2%",
        "none": "25.7%"
    },
    "government_type": "parliamentary constitutional monarchy; a Commonwealth realm",
    "national_symbols": "lion (Britain in general); lion, Tudor rose, oak (England); lion, unicorn, thistle (Scotland); dragon, daffodil, leek (Wales); shamrock, flax (Northern Ireland)",
    "national_colors": [
        "red",
        "white",
        "blue (Britain in general); red",
        "white (England); blue",
        "white (Scotland); red",
        "white",
        "green (Wales)"
    ],
    "gdp": "$2,628 billion",
    "agriculture": [
        "cereals",
        "oilseed",
        "potatoes",
        "vegetables",
        "cattle",
        "sheep",
        "poultry",
        "fish",
        "milk",
        "eggs"
    ],
    "industries": [
        "machine tools",
        "electric power equipment",
        "automation equipment",
        "railroad equipment",
        "shipbuilding",
        "aircraft",
        "motor vehicles and parts",
        "electronics and communications equipment",
        "metals",
        "chemicals",
        "coal",
        "petroleum",
        "paper and paper products",
        "food processing",
        "textiles",
        "clothing",
        "other consumer goods"
    ],
    "exports": [
        "manufactured goods",
        "fuels",
        "chemicals",
        "food",
        "beverages",
        "tobacco"
    ],
    "imports": [
        "manufactured goods",
        "machinery",
        "fuels",
        "foodstuffs"
    ],
    "broadband_subscriptions": "26,586,110",
    "internet_users": "61,784,878",
    "mobile_subscriptions": "79,472,341",
    "internet_country_code": ".uk",
    "military_and_security_forces": "British Army, Royal Navy (includes Royal Marines), Royal Air Force",
    "percent_GDP_on_military": "2.14%",
    "pipelines": [
        "502 km condensate",
        "9 km condensate/gas",
        "28603 km gas",
        "59 km liquid petroleum gas",
        "5256 km oil",
        "175 km oil/gas/water",
        "4919 km refined products",
        "255 km water"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Dover, Felixstowe, Immingham, Liverpool, London, Southampton, Teesport (England); Forth Ports (Scotland); Milford Haven (Wales)",
        "oil terminal(s)": "Fawley Marine terminal, Liverpool Bay terminal (England); Braefoot Bay terminal, Finnart oil terminal, Hound Point terminal (Scotland)",
        "container port(s) (TEUs)": "Felixstowe (3,849,700), London (2,431,000), Southampton (2,040,000)",
        "LNG terminal(s) (import)": "Isle of Grain, Milford Haven, Teesside"
    },
    "waterways": "3,200 km",
    "number_of_airports": "460",
    "international_disputes": "in 2002, Gibraltar residents voted overwhelmingly by referendum to reject any \"shared sovereignty\" arrangement between the UK and Spain; the Government of Gibraltar insisted on equal participation in talks between the two countries; Spain disapproved of UK plans to grant Gibraltar greater autonomy; Mauritius and Seychelles claim the Chagos Archipelago (British Indian Ocean Territory); in 2001, the former inhabitants of the archipelago, evicted 1967 - 1973, were granted UK citizenship and the right of return, followed by Orders in Council in 2004 that banned rehabitation, a High Court ruling reversed the ban, a Court of Appeal refusal to hear the case, and a Law Lords' decision in 2008 denied the right of return; in addition, the UK created the world's largest marine protection area around the Chagos islands prohibiting the extraction of any natural resources therein; UK rejects sovereignty talks requested by Argentina, which still claims the Falkland Islands (Islas Malvinas) and South Georgia and the South Sandwich Islands; territorial claim in Antarctica (British Antarctic Territory) overlaps Argentine claim and partially overlaps Chilean claim; Iceland, the UK, and Ireland dispute Denmark's claim that the Faroe Islands' continental shelf extends beyond 200 nm",
    "terrorism": "None/Unknown"
}