{
    "id": "location--140",
    "name": "Mozambique",
    "background": "In the first half of the second millennium A.D., northern Mozambican port towns were frequented by traders from Somalia, Ethiopia, Egypt, Arabia, Persia, and India. The Portuguese were able to wrest much of the coastal trade from Arab Muslims in the centuries after 1500 and to set up their own colonies. Portugal did not relinquish Mozambique until 1975. Large-scale emigration, economic dependence on South Africa, a severe drought, and a prolonged civil war hindered the country's development until the mid-1990s. The ruling Front for the Liberation of Mozambique (FRELIMO) party formally abandoned Marxism in 1989, and a new constitution the following year provided for multiparty elections and a free market economy. A UN-negotiated peace agreement between FRELIMO and rebel Mozambique National Resistance (RENAMO) forces ended the fighting in 1992. In 2004, Mozambique underwent a delicate transition as Joaquim CHISSANO stepped down after 18 years in office. His elected successor, Armando GUEBUZA, served two terms and then passed executive power to Filipe NYUSI in 2015. RENAMO's residual armed forces intermittently engaged in a low-level insurgency after 2012, but a late December 2016 ceasefire eventually led to the two sides signing a comprehensive peace deal in August 2019. Elections in October 2019, challenged by Western observers and civil society as being problematic, resulted in resounding wins for NYUSI and FRELIMO across the country. Since October 2017, violent extremists - who an official ISIS media outlet recognized as ISIS's network in Mozambique for the first time in June 2019 - have been conducting attacks against civilians and security services in the northern province of Cabo Delgado.",
    "coordinates": "18 15 S, 35 00 E",
    "region": "Africa",
    "total_area": "799,380 sq km",
    "land_area": "786,380 sq km",
    "water_area": "13,000 sq km",
    "land_boundary": "4,783 km",
    "neighbors": {
        "South Africa": "496 km",
        "Eswatini": "108 km",
        "Tanzania": "840 km",
        "Zambia": "439 km",
        "Zimbabwe": "1402 km"
    },
    "climate": "tropical to subtropical",
    "coastline": "2,470 km",
    "natural_hazards": [
        "severe droughts",
        "devastating cyclones and floods in central and southern provinces"
    ],
    "terrain": "mostly coastal lowlands, uplands in center, high plateaus in northwest, mountains in west",
    "population_distribution": "three large populations clusters are found along the southern coast between Maputo and Inhambane, in the central area between Beira and Chimoio along the Zambezi River, and in and around the northern cities of Nampula, Cidade de Nacala, and Pemba; the northwest and southwest are the least populated areas as shown in this population distribution map",
    "natural_resources": [
        "coal",
        "titanium",
        "natural gas",
        "hydropower",
        "tantalum",
        "graphite"
    ],
    "population": "30,098,197",
    "nationality": "Mozambican(s)",
    "ethnic_groups": {
        "African": "99%",
        "mestizo": "0.8%",
        "other": ".2%"
    },
    "languages": {
        "Makhuwa": "26.1%",
        "Portuguese (official)": "16.6%",
        "Tsonga": "8.6%",
        "Nyanja 8.1": "",
        "Sena": "7.1%",
        "Lomwe": "7.1%",
        "Chuwabo": "4.7%",
        "Ndau": "3.8%",
        "Tswa": "3.8%",
        "other Mozambican languages": "11.8%",
        "other": "0.5%",
        "unspecified": "1.8%"
    },
    "religions": {
        "Roman Catholic": "27.2%",
        "Muslim": "18.9%",
        "Zionist Christian": "15.6%",
        "Evangelical/Pentecostal": "15.3%",
        "Anglican": "1.7%",
        "other": "4.8%",
        "none": "13.9%",
        "unspecified": "2.5%"
    },
    "government_type": "presidential republic",
    "national_symbol": "",
    "national_colors": [
        "reen",
        "black",
        "yellow",
        "white",
        "red"
    ],
    "gdp": "$12.59 billion",
    "agriculture": [
        "cotton",
        "cashew nuts",
        "sugarcane",
        "tea",
        "cassava",
        "corn",
        "coconuts",
        "sisal",
        "citrus and tropical fruits",
        "potatoes",
        "sunflowers",
        "beef",
        "poultry"
    ],
    "industries": [
        "aluminum",
        "petroleum products",
        "chemicals (fertilizer, soap, paints)",
        "textiles",
        "cement",
        "glass",
        "asbestos",
        "tobacco",
        "food",
        "beverages"
    ],
    "exports": [
        "aluminum",
        "prawns",
        "cashews",
        "cotton",
        "sugar",
        "citrus",
        "timber",
        "bulk electricity"
    ],
    "imports": [
        "machinery and equipment",
        "vehicles",
        "fuel",
        "chemicals",
        "metal products",
        "foodstuffs",
        "textiles"
    ],
    "broadband_subscriptions": "70,142",
    "internet_users": "2,855,670",
    "mobile_subscriptions": "14,074,248",
    "internet_country_code": ".mz",
    "military_and_security_forces": "Armed Defense Forces of Mozambique (Forcas Armadas de Defesa de Mocambique, FADM): Mozambique Army, Mozambique Navy (Marinha de Guerra de Mocambique, MGM), Mozambique Air Force (Forca Aerea de Mocambique, FAM)Ministry of Interior: National Police (PRM), the National Criminal Investigation Service (SERNIC), Rapid Intervention Unit (UIR; police special forces), Border Security Force",
    "percent_GDP_on_military": "0.99%",
    "pipelines": [
        "972 km gas",
        "278 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Beira, Maputo, Nacala"
    },
    "waterways": "460 km",
    "number_of_airports": "98",
    "international_disputes": "South Africa has placed military units to assist police operations along the border of Lesotho, Zimbabwe, and Mozambique to control smuggling, poaching, and illegal migration",
    "terrorism": "None/Unknown"
}