{
    "id": "location--143",
    "name": "Nepal",
    "background": "During the late 18th-early 19th centuries, the principality of Gorkha united many of the other principalities and states of the sub-Himalayan region into a Nepali Kingdom. Nepal retained its independence following the Anglo-Nepalese War of 1814-16 and the subsequent peace treaty laid the foundations for two centuries of amicable relations between Britain and Nepal. (The Brigade of Gurkhas continues to serve in the British Army to the present day.) In 1951, the Nepali monarch ended the century-old system of rule by hereditary premiers and instituted a cabinet system that brought political parties into the government. That arrangement lasted until 1960, when political parties were again banned, but was reinstated in 1990 with the establishment of a multiparty democracy within the framework of a constitutional monarchy.\nAn insurgency led by Maoists broke out in 1996. During the ensuing 10-year civil war between Maoist and government forces, the monarchy dissolved the cabinet and parliament and re-assumed absolute power in 2002, after the crown prince massacred the royal family in 2001. A peace accord in 2006 led to the promulgation of an interim constitution in 2007. Following a nationwide Constituent Assembly (CA) election in 2008, the newly formed CA declared Nepal a federal democratic republic, abolished the monarchy, and elected the country's first president. After the CA failed to draft a constitution by a 2012 deadline set by the Supreme Court, then-Prime Minister Baburam BHATTARAI dissolved the CA. Months of negotiations ensued until 2013 when the major political parties agreed to create an interim government headed by then-Chief Justice Khil Raj REGMI with a mandate to hold elections for a new CA. Elections were held in 2013, in which the Nepali Congress (NC) won the largest share of seats in the CA and in 2014 formed a coalition government with the second-place Communist Party of Nepal-Unified Marxist-Leninist (UML) with NC President Sushil KOIRALA serving as prime minister. Nepal's new constitution came into effect in 2015, at which point the CA became the Parliament. Khagda Prasad Sharma OLI served as the first post-constitution prime minister from 2015 to 2016. OLI resigned ahead of a no-confidence motion against him, and Parliament elected Communist Party of Nepal-Maoist (CPN-M) leader Pushpa Kamal DAHAL (aka \"Prachanda\") prime minister. The constitution provided for a transitional period during which three sets of elections – local, provincial, and national – needed to take place. The first local elections in 20 years occurred in three phases between May and September 2017, and state and federal elections proceeded in two phases in November and December 2017. The parties headed by OLI and DAHAL ran in coalition and swept the parliamentary elections, and OLI, who led the larger of the two parties, was sworn in as prime minister in February 2018. In May 2018, OLI and DAHAL announced the merger of their parties - the UML and CPN-M - to establish the Nepal Communist Party (NCP), which is now the ruling party in Parliament.",
    "coordinates": "28 00 N, 84 00 E",
    "region": "Asia",
    "total_area": "147,181 sq km",
    "land_area": "143,351 sq km",
    "water_area": "3,830 sq km",
    "land_boundary": "3,159 km",
    "neighbors": {
        "India": "1770 km"
    },
    "climate": "varies from cool summers and severe winters in north to subtropical summers and mild winters in south",
    "coastline": "0 km",
    "natural_hazards": [
        "severe thunderstorms",
        "flooding",
        "landslides",
        "drought and famine depending on the timing, intensity, and duration of the summer monsoons"
    ],
    "terrain": "Tarai or flat river plain of the Ganges in south; central hill region with rugged Himalayas in north",
    "population_distribution": "most of the population is divided nearly equally between a concentration in the southern-most plains of the Tarai region and the central hilly region; overall density is quite low",
    "natural_resources": [
        "quartz",
        "water",
        "timber",
        "hydropower",
        "scenic beauty",
        "small deposits of lignite",
        "copper",
        "cobalt",
        "iron ore"
    ],
    "population": "30,327,877",
    "nationality": "Nepali (singular and plural)",
    "ethnic_groups": {
        "Chhettri": "16.6%",
        "Brahman-Hill": "12.2%",
        "Magar": "7.1%",
        "Tharu": "6.6%",
        "Tamang": "5.8%",
        "Newar": "5%",
        "Kami": "4.8%",
        "Muslim": "4.4%",
        "Yadav": "4%",
        "Rai": "2.3%",
        "Gurung": "2%",
        "Damai/Dholii": "1.8%",
        "Thakuri": "1.6%",
        "Limbu": "1.5%",
        "Sarki": "1.4%",
        "Teli": "1.4%",
        "Chamar/Harijan/Ram": "1.3%",
        "Koiri/Kushwaha": "1.2%",
        "other": "19%"
    },
    "languages": {
        "Nepali (official)": "44.6%",
        "Maithali": "11.7%",
        "Bhojpuri": "6%",
        "Tharu": "5.8%",
        "Tamang": "5.1%",
        "Newar": "3.2%",
        "Bajjika": "3%",
        "Magar": "3%",
        "Doteli": "3%",
        "Urdu": "2.6%",
        "Avadhi": "1.9%",
        "Limbu": "1.3%",
        "Gurung": "1.2%",
        "Baitadeli": "1%",
        "other": "6.4%",
        "unspecified": "0.2%"
    },
    "religions": {
        "Hindu": "81.3%",
        "Buddhist": "9%",
        "Muslim": "4.4%",
        "Kirant": "3.1%",
        "Christian": "1.4%",
        "other": "0.5%",
        "unspecified": "0.2%"
    },
    "government_type": "federal parliamentary republic",
    "national_symbol": "rhododendron blossom; national color: red",
    "national_colors": [
        "blue",
        "yellow",
        "white"
    ],
    "gdp": "$24.88 billion",
    "agriculture": [
        "pulses",
        "rice",
        "corn",
        "wheat",
        "sugarcane",
        "jute",
        "root crops",
        "milk",
        "water buffalo meat"
    ],
    "industries": [
        "tourism",
        "carpets",
        "textiles",
        "small rice",
        "jute",
        "sugar",
        "oilseed mills",
        "cigarettes",
        "cement and brick production"
    ],
    "exports": [
        "clothing",
        "pulses",
        "carpets",
        "textiles",
        "juice",
        "jute goods"
    ],
    "imports": [
        "petroleum products",
        "machinery and equipment",
        "gold",
        "electrical goods",
        "medicine"
    ],
    "broadband_subscriptions": "791,961",
    "internet_users": "10,103,980",
    "mobile_subscriptions": "39,178,451",
    "internet_country_code": ".np",
    "military_and_security_forces": "Nepal Army (includes Air Wing); Nepal Armed Police Force (under the Ministry of Home Affairs; paramilitary force responsible for border and internal security, including counter-insurgency, and assisting the Army in the event of an external invasion)",
    "percent_GDP_on_military": "1.6%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "47",
    "international_disputes": "joint border commission continues to work on contested sections of boundary with India, including the 400 sq km dispute over the source of the Kalapani River; India has instituted a stricter border regime to restrict transit of illegal cross-border activities",
    "terrorism": "None/Unknown"
}