{
    "id": "location--192",
    "name": "Syria",
    "background": "Following World War I, France acquired a mandate over the northern portion of the former Ottoman Empire province of Syria. The French administered the area as Syria until granting it independence in 1946. The new country lacked political stability and experienced a series of military coups. Syria united with Egypt in February 1958 to form the United Arab Republic. In September 1961, the two entities separated, and the Syrian Arab Republic was reestablished. In the 1967 Arab-Israeli War, Syria lost the Golan Heights region to Israel. During the 1990s, Syria and Israel held occasional, albeit unsuccessful, peace talks over its return. In November 1970, Hafiz al-ASAD, a member of the socialist Ba'ath Party and the minority Alawi sect, seized power in a bloodless coup and brought political stability to the country. Following the death of President Hafiz al-ASAD, his son, Bashar al-ASAD, was approved as president by popular referendum in July 2000. Syrian troops - stationed in Lebanon since 1976 in an ostensible peacekeeping role - were withdrawn in April 2005. During the July-August 2006 conflict between Israel and Hizballah, Syria placed its military forces on alert but did not intervene directly on behalf of its ally Hizballah. In May 2007, Bashar al-ASAD's second term as president was approved by popular referendum.\nInfluenced by major uprisings that began elsewhere in the region, and compounded by additional social and economic factors, antigovernment protests broke out first in the southern province of Dar'a in March 2011 with protesters calling for the repeal of the restrictive Emergency Law allowing arrests without charge, the legalization of political parties, and the removal of corrupt local officials. Demonstrations and violent unrest spread across Syria with the size and intensity of protests fluctuating. The government responded to unrest with a mix of concessions - including the repeal of the Emergency Law, new laws permitting new political parties, and liberalizing local and national elections - and with military force and detentions. The government's efforts to quell unrest and armed opposition activity led to extended clashes and eventually civil war between government forces, their allies, and oppositionists.\nInternational pressure on the ASAD regime intensified after late 2011, as the Arab League, the EU, Turkey, and the US expanded economic sanctions against the regime and those entities that support it. In December 2012, the Syrian National Coalition, was recognized by more than 130 countries as the sole legitimate representative of the Syrian people. In September 2015, Russia launched a military intervention on behalf of the ASAD regime, and domestic and foreign government-aligned forces recaptured swaths of territory from opposition forces, and eventually the country's second largest city, Aleppo, in December 2016, shifting the conflict in the regime's favor. The regime, with this foreign support, also recaptured opposition strongholds in the Damascus suburbs and the southern province of Dar'a in 2018. The government lacks territorial control over much of the northeastern part of the country, which is dominated by the predominantly Kurdish Syrian Democratic Forces (SDF). The SDF has expanded its territorial hold over much of the northeast since 2014 as it has captured territory from the Islamic State of Iraq and Syria. Since 2016, Turkey has also conducted three large-scale military operations into Syria, capturing territory along Syria's northern border in the provinces of Aleppo, Ar Raqqah, and Al Hasakah. Political negotiations between the government and opposition delegations at UN-sponsored Geneva conferences since 2014 have failed to produce a resolution of the conflict. Since early 2017, Iran, Russia, and Turkey have held separate political negotiations outside of UN auspices to attempt to reduce violence in Syria. According to an April 2016 UN estimate, the death toll among Syrian Government forces, opposition forces, and civilians was over 400,000, though other estimates placed the number well over 500,000. As of December 2019, approximately 6 million Syrians were internally displaced. Approximately 11.1 million people were in need of humanitarian assistance across the country, and an additional 5.7 million Syrians were registered refugees in Turkey, Jordan, Iraq, Egypt, and North Africa. The conflict in Syria remains one of the largest humanitarian crises worldwide.",
    "coordinates": "35 00 N, 38 00 E",
    "region": "Middle East",
    "total_area": "187,437 sq km",
    "land_area": "185,887 sq km",
    "water_area": "1,550 sq km",
    "land_boundary": "2,343 km",
    "neighbors": {
        "Israel": "79 km",
        "Jordan": "362 km",
        "Lebanon": "394 km",
        "Turkey": "909 km"
    },
    "climate": "mostly desert; hot, dry, sunny summers (June to August) and mild, rainy winters (December to February) along coast; cold weather with snow or sleet periodically in Damascus",
    "coastline": "193 km",
    "natural_hazards": [
        "dust storms, sandstorms",
        "volcanism: Syria's two historically active volcanoes, Es Safa and an unnamed volcano near the Turkish border have not erupted in centuries"
    ],
    "terrain": "primarily semiarid and desert plateau; narrow coastal plain; mountains in west",
    "population_distribution": "significant population density along the Mediterranean coast; larger concentrations found in the major cities of Damascus, Aleppo (the country's largest city), and Hims (Homs); more than half of the population lives in the coastal plain, the province of Halab, and the Euphrates River valley",
    "natural_resources": [
        "petroleum",
        "phosphates",
        "chrome and manganese ores",
        "asphalt",
        "iron ore",
        "rock salt",
        "marble",
        "gypsum",
        "hydropower"
    ],
    "population": "19,398,448",
    "nationality": "Syrian(s)",
    "ethnic_groups": {
        "Arab": "~50%",
        "Alawite": "~15%",
        "Kurd": "~10%",
        "Levantine": "~10%",
        "other": "~15%"
    },
    "languages": [
        "Arabic (official)",
        "Kurdish",
        "Armenian",
        "Aramaic",
        "Circassian",
        "French",
        "English"
    ],
    "religions": {
        "Muslim": "87%",
        "Christian": "10%",
        "Druze": "3%",
        "Jewish": ""
    },
    "government_type": "presidential republic; highly authoritarian regime",
    "national_symbol": "hawk",
    "national_colors": [
        "red",
        "white",
        "black",
        "green"
    ],
    "gdp": "$24.6 billion",
    "agriculture": [
        "wheat",
        "barley",
        "cotton",
        "lentils",
        "chickpeas",
        "olives",
        "sugar beets",
        "beef",
        "mutton",
        "eggs",
        "poultry",
        "milk"
    ],
    "industries": [
        "petroleum",
        "textiles",
        "food processing",
        "beverages",
        "tobacco",
        "phosphate rock mining",
        "cement",
        "oil seeds crushing",
        "automobile assembly"
    ],
    "exports": [
        "crude oil",
        "minerals",
        "petroleum products",
        "fruits and vegetables",
        "cotton fiber",
        "textiles",
        "clothing",
        "meat and live animals",
        "wheat"
    ],
    "imports": [
        "machinery and transport equipment",
        "electric power machinery",
        "food and livestock",
        "metal and metal products",
        "chemicals and chemical products",
        "plastics",
        "yarn",
        "paper"
    ],
    "broadband_subscriptions": "1,328,688",
    "internet_users": "6,077,510",
    "mobile_subscriptions": "17,129,676",
    "internet_country_code": ".sy",
    "military_and_security_forces": "Syrian Armed Forces: Syrian Arab Army, Syrian Naval Forces, Syrian Air Forces, Syrian Air Defense Forces, National Defense Forces (pro-government militia and auxiliary forces)",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "3170 km gas",
        "2029 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Baniyas, Latakia, Tartus"
    },
    "waterways": "900 km",
    "number_of_airports": "90",
    "international_disputes": "Golan Heights is Israeli-controlled with an almost 1,000-strong UN Disengagement Observer Force patrolling a buffer zone since 1964; lacking a treaty or other documentation describing the boundary, portions of the Lebanon-Syria boundary are unclear with several sections in dispute; since 2000, Lebanon has claimed Shab'a Farms in the Golan Heights; 2004 Agreement and pending demarcation would settle border dispute with Jordan",
    "terrorism": {
        "al-Nusrah Front": "overthrow Syrian President Bashar al-ASAD's regime, absorb like-minded Syrian rebel groups, and ultimately, establish a regional Islamic caliphatearea(s) of operation",
        "Hay'at Tahrir al-Sham (HTS)": "an alias of the al-Nusrah Front; overthrow Syrian President Bashar al-ASAD's regime, absorb like-minded Syrian rebel groups, and, ultimately, establish a regional Islamic caliphatearea(s) of operation",
        "Islamic State of Iraq and ash-Sham (ISIS)": "replace the world order with a global Islamic state based in Iraq and Syria; expand its branches and networks in other countries; rule according to ISIS's strict interpretation of Islamic lawarea(s) of operation",
        "Abdallah Azzam Brigades (AAB)": "disrupt and attack Shia Muslim and Western interests in Syriaarea(s) of operation",
        "al-Qa'ida (AQ)": "overthrow President Bashar al-ASAD's regime; establish a regional Islamic caliphate and conduct attacks outside of Syriaarea(s) of operation",
        "Ansar al-Islam (AAI)": "remove Syrian President Bashar al-ASAD from power and establish a government operating according to shariaarea(s) of operation",
        "Hizballah": "preserve Syrian President Bashar al-ASAD's regimearea(s) of operation",
        "Islamic Revolutionary Guard Corps -- Qods Force (IRGC-QF)": "assist government forces in suppressing opposition forces and Islamic State of Iraq and ash-Sham (ISIS) forces; train Syrian Government troops; conduct strikes against Israel; funnel arms and money onward to Lebanese Hizballaharea(s) of operations",
        "Kata'ib Hizballah (KH)": "preserve Syrian President Bashar al-ASAD's regimearea(s) of operation",
        "Kurdistan Workers' Party (PKK)": "advance Kurdish autonomy, political, and cultural rights in Syria, Turkey, Iraq, and Iranarea(s) of operation",
        "Mujahidin Shura Council in the Environs of Jerusalem (MSC)": "destroy the state of Israel; enhance its networks in Syriaarea(s) of operation",
        "Palestine Liberation Front (PLF)": "enhances its networks and, ultimately, destroy the state of Israel and establish a secular, Marxist Palestinian state with Jerusalem as its capitalarea(s) of operation",
        "PFLP-General Command (PFLP-GC)": "preserve Syrian President Bashar al-ASAD's regimearea(s) of operation",
        "Popular Front for the Liberation of Palestine (PFLP)": "enhance its recruitment networks in Syriaarea(s) of operation"
    }
}