{
    "id": "location--124",
    "name": "Malawi",
    "background": "From the late 15th to the 18th centuries, a prosperous Kingdom of Maravi - from which the name Malawi derives - extended its reach into what are now areas of Zambia and Mozambique. British missionary and trading activity increased in the area around Lake Malawi in the second half of the 19th century. In 1889, a British Central African Protectorate was established, which was renamed Nyasaland in 1907, and which became the independent nation of Malawi in 1964. After three decades of one-party rule under President Hastings Kamuzu BANDA, the country held multiparty presidential and parliamentary elections in 1994, under a provisional constitution that came into full effect the following year. Bakili MULUZI became the first freely elected president of Malawi when he won the presidency in 1994; he won re-election in 1999. President Bingu wa MUTHARIKA, elected in 2004 after a failed attempt by the previous president to amend the constitution to permit another term, struggled to assert his authority against his predecessor and subsequently started his own party, the Democratic Progressive Party in 2005. MUTHARIKA was reelected to a second term in 2009. He oversaw some economic improvement in his first term, but was accused of economic mismanagement and poor governance in his second term. He died abruptly in 2012 and was succeeded by vice president, Joyce BANDA, who had earlier started her own party, the People's Party. MUTHARIKA's brother, Peter MUTHARIKA, defeated BANDA in the 2014 election. Peter MUTHARIKA was reelected in a disputed 2019 election that resulted in countrywide protests. Population growth, increasing pressure on agricultural lands, corruption, and the scourge of HIV/AIDS pose major problems for Malawi.",
    "coordinates": "13 30 S, 34 00 E",
    "region": "Africa",
    "total_area": "118,484 sq km",
    "land_area": "94,080 sq km",
    "water_area": "24,404 sq km",
    "land_boundary": "2,857 km",
    "neighbors": {
        "Tanzania": "512 km",
        "Zambia": "847 km"
    },
    "climate": "sub-tropical; rainy season (November to May); dry season (May to November)",
    "coastline": "0 km",
    "natural_hazards": [
        "flooding",
        "droughts",
        "earthquakes"
    ],
    "terrain": "narrow elongated plateau with rolling plains, rounded hills, some mountains",
    "population_distribution": "population density is highest south of Lake Nyasa as shown in this population distribution map",
    "natural_resources": [
        "limestone",
        "arable land",
        "hydropower",
        "unexploited deposits of uranium",
        "coal",
        "and bauxite"
    ],
    "population": "21,196,629",
    "nationality": "Malawian(s)",
    "ethnic_groups": {
        "Chewa": "34.3%",
        "Lomwe": "18.8%",
        "Yao": "13.2%",
        "Ngoni": "10.4%",
        "Tumbuka": "9.2%",
        "Sena": "3.8%",
        "Mang'anja": "3.2%",
        "Tonga": "1.8%",
        "Nyanja": "1.8%",
        "Nkhonde": "1%",
        "other": "2.2%",
        "foreign": ".3%"
    },
    "languages": [
        "English (official)",
        "Chewa",
        "Lambya",
        "Lomwe",
        "Ngoni",
        "Nkhonde",
        "Nyakyusa",
        "Nyanja",
        "Sena",
        "Tonga",
        "Tumbuka",
        "Yao"
    ],
    "religions": {
        "Protestant": "33.5%",
        "Roman Catholic": "17.2%",
        "other Christian": "26.6%",
        "Muslim": "13.8%",
        "traditionalist": "1.1%",
        "other": "5.6%",
        "none": "2.1%"
    },
    "government_type": "presidential republic",
    "national_symbol": "lion",
    "national_colors": [
        "black",
        "red",
        "green"
    ],
    "gdp": "$6.24 billion",
    "agriculture": [
        "tobacco",
        "sugarcane",
        "tea",
        "corn",
        "potatoes",
        "sweet potatoes",
        "cassava",
        "sorghum",
        "pulses",
        "cotton",
        "groundnuts",
        "macadamia nuts",
        "coffee",
        "cattle",
        "goats"
    ],
    "industries": [
        "tobacco",
        "tea",
        "sugar",
        "sawmill products",
        "cement",
        "consumer goods"
    ],
    "exports": [
        "tobacco",
        "dried legumes",
        "sugar",
        "tea",
        "cotton",
        "peanuts",
        "coffee",
        "soy"
    ],
    "imports": [
        "food",
        "petroleum products",
        "semi-manufactures",
        "consumer goods",
        "transportation equipment"
    ],
    "broadband_subscriptions": "11,358",
    "internet_users": "2,734,305",
    "mobile_subscriptions": "7,076,906",
    "internet_country_code": ".mw",
    "military_and_security_forces": "Malawi Defense Force (MDF): Army (includes Air Wing, Marine Unit); note - a 2017 amendment to Malawi’s Defense Force Act established a separate Army, Air Force, and Maritime Force within the MDF, but these services have yet to develop independent budgets, chains of command, and training institutions",
    "percent_GDP_on_military": "0.9%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "lake port(s)": "Chipoka, Monkey Bay, Nkhata Bay, Nkhotakota, Chilumba (Lake Nyasa)"
    },
    "waterways": "700 km",
    "number_of_airports": "32",
    "international_disputes": "dispute with Tanzania over the boundary in Lake Nyasa (Lake Malawi) and the meandering Songwe River; Malawi contends that the entire lake up to the Tanzanian shoreline is its territory, while Tanzania claims the border is in the center of the lake; the conflict was reignited in 2012 when Malawi awarded a license to a British company for oil exploration in the lake",
    "terrorism": "None/Unknown"
}