{
    "id": "location--166",
    "name": "Rwanda",
    "background": "A Rwandan kingdom dominated the region from the mid-18th century onward, with the Tutsi rulers conquering others militarily, centralizing power, and increasingly enacting anti-Hutu policies. German colonial rule began in 1898, but Belgian forces captured Rwanda in 1916 during World War I. Both European nations ruled through the kings and pursued a pro-Tutsi policy. In 1959, three years before independence from Belgium, the majority ethnic group, the Hutus, overthrew the ruling Tutsi king. Over the next several years, thousands of Tutsis were killed, and some 150,000 driven into exile in neighboring countries. The children of these exiles later formed a rebel group, the Rwandan Patriotic Front (RPF), and began a civil war in 1990. The war, along with several political and economic upheavals, exacerbated ethnic tensions, culminating in April 1994 in a state-orchestrated genocide, in which Rwandans killed approximately 800,000 of their fellow citizens, including approximately three-quarters of the Tutsi population. The genocide ended later that same year when the predominantly Tutsi RPF, operating out of Uganda and northern Rwanda, defeated the national army and Hutu militias, and established an RPF-led government of national unity. Rwanda held its first local elections in 1999 and its first post-genocide presidential and legislative elections in 2003. Rwanda joined the Commonwealth in late 2009. President Paul KAGAME won the presidential election in August 2017 after changing the constitution in 2016 to allow him to run for a third term.",
    "coordinates": "2 00 S, 30 00 E",
    "region": "Africa",
    "total_area": "26,338 sq km",
    "land_area": "24,668 sq km",
    "water_area": "1,670 sq km",
    "land_boundary": "930 km",
    "neighbors": {
        "Democratic Republic of the Congo": "221 km",
        "Tanzania": "222 km",
        "Uganda": "172 km"
    },
    "climate": "temperate; two rainy seasons (February to April, November to January); mild in mountains with frost and snow possible",
    "coastline": "0 km",
    "natural_hazards": [
        "periodic droughts",
        "the volcanic Virunga Mountains are in the northwest along the border with Democratic Republic of the Congo",
        "volcanism: Visoke (3,711 m), located on the border with the Democratic Republic of the Congo, is the country's only historically active volcano"
    ],
    "terrain": "mostly grassy uplands and hills; relief is mountainous with altitude declining from west to east",
    "population_distribution": "one of Africa's most densely populated countries; large concentrations tend to be in the central regions and along the shore of Lake Kivu in the west as shown in this population distribution map",
    "natural_resources": [
        "gold",
        "cassiterite (tin ore)",
        "wolframite (tungsten ore)",
        "methane",
        "hydropower",
        "arable land"
    ],
    "population": "12,712,431",
    "nationality": "Rwandan(s)",
    "ethnic_groups": [
        "Hutu",
        "Tutsi",
        "Twa"
    ],
    "languages": {
        "Kinyarwanda (official)": "93.2%",
        "French <.1 (official)": "",
        "English <.1 (official)": "",
        "Swahili/Kiswahili <.1 (official)": "",
        "more than one language": "",
        "other": "6.3%",
        "unspecified": "0.3%"
    },
    "religions": {
        "Protestant": "49.5%",
        "Roman Catholic": "43.7%",
        "Muslim": "2%",
        "other": "0.9%",
        "none": "2.5%",
        "unspecified": "1.3%"
    },
    "government_type": "presidential republic",
    "national_symbol": "traditional woven basket with peaked lid",
    "national_colors": [
        "blue",
        "yellow",
        "green"
    ],
    "gdp": "$9.136 billion",
    "agriculture": [
        "coffee",
        "tea",
        "pyrethrum",
        "bananas",
        "beans",
        "sorghum",
        "potatoes",
        "livestock"
    ],
    "industries": [
        "cement",
        "agricultural products",
        "small-scale beverages",
        "soap",
        "furniture",
        "shoes",
        "plastic goods",
        "textiles",
        "cigarettes"
    ],
    "exports": [
        "coffee",
        "tea",
        "hides",
        "tin ore"
    ],
    "imports": [
        "foodstuffs",
        "machinery and equipment",
        "steel",
        "petroleum products",
        "cement and construction material"
    ],
    "broadband_subscriptions": "7,501",
    "internet_users": "2,653,197",
    "mobile_subscriptions": "9,700,609",
    "internet_country_code": ".rw",
    "military_and_security_forces": "Rwanda Defense Force (RDF): Rwanda Army (Rwanda Land Force), Rwanda Air Force (Force Aerienne Rwandaise, FAR), Rwanda Reserve Force",
    "percent_GDP_on_military": "1.2%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "lake port(s)": "Cyangugu, Gisenyi, Kibuye (Lake Kivu)"
    },
    "waterways": "Unknown",
    "number_of_airports": "7",
    "international_disputes": "Burundi and Rwanda dispute two sq km (0.8 sq mi) of Sabanerwa, a farmed area in the Rukurazi Valley where the Akanyaru/Kanyaru River shifted its course southward after heavy rains in 1965; fighting among ethnic groups - loosely associated political rebels, armed gangs, and various government forces in Great Lakes region transcending the boundaries of Burundi, Democratic Republic of the Congo (DROC), Rwanda, and Uganda - abated substantially from a decade ago due largely to UN peacekeeping, international mediation, and efforts by local governments to create civil societies; nonetheless, 57,000 Rwandan refugees still reside in 21 African states, including Zambia, Gabon, and 20,000 who fled to Burundi in 2005 and 2006 to escape drought and recriminations from traditional courts investigating the 1994 massacres; the 2005 DROC and Rwanda border verification mechanism to stem rebel actions on both sides of the border remains in place",
    "terrorism": "None/Unknown"
}