{
    "id": "location--159",
    "name": "Philippines",
    "background": "The Philippine Islands became a Spanish colony during the 16th century; they were ceded to the US in 1898 following the Spanish-American War. In 1935 the Philippines became a self-governing commonwealth. Manuel QUEZON was elected president and was tasked with preparing the country for independence after a 10-year transition. In 1942 the islands fell under Japanese occupation during World War II, and US forces and Filipinos fought together during 1944-45 to regain control. On 4 July 1946 the Republic of the Philippines attained its independence. A 21-year rule by Ferdinand MARCOS ended in 1986, when a \"people power\" movement in Manila (\"EDSA 1\") forced him into exile and installed Corazon AQUINO as president. Her presidency was hampered by several coup attempts that prevented a return to full political stability and economic development. Fidel RAMOS was elected president in 1992. His administration was marked by increased stability and by progress on economic reforms. In 1992, the US closed its last military bases on the islands. Joseph ESTRADA was elected president in 1998. He was succeeded by his vice-president, Gloria MACAPAGAL-ARROYO, in January 2001 after ESTRADA's stormy impeachment trial on corruption charges broke down and another \"people power\" movement (\"EDSA 2\") demanded his resignation. MACAPAGAL-ARROYO was elected to a six-year term as president in May 2004. Her presidency was marred by several corruption allegations but the Philippine economy was one of the few to avoid contraction following the 2008 global financial crisis, expanding each year of her administration. Benigno AQUINO III was elected to a six-year term as president in May 2010 and was succeeded by Rodrigo DUTERTE in May 2016.\nThe Philippine Government faces threats from several groups, some of which are on the US Government's Foreign Terrorist Organization list. Manila has waged a decades-long struggle against ethnic Moro insurgencies in the southern Philippines, which led to a peace accord with the Moro National Liberation Front and a separate agreement with a break away faction, the Moro Islamic Liberation Front. The decades-long Maoist-inspired New People's Army insurgency also operates through much of the country. In 2017, Philippine armed forces battled an ISIS-Philippines siege in Marawi City, driving DUTERTE to declare martial law in the region. The Philippines faces increased tension with China over disputed territorial and maritime claims in the South China Sea.",
    "coordinates": "13 00 N, 122 00 E",
    "region": "Southeast Asia",
    "total_area": "300,000 sq km",
    "land_area": "298,170 sq km",
    "water_area": "1,830 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "tropical marine; northeast monsoon (November to April); southwest monsoon (May to October)",
    "coastline": "36,289 km",
    "natural_hazards": [
        "astride typhoon belt, usually affected by 15 and struck by five to six cyclonic storms each year",
        "landslides",
        "active volcanoes",
        "destructive earthquakes",
        "tsunamis",
        "volcanism: significant volcanic activity; Taal (311 m), which has shown recent unrest and may erupt in the near future, has been deemed a Decade Volcano by the International Association of Volcanology and Chemistry of the Earth's Interior, worthy of study due to its explosive history and close proximity to human populations; Mayon (2,462 m), the country's most active volcano, erupted in 2009 forcing over 33,000 to be evacuated; other historically active volcanoes include Biliran, Babuyan Claro, Bulusan, Camiguin, Camiguin de Babuyanes, Didicas, Iraya, Jolo, Kanlaon, Makaturing, Musuan, Parker, Pinatubo, and Ragang; see note 2 under \"Geography - note\""
    ],
    "terrain": "mostly mountains with narrow to extensive coastal lowlands",
    "population_distribution": "population concentrated where good farmlands lie; highest concentrations are northwest and south-central Luzon, the southeastern extension of Luzon, and the islands of the Visayan Sea, particularly Cebu and Negros; Manila is home to one-eighth of the entire national population",
    "natural_resources": [
        "timber",
        "petroleum",
        "nickel",
        "cobalt",
        "silver",
        "gold",
        "salt",
        "copper"
    ],
    "population": "109,180,815",
    "nationality": "Filipino(s)",
    "ethnic_groups": {
        "Tagalog": "24.4%",
        "Bisaya/Binisaya": "11.4%",
        "Cebuano": "9.9%",
        "Ilocano": "8.8%",
        "Hiligaynon/Ilonggo": "8.4%",
        "Bikol/Bicol": "6.8%",
        "Waray": "4%",
        "other local ethnicity": "26.1%",
        "other foreign ethnicity": ".1%"
    },
    "languages": [
        "unspecified  Filipino and English; eight major dialects - Tagalog (official)",
        "Cebuano",
        "Ilocano",
        "Hiligaynon or Ilonggo",
        "Bicol",
        "Waray",
        "Pampango",
        "and Pangasinan"
    ],
    "religions": {
        "Roman Catholic": "80.6%",
        "Protestant": "8.2%",
        "other Christian": "3.4%",
        "Muslim": "5.6%",
        "tribal religions": ".2%",
        "other": "1.9%",
        "none": ".1%"
    },
    "government_type": "presidential republic",
    "national_symbol": "three stars and sun, Philippine eagle",
    "national_colors": [
        "red",
        "white",
        "blue",
        "yellow"
    ],
    "gdp": "$313.6 billion",
    "agriculture": [
        "rice",
        "fish",
        "livestock",
        "poultry",
        "bananas",
        "coconut/copra",
        "corn",
        "sugarcane",
        "mangoes",
        "pineapple",
        "cassava"
    ],
    "industries": [
        "semiconductors and electronics assembly",
        "business process outsourcing",
        "food and beverage manufacturing",
        "construction",
        "electric/gas/water supply",
        "chemical products",
        "radio/television/communications equipment and apparatus",
        "petroleum and fuel",
        "textile and garments",
        "non-metallic minerals",
        "basic metal industries",
        "transport equipment"
    ],
    "exports": [
        "semiconductors and electronic products",
        "machinery and transport equipment",
        "wood manufactures",
        "chemicals",
        "processed food and beverages",
        "garments",
        "coconut oil",
        "copper concentrates",
        "seafood",
        "bananas/fruits"
    ],
    "imports": [
        "electronic products",
        "mineral fuels",
        "machinery and transport equipment",
        "iron and steel",
        "textile fabrics",
        "grains",
        "chemicals",
        "plastic"
    ],
    "broadband_subscriptions": "3,919,713",
    "internet_users": "63,588,975",
    "mobile_subscriptions": "134,592,608",
    "internet_country_code": ".ph",
    "military_and_security_forces": "Armed Forces of the Philippines (AFP): Army, Navy (includes Marine Corps), Air Force",
    "percent_GDP_on_military": "1%",
    "pipelines": [
        "530 km gas",
        "138 km oil ",
        "185 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Batangas, Cagayan de Oro, Cebu, Davao, Liman, Manila",
        "container port(s) (TEUs)": "Manila (4,782,240)"
    },
    "waterways": "3,219 km",
    "number_of_airports": "247",
    "international_disputes": "Philippines claims sovereignty over Scarborough Reef (also claimed by China together with Taiwan) and over certain of the Spratly Islands, known locally as the Kalayaan (Freedom) Islands, also claimed by China, Malaysia, Taiwan, and Vietnam; the 2002 \"Declaration on the Conduct of Parties in the South China Sea,\" has eased tensions in the Spratly Islands but falls short of a legally binding \"code of conduct\" desired by several of the disputants; in March 2005, the national oil companies of China, the Philippines, and Vietnam signed a joint accord to conduct marine seismic activities in the Spratly Islands; Philippines retains a dormant claim to Malaysia's Sabah State in northern Borneo based on the Sultanate of Sulu's granting the Philippines Government power of attorney to pursue a sovereignty claim on his behalf; maritime delimitation negotiations continue with Palau",
    "terrorism": {
        "Abu Sayyaf Group (ASG)": "establish an Islamic State in the Philippines' Mindanao Island and the Sulu Archipelago, and ultimately, an Islamic caliphate across Southeast Asiaarea(s) of operation",
        "Communist Party of the Philippines/New People's Army (CPP/NPA)": "destabilize the Philippines' economy to inspire the populace to revolt against the government and, ultimately, overthrow the Philippine Governmentarea(s) of operation",
        "Islamic State of Iraq and ash-Sham (ISIS) network in Philippines": "replace the Philippine Government with an Islamic state and implement ISIS's strict interpretation of shariaarea(s) of operation",
        "Jemaah Islamiyah (JI)": "enhance its networks in the Philippines and, ultimately, overthrow the Philippine Government and establish a pan-Islamic state across Southeast Asiaarea(s) of operation"
    }
}