{
    "id": "location--13",
    "name": "Azerbaijan",
    "background": "Azerbaijan - a secular nation with a majority-Turkic and majority-Shia Muslim population - was briefly independent (from 1918 to 1920) following the collapse of the Russian Empire; it was subsequently incorporated into the Soviet Union for seven decades. Azerbaijan remains involved in the protracted Nagorno-Karabakh conflict with Armenia. Nagorno-Karabakh was a primarily ethnic Armenian region that Moscow recognized in 1923 as an autonomous oblast within Soviet Azerbaijan. In the late Soviet period, a separatist movement developed which sought to end Azerbaijani control over the region. Fighting over Nagorno-Karabakh began in 1988 and escalated after Armenia and Azerbaijan attained independence from the Soviet Union in 1991. By the time a ceasefire took effect in May 1994, separatists, with Armenian support, controlled Nagorno-Karabakh and seven surrounding Azerbaijani territories. The 1994 ceasefire continues to hold, although violence continues along the line of contact separating the opposing forces, as well as the Azerbaijan-Armenia international border. The final status of Nagorno-Karabakh remains the subject of international mediation by the Organization for Security and Cooperation in Europe (OSCE) Minsk Group, which works to help the sides settle the conflict peacefully. The OSCE Minsk Group is co-chaired by the United States, France, and Russia. In the 25 years following its independence, Azerbaijan succeeded in significantly reducing the poverty rate and has directed revenues from its oil and gas production to develop the country's infrastructure. However, corruption remains a problem, and the government has been accused of authoritarianism. The country's leadership has remained in the Aliyev family since Heydar ALIYEV became president in 1993 and was succeeded by his son, President Ilham ALIYEV in 2003. Following two national referendums in the past several years that eliminated presidential term limits and extended presidential terms from 5 to 7 years, President ALIYEV secured a fourth term as president in April 2018 in an election that international observers noted had serious shortcomings. Reforms are underway to diversify the country's non-oil economy and additional reforms are needed to address weaknesses in government institutions, particularly in the education and health sectors, and the court system.",
    "coordinates": "40 30 N, 47 30 E",
    "region": "Asia",
    "total_area": "86,600 sq km",
    "land_area": "82,629 sq km",
    "water_area": "3,971 sq km",
    "land_boundary": "2,468 km",
    "neighbors": {
        "Georgia": "428 km",
        "Iran": "689 km",
        "Russia": "338 km",
        "Turkey": "17 km"
    },
    "climate": "dry, semiarid steppe",
    "coastline": "0 km",
    "natural_hazards": [
        "droughts"
    ],
    "terrain": "large, flat Kur-Araz Ovaligi (Kura-Araks Lowland, much of it below sea level) with Great Caucasus Mountains to the north, Qarabag Yaylasi (Karabakh Upland) to the west; Baku lies on Abseron Yasaqligi (Apsheron Peninsula) that juts into Caspian Sea",
    "population_distribution": "highest population density is found in the far eastern area of the county, in and around Baku; apart from smaller urbanized areas, the rest of the country has a fairly light and evenly distributed population",
    "natural_resources": [
        "petroleum",
        "natural gas",
        "iron ore",
        "nonferrous metals",
        "bauxite"
    ],
    "population": "10,205,810",
    "nationality": "Azerbaijani(s)",
    "ethnic_groups": {
        "Azerbaijani": "91.6%",
        "Lezghin": "2%",
        "Russian": "1.3%",
        "Armenian": "1.3%",
        "Talysh": "1.3%",
        "other": "2.4%"
    },
    "languages": {
        "Azerbaijani (official)": "92.5%",
        "Russian": "1.4%",
        "Armenian": "1.4%",
        "other": "4.7%"
    },
    "religions": {
        "Muslim": "96.9%",
        "Christian": "3%",
        "other": "0.1%",
        "unaffiliated": "0.1%"
    },
    "government_type": "presidential republic",
    "national_symbols": "flames of fire",
    "national_colors": [
        "blue",
        "red",
        "green"
    ],
    "gdp": "$40.67 billion",
    "agriculture": [
        "fruit",
        "vegetables",
        "grain",
        "rice",
        "grapes",
        "tea",
        "cotton",
        "tobacco",
        "cattle",
        "pigs",
        "sheep",
        "goats"
    ],
    "industries": [
        "petroleum and petroleum products",
        "natural gas",
        "oilfield equipment",
        "steel",
        "iron ore",
        "cement",
        "chemicals and petrochemicals",
        "textiles"
    ],
    "exports": [
        "oil and gas",
        "machinery",
        "foodstuffs",
        "cotton"
    ],
    "imports": [
        "machinery and equipment",
        "foodstuffs",
        "metals",
        "chemicals"
    ],
    "broadband_subscriptions": "1,890,913",
    "internet_users": "8,017,120",
    "mobile_subscriptions": "10,339,700",
    "internet_country_code": ".az",
    "military_and_security_forces": "Land Forces, Air Forces, Navy Forces; Ministry of Internal Affairs: State Border Service (includes Coast Guard), Internal Security Troops",
    "percent_GDP_on_military": "4%",
    "pipelines": [
        "89 km condensate",
        "3890 km gas",
        "2446 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Baku (Baki) located on the Caspian Sea"
    },
    "waterways": "Unknown",
    "number_of_airports": "23",
    "international_disputes": "Azerbaijan, Kazakhstan, and Russia ratified the Caspian seabed delimitation treaties based on equidistance, while Iran continues to insist on a one-fifth slice of the sea; the dispute over the break-away Nagorno-Karabakh region and the Armenian military occupation of surrounding lands in Azerbaijan remains the primary focus of regional instability; residents have evacuated the former Soviet-era small ethnic enclaves in Armenia and Azerbaijan; local border forces struggle to control the illegal transit of goods and people across the porous, undemarcated Armenian, Azerbaijani, and Georgian borders; bilateral talks continue with Turkmenistan on dividing the seabed and contested oilfields in the middle of the Caspian",
    "terrorism": "None/Unknown"
}