{
    "id": "location--40",
    "name": "Chad",
    "background": "The Kanem Empire (c.700-1380) and its successor the Bornu Empire (1380s-1893) existed in Chad's southern Sahelian strip and focused on controlling the trans-Saharan trade routes that passed through the region. By 1920, France conquered the territory and incorporated it as part of French Equatorial Africa. Chad attained independence in 1960, but then endured three decades of civil warfare, as well as invasions by Libya, before peace was restored in 1990. The government eventually drafted a democratic constitution and held flawed presidential elections in 1996 and 2001. In 1998, a rebellion broke out in northern Chad, which has sporadically flared up despite several peace agreements between the government and insurgents. In June 2005, President Idriss DEBY held a referendum successfully removing constitutional term limits and won another controversial election in 2006. Sporadic rebel campaigns continued throughout 2006 and 2007. The capital experienced a significant insurrection in early 2008, but has had no significant rebel threats since then, in part due to Chad's 2010 rapprochement with Sudan, which previously used Chadian rebels as proxies. Nevertheless, a state of emergency continues to be in place in the Sila and Ouaddai regions bordering Sudan. In late 2015, the government imposed a state of emergency in the Lake Chad region following multiple attacks by the terrorist group Boko Haram throughout the year; Boko Haram also launched several bombings in N'Djamena in mid-2015. A state of emergency is also emplaced in the western Tibesti region bordering Niger where rival ethnic groups are fighting. DEBY in 2016 was reelected to his fifth term in an election that was peaceful but flawed. A new constitution promulgated in 2018 allows DEBY to run for two additional consecutive terms of six years when his current term comes to an end in 2021. As of 2020, the country continued to face multiple challenges, including widespread poverty, an economy severely weakened by the drop in international oil prices, and insurgencies led by rebel militants in the north and Boko Haram in the Lake Chad Basin. In late 2019, the government was forced to declare a state of emergency in three eastern provinces for four months to stop a cycle of interethnic violence, and the army has suffered heavy losses to Islamic terror groups in the Lake Chad area. In March 2020, Boko Haram fighters attacked a Chadian military camp in the Lake Chad region, killing nearly 100 soldiers; it was the deadliest attack in the history of the Chadian military.\n        (2019)",
    "coordinates": "15 00 N, 19 00 E",
    "region": "Africa",
    "total_area": "1.284 million sq km",
    "land_area": "1,259,200 sq km",
    "water_area": "24,800 sq km",
    "land_boundary": "6,406 km",
    "neighbors": {
        "Central African Republic": "1556 km",
        "Libya": "1050 km",
        "Niger": "1196 km",
        "Nigeria": "85 km",
        "Sudan": "1403 km"
    },
    "climate": "tropical in south, desert in north",
    "coastline": "0 km",
    "natural_hazards": [
        "hot, dry, dusty harmattan winds occur in north",
        "periodic droughts",
        "locust plagues"
    ],
    "terrain": "broad, arid plains in center, desert in north, mountains in northwest, lowlands in south",
    "population_distribution": "the population is unevenly distributed due to contrasts in climate and physical geography; the highest density is found in the southwest, particularly around Lake Chad and points south; the dry Saharan zone to the north is the least densely populated as shown in this population distribution map",
    "natural_resources": [
        "petroleum",
        "uranium",
        "natron",
        "kaolin",
        "fish (Lake Chad)",
        "gold",
        "limestone",
        "sand and gravel",
        "salt"
    ],
    "population": "16,877,357",
    "nationality": "Chadian(s)",
    "ethnic_groups": {
        "Sara": "30.5%",
        "Kanembu/Bornu/Buduma": "9.8%",
        "Arab": "9.7%",
        "Wadai/Maba/Masalit/Mimi": "7%",
        "Gorane": "5.8%",
        "Masa/Musseye/Musgum": "4.9%",
        "Bulala/Medogo/Kuka": "3.7%",
        "Marba/Lele/Mesme": "3.5%",
        "Mundang": "2.7%",
        "Bidiyo/Migaama/Kenga/Dangleat": "2.5%",
        "Dadjo/Kibet/Muro": "2.4%",
        "Tupuri/Kera": "2%",
        "Gabri/Kabalaye/Nanchere/Somrai": "2%",
        "Fulani/Fulbe/Bodore": "1.8%",
        "Karo/Zime/Peve": "1.3%",
        "Baguirmi/Barma": "1.2%",
        "Zaghawa/Bideyat/Kobe": "1.1%",
        "Tama/Assongori/Mararit": "1.1%",
        "Mesmedje/Massalat/Kadjakse": "0.8%",
        "other Chadian ethnicities": "3.4%",
        "Chadians of foreign ethnicities": "0.9%",
        "foreign nationals": "0.3%",
        "unspecified": "1.7%"
    },
    "languages": [
        "French (official)",
        "Arabic (official)",
        "Sara",
        "more than 120 different languages and dialects"
    ],
    "religions": {
        "Muslim": "52.1%",
        "Protestant": "23.9%",
        "Roman Catholic": "20%",
        "animist": "0.3%",
        "other Christian": "0.2%",
        "none": "2.8%",
        "unspecified": "0.7%"
    },
    "government_type": "presidential republic",
    "national_symbols": "goat (north), lion (south)",
    "national_colors": [
        "blue",
        "yellow",
        "red"
    ],
    "gdp": "$9.872 billion",
    "agriculture": [
        "cotton",
        "sorghum",
        "millet",
        "peanuts",
        "sesame",
        "corn",
        "rice",
        "potatoes",
        "onions",
        "cassava",
        "cattle",
        "sheep",
        "goats",
        "camels"
    ],
    "industries": [
        "oil",
        "cotton textiles",
        "brewing",
        "natron (sodium carbonate)",
        "soap",
        "cigarettes",
        "construction materials"
    ],
    "exports": [
        "oil",
        "livestock",
        "cotton",
        "sesame",
        "gum arabic",
        "shea butter"
    ],
    "imports": [
        "machinery and transportation equipment",
        "industrial goods",
        "foodstuffs",
        "textiles"
    ],
    "broadband_subscriptions": "334",
    "internet_users": "1,029,153",
    "mobile_subscriptions": "6,984,130",
    "internet_country_code": ".td",
    "military_and_security_forces": "Chadian National Army (Armee Nationale du Tchad, ANT): Ground Forces (l'Armee de Terre, AdT), Chadian Air Force (l'Armee de l'Air Tchadienne, AAT), General Direction of the Security Services of State Institutions (Direction Generale des Services de Securite des Institutions de l'Etat, GDSSIE); National Gendarmerie; National Nomadic Guard of Chad (GNNT)",
    "percent_GDP_on_military": "2.2%",
    "pipelines": [
        "582 km oil"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "59",
    "international_disputes": "since 2003, ad hoc armed militia groups and the Sudanese military have driven hundreds of thousands of Darfur residents into Chad; Chad wishes to be a helpful mediator in resolving the Darfur conflict, and in 2010 established a joint border monitoring force with Sudan, which has helped to reduce cross-border banditry and violence; only Nigeria and Cameroon have heeded the Lake Chad Commission's admonition to ratify the delimitation treaty, which also includes the Chad-Niger and Niger-Nigeria boundaries",
    "terrorism": "None/Unknown"
}