{
    "id": "location--23",
    "name": "Bhutan",
    "background": "Following Britain's victory in the 1865 Duar War, Britain and Bhutan signed the Treaty of Sinchulu, under which Bhutan would receive an annual subsidy in exchange for ceding land to British India. Ugyen WANGCHUCK - who had served as the de facto ruler of an increasingly unified Bhutan and had improved relations with the British toward the end of the 19th century - was named king in 1907. Three years later, a treaty was signed whereby the British agreed not to interfere in Bhutanese internal affairs, and Bhutan allowed Britain to direct its foreign affairs. Bhutan negotiated a similar arrangement with independent India in 1949. The Indo-Bhutanese Treaty of Friendship returned to Bhutan a small piece of the territory annexed by the British, formalized the annual subsidies the country received, and defined India's responsibilities in defense and foreign relations. Under a succession of modernizing monarchs beginning in the 1950s, Bhutan joined the UN in 1971 and slowly continued its engagement beyond its borders.\nIn 2005, King Jigme Singye WANGCHUCK unveiled the draft of Bhutan's first constitution - which introduced major democratic reforms - and held a national referendum for its approval. The King abdicated the throne in 2006 in favor of his son, Jigme Khesar Namgyel WANGCHUCK. In 2007, India and Bhutan renegotiated their treaty, eliminating the clause that stated that Bhutan would be \"guided by\" India in conducting its foreign policy, although Thimphu continues to coordinate closely with New Delhi. In 2008, Bhutan held its first parliamentary election in accordance with the constitution. Bhutan experienced a peaceful turnover of power following a parliamentary election in 2013, which resulted in the defeat of the incumbent party. In 2018, the incumbent party again lost the parliamentary election. Of the more than 100,000 ethnic Nepali - predominantly Lhotshampa - refugees who fled or were forced out of Bhutan in the 1990s, about 6,500 remain displaced in Nepal.",
    "coordinates": "27 30 N, 90 30 E",
    "region": "Asia",
    "total_area": "38,394 sq km",
    "land_area": "38,394 sq km",
    "water_area": "0 sq km",
    "land_boundary": "1,136 km",
    "neighbors": {
        "India": "659 km"
    },
    "climate": "varies; tropical in southern plains; cool winters and hot summers in central valleys; severe winters and cool summers in Himalayas",
    "coastline": "0 km",
    "natural_hazards": [
        "violent storms from the Himalayas are the source of the country's Bhutanese name, which translates as Land of the Thunder Dragon",
        "frequent landslides during the rainy season"
    ],
    "terrain": "mostly mountainous with some fertile valleys and savanna",
    "population_distribution": "Unknown",
    "natural_resources": [
        "timber",
        "hydropower",
        "gypsum",
        "calcium carbonate"
    ],
    "population": "782,318",
    "nationality": "Bhutanese (singular and plural)",
    "ethnic_groups": {
        "Ngalop": "50%",
        "ethnic Nepali": "35%",
        "indigenous or migrant tribes": "15%"
    },
    "languages": {
        "Sharchhopka": "28%",
        "Dzongkha (official)": "24%",
        "Lhotshamkha": "22%",
        "other": "26%"
    },
    "religions": {
        "Lamaistic Buddhist": "75.3%",
        "Indian- and Nepali-influenced Hinduism": "22.1%",
        "other": "2.6%"
    },
    "government_type": "constitutional monarchy",
    "national_symbols": "thunder dragon known as Druk Gyalpo",
    "national_colors": [
        "orange",
        "yellow"
    ],
    "gdp": "$2.405 billion",
    "agriculture": [
        "rice",
        "corn",
        "root crops",
        "citrus",
        "dairy products",
        "eggs"
    ],
    "industries": [
        "cement",
        "wood products",
        "processed fruits",
        "alcoholic beverages",
        "calcium carbide",
        "tourism"
    ],
    "exports": [
        "electricity (to India)",
        "ferrosilicon",
        "cement",
        "cardamom",
        "calcium carbide",
        "steel rods/bars",
        "dolomite",
        "gypsum"
    ],
    "imports": [
        "fuel and lubricants",
        "airplanes",
        "machinery and parts",
        "rice",
        "motor vehicles"
    ],
    "broadband_subscriptions": "10,802",
    "internet_users": "368,714",
    "mobile_subscriptions": "703,554",
    "internet_country_code": ".bt",
    "military_and_security_forces": "Royal Bhutan Army (includes Royal Bodyguard, plus militia); Ministry of Home and Cultural Affairs: Royal Bhutan Police",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "2",
    "international_disputes": "lacking any treaty describing the boundary, Bhutan and China continue negotiations to establish a common boundary alignment to resolve territorial disputes arising from substantial cartographic discrepancies, the most contentious of which lie in Bhutan's west along China's Chumbi salient",
    "terrorism": "None/Unknown"
}