{
    "id": "location--78",
    "name": "Gibraltar",
    "background": "Strategically important, Gibraltar was reluctantly ceded to Great Britain by Spain in the 1713 Treaty of Utrecht; the British garrison was formally declared a colony in 1830. In a referendum held in 1967, Gibraltarians voted overwhelmingly to remain a British dependency. The subsequent granting of autonomy in 1969 by the UK led Spain to close the border and sever all communication links. Between 1997 and 2002, the UK and Spain held a series of talks on establishing temporary joint sovereignty over Gibraltar. In response to these talks, the Gibraltar Government called a referendum in late 2002 in which the majority of citizens voted overwhelmingly against any sharing of sovereignty with Spain. Since late 2004, Spain, the UK, and Gibraltar have held tripartite talks with the aim of cooperatively resolving problems that affect the local population, and work continues on cooperation agreements in areas such as taxation and financial services; communications and maritime security; policy, legal and customs services; environmental protection; and education and visa services. A new noncolonial constitution came into force in 2007, and the European Court of First Instance recognized Gibraltar's right to regulate its own tax regime in December 2008. The UK retains responsibility for defense, foreign relations, internal security, and financial stability.\nSpain and the UK continue to spar over the territory. Throughout 2009, a dispute over Gibraltar's claim to territorial waters extending out three miles gave rise to periodic non-violent maritime confrontations between Spanish and UK naval patrols and in 2013, the British reported a record number of entries by Spanish vessels into waters claimed by Gibraltar following a dispute over Gibraltar's creation of an artificial reef in those waters. Spain renewed its demands for an eventual return of Gibraltar to Spanish control after the UK's June 2016 vote to leave the EU, but London has dismissed any connection between the vote and its continued sovereignty over Gibraltar. The EU has said that Gibraltar will be ouside the territorial scope of any future UK-EU trade deal and that separate agreements between the EU and UK regarding Gibraltar would require Spain's prior approval.",
    "coordinates": "36 08 N, 5 21 W",
    "region": "Europe",
    "total_area": "6.5 sq km",
    "land_area": "6.5 sq km",
    "water_area": "0 sq km",
    "land_boundary": "1.2 km",
    "neighbors": {},
    "climate": "Mediterranean with mild winters and warm summers",
    "coastline": "12 km",
    "natural_hazards": [
        "occasional droughts",
        "no streams or large bodies of water on the peninsula (all potable water comes from desalination)"
    ],
    "terrain": "a narrow coastal lowland borders the Rock of Gibraltar",
    "population_distribution": "Unknown",
    "natural_resources": [
        "none"
    ],
    "population": "29,581",
    "nationality": "Gibraltarian(s)",
    "ethnic_groups": {
        "Gibraltarian": "79%",
        "other British": "13.2%",
        "Spanish": "2.1%",
        "Moroccan": "1.6%",
        "other EU": "2.4%",
        "other": "1.6%"
    },
    "languages": [
        "English",
        "Spanish",
        "Italian",
        "Portuguese"
    ],
    "religions": {
        "Roman Catholic": "72.1%",
        "Church of England": "7.7%",
        "other Christian": "3.8%",
        "Muslim": "3.6%",
        "Jewish": "2.4%",
        "Hindu": "2%",
        "other": "1.1%",
        "none": "7.1%",
        "unspecified": "0.1%"
    },
    "government_type": "parliamentary democracy (Parliament); self-governing overseas territory of the UK",
    "national_symbols": "Barbary macaque",
    "national_colors": [
        "red",
        "white",
        "yellow"
    ],
    "gdp": "$2.044 billion",
    "agriculture": [
        "none"
    ],
    "industries": [
        "tourism",
        "banking and finance",
        "ship repairing",
        "tobacco"
    ],
    "exports": [
        "(principally reexports) petroleum",
        "manufactured goods"
    ],
    "imports": [
        "fuels",
        "manufactured goods",
        "foodstuffs"
    ],
    "broadband_subscriptions": "19,232",
    "internet_users": "27,823",
    "mobile_subscriptions": "41,045",
    "internet_country_code": ".gi",
    "military_and_security_forces": "Royal Gibraltar Regiment",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Gibraltar"
    },
    "waterways": "Unknown",
    "number_of_airports": "1",
    "international_disputes": "in 2002, Gibraltar residents voted overwhelmingly by referendum to reject any \"shared sovereignty\" arrangement; the Government of Gibraltar insists on equal participation in talks between the UK and Spain; Spain disapproves of UK plans to grant Gibraltar even greater autonomy",
    "terrorism": "None/Unknown"
}