{
    "id": "location--218",
    "name": "West Bank",
    "background": "Inhabited since at least the 15th century B.C., the West Bank has been dominated by many different peoples throughout its history; it was incorporated into the Ottoman Empire in the early 16th century. The West Bank fell to British forces during World War I, becoming part of the British Mandate of Palestine. Following the 1948 Arab-Israeli War, the West Bank was captured by Transjordan (later renamed Jordan), which annexed the West Bank in 1950; it was captured by Israel in the Six-Day War in 1967. Under a series of agreements known as the Oslo accords signed between 1993 and 1999, Israel transferred to the newly created Palestinian Authority (PA) security and civilian responsibility for many Palestinian-populated areas of the West Bank as well as the Gaza Strip. In 2000, a violent intifada or uprising began, and in 2001 negotiations to determine the permanent status of the West Bank and Gaza Strip stalled. Subsequent attempts to re-start direct negotiations have not resulted in progress toward determining final status of the area.\r\nRoughly 60% of the West Bank, remains under Israeli civil and military control. In early 2006, the Islamic Resistance Movement (HAMAS) won a majority in the Palestinian Legislative Council (PLC) election. Attempts to form a unity government between Fatah, the dominant Palestinian political faction in the West Bank, and HAMAS failed, leading to violent clashed between their respective supporters and HAMAS's violent siezure of all military and governmental institutions in the Gaza Strip in June 2007. Since 2007, the PA has administered parts of the West Bank under its control, mainly the major Palestinian population centers and areas immediately surrounding them. Fatah and HAMAS have made several attempts at reconciliation, but the factions have been unable to implement agreements including the latest agreement signed in October 2017. In December 2018, the Palestinian Constitutional Court dissolved the PLC. In 2019, PA President ABBAS renewed his calls for PLC elections.",
    "coordinates": "32 00 N, 35 15 E",
    "region": "Middle East",
    "total_area": "5,860 sq km",
    "land_area": "5,640 sq km",
    "water_area": "220 sq km",
    "land_boundary": "478 km",
    "neighbors": {
        "Jordan": "148 km"
    },
    "climate": "temperate; temperature and precipitation vary with altitude, warm to hot summers, cool to mild winters",
    "coastline": "0 km",
    "natural_hazards": [
        "droughts"
    ],
    "terrain": "mostly rugged, dissected upland in west, flat plains descending to Jordan River Valley to the east",
    "population_distribution": "Palestinian settlements are primarily located in the central to western half of the territory; Jewish settlements are found in pockets throughout, particularly in the northeast, north-central, and around Jerusalem",
    "natural_resources": [
        "arable land"
    ],
    "population": "2,900,034",
    "nationality": "NA",
    "ethnic_groups": [
        "Palestinian Arab",
        "Jewish",
        "other"
    ],
    "languages": [
        "Arabic",
        "Hebrew",
        "English"
    ],
    "religions": {
        "Muslim": "80-85%",
        "Jewish": "12-14%",
        "Christian": "1-2.5%",
        "other": "",
        "unaffiliated": "",
        "unspecified": "1%"
    },
    "government_type": "Unknown",
    "national_symbols": "Unknown",
    "national_colors": [
        "red",
        "white"
    ],
    "gdp": "$9.828 billion\n\n\n\n\nnote: excludes Gaza Strip",
    "agriculture": [
        "olives",
        "citrus fruit",
        "vegetables",
        "beef",
        "dairy products"
    ],
    "industries": [
        "small-scale manufacturing",
        "quarrying",
        "textiles",
        "soap",
        "olive-wood carvings",
        "mother-of-pearl souvenirs"
    ],
    "exports": [
        "stone",
        "olives",
        "fruit",
        "vegetables",
        "limestone"
    ],
    "imports": [
        "food",
        "consumer goods",
        "construction materials",
        "petroleum",
        "chemicals"
    ],
    "broadband_subscriptions": "371,299",
    "internet_users": "2.673 million",
    "mobile_subscriptions": "4,135,363",
    "internet_country_code": ".psnote - same as Gaza Strip",
    "military_and_security_forces": "per the Oslo Accords, the PA is not permitted a conventional military but maintains security and police forces; PA security personnel have operated almost exclusively in the West Bank since HAMAS seized power in the Gaza Strip in 2007; PA forces include National Security Forces, Presidential Guard, Civil Police, Civil Defense, Preventative Security Organization, the General Intelligence Organization, and the Military Intelligence Organization",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "2",
    "international_disputes": "the current status of the West Bank is subject to the Israeli-Palestinian Interim Agreement - permanent status to be determined through further negotiation; Israel continues construction of a \"seam line\" separation barrier along parts of the Green Line and within the West Bank; Israel withdrew from Gaza and four settlements in the northern West Bank in August 2005; since 1948, about 350 peacekeepers from the UN Truce Supervision Organization (UNTSO), headquartered in Jerusalem, monitor ceasefires, supervise armistice agreements, prevent isolated incidents from escalating, and assist other UN personnel in the region",
    "terrorism": {
        "Kahane Chai (Kach)": "restore the biblical state of Israel; expel Arabs from Israel's biblical landsarea(s) of operation",
        "HAMAS": "grow its political and operational presence in the West Bankarea(s) of operation",
        "Islamic Revolutionary Guard Corps -- Qods Force (IRGC-QF)": " launch attacks against Israel, reduce Israel’s presence and influence in the West Bank, and destroy the state of Israel; works through proxies and allies such as Hamas, Palestine Islamic Jihad (PIJ), Palestine Liberation Front (PLF), and Popular Front for the Liberation of Palestine (PFLP)\narea(s) of operations",
        "Palestine Islamic Jihad (PIJ)": "enhance its staging capabilities in the West Bank to launch attacks against Israelarea(s) of operation",
        "Palestine Liberation Front (PLF)": "enhance its networks in the West Bank and, ultimately, destroy the state of Israel; establish a secular, Marxist Palestinian state with Jerusalem as its capitalarea(s) of operation",
        "Popular Front for the Liberation of Palestine (PFLP)": "bolster its recruitment networks in the West Bankarea(s) of operation"
    }
}