{
    "id": "location--152",
    "name": "Oman",
    "background": "The inhabitants of the area of Oman have long prospered from Indian Ocean trade. In the late 18th century, the nascent sultanate in Muscat signed the first in a series of friendship treaties with Britain. Over time, Oman's dependence on British political and military advisors increased, although the sultanate never became a British colony. In 1970, QABOOS bin Said Al-Said overthrew his father, and has since ruled as sultan. Sultan QABOOS has no children and has not designated a successor publicly; the Basic Law of 1996 outlines Oman's succession procedure. Sultan QABOOS' extensive modernization program opened the country to the outside world, and the sultan has prioritized strategic ties with the UK and US. Oman's moderate, independent foreign policy has sought to maintain good relations with its neighbors and to avoid external entanglements.Inspired by the popular uprisings that swept the Middle East and North Africa beginning in January 2011, some Omanis staged demonstrations, calling for more jobs and economic benefits and an end to corruption. In response to those protester demands, QABOOS in 2011 pledged to implement economic and political reforms, such as granting Oman's bicameral legislative body more power and authorizing direct elections for its lower house, which took place in November 2011. Additionally, the Sultan increased unemployment benefits, and, in August 2012, issued a royal directive mandating the speedy implementation of a national job creation plan for thousands of public and private sector Omani jobs. As part of the government's efforts to decentralize authority and allow greater citizen participation in local governance, Oman successfully conducted its first municipal council elections in December 2012. Announced by the sultan in 2011, the municipal councils have the power to advise the Royal Court on the needs of local districts across Oman's 11 governorates. Sultan QABOOS, Oman's longest reigning monarch, died on 11 January 2020. His cousin, HAYTHAM bin Tariq bin Taimur Al-Said, former Minister of Heritage and Culture, was sworn in as Oman's new sultan the same day.",
    "coordinates": "21 00 N, 57 00 E",
    "region": "Middle East",
    "total_area": "309,500 sq km",
    "land_area": "309,500 sq km",
    "water_area": "0 sq km",
    "land_boundary": "1,561 km",
    "neighbors": {
        "UAE": "609 km",
        "Yemen": "294 km"
    },
    "climate": "dry desert; hot, humid along coast; hot, dry interior; strong southwest summer monsoon (May to September) in far south",
    "coastline": "2,092 km",
    "natural_hazards": [
        "summer winds often raise large sandstorms and dust storms in interior",
        "periodic droughts"
    ],
    "terrain": "central desert plain, rugged mountains in north and south",
    "population_distribution": "the vast majority of the population is located in and around the Al Hagar Mountains in the north of the country; another smaller cluster is found around the city of Salalah in the far south; most of the country remains sparsely poplulated",
    "natural_resources": [
        "petroleum",
        "copper",
        "asbestos",
        "some marble",
        "limestone",
        "chromium",
        "gypsum",
        "natural gas"
    ],
    "population": "4,664,844",
    "nationality": "Omani(s)",
    "ethnic_groups": [
        "Arab",
        "Baluchi",
        "South Asian",
        "African"
    ],
    "languages": [
        "Arabic (official)",
        "English",
        "Baluchi",
        "Swahili",
        "Urdu",
        "Indian dialects"
    ],
    "religions": {
        "Muslim": "85.9%",
        "Christian": "6.5%",
        "Hindu": "5.5%",
        "Buddhist": "0.8%",
        "Jewish": "0.1%",
        "other": "1%",
        "unaffiliated": "0.2%"
    },
    "government_type": "absolute monarchy",
    "national_symbol": "khanjar dagger superimposed on two crossed swords",
    "national_colors": [
        "red",
        "white",
        "green"
    ],
    "gdp": "$70.78 billion",
    "agriculture": [
        "dates",
        "limes",
        "bananas",
        "alfalfa",
        "vegetables",
        "camels",
        "cattle",
        "fish"
    ],
    "industries": [
        "crude oil production and refining",
        "natural and liquefied natural gas production",
        "construction",
        "cement",
        "copper",
        "steel",
        "chemicals",
        "optic fiber"
    ],
    "exports": [
        "petroleum",
        "reexports",
        "fish",
        "metals",
        "textiles"
    ],
    "imports": [
        "machinery and transport equipment",
        "manufactured goods",
        "food",
        "livestock",
        "lubricants"
    ],
    "broadband_subscriptions": "422,035",
    "internet_users": "2,801,932",
    "mobile_subscriptions": "6,440,889",
    "internet_country_code": ".om",
    "military_and_security_forces": "Sultan's Armed Forces (SAF): Royal Army of Oman (RAO), Royal Navy of Oman (RNO), Royal Air Force of Oman (RAFO), Royal Guard of Oman (RGO); Royal Oman Police Coast Guard; Tribal Home Guard",
    "percent_GDP_on_military": "8.8%",
    "pipelines": [
        "106 km condensate",
        "4224 km gas",
        "3558 km oil",
        "33 km oil/gas/water",
        "264 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Mina' Qabus, Salalah, Suhar",
        "container port(s) (TEUs)": "Salalah (3,946,421)",
        "LNG terminal(s) (export)": "Qalhat"
    },
    "waterways": "Unknown",
    "number_of_airports": "132",
    "international_disputes": "boundary agreement reportedly signed and ratified with UAE in 2003 for entire border, including Oman's Musandam Peninsula and Al Madhah exclave, but details of the alignment have not been made public",
    "terrorism": "None/Unknown"
}