{
    "id": "location--35",
    "name": "Cambodia",
    "background": "Most Cambodians consider themselves to be Khmers, descendants of the Angkor Empire that extended over much of Southeast Asia and reached its zenith between the 10th and 13th centuries. Attacks by the Thai and Cham (from present-day Vietnam) weakened the empire, ushering in a long period of decline. The king placed the country under French protection in 1863, and it became part of French Indochina in 1887. Following Japanese occupation in World War II, Cambodia gained full independence from France in 1953. In April 1975, after a seven-year struggle, communist Khmer Rouge forces captured Phnom Penh and evacuated all cities and towns. At least 1.5 million Cambodians died from execution, forced hardships, or starvation during the Khmer Rouge regime under POL POT. A December 1978 Vietnamese invasion drove the Khmer Rouge into the countryside, began a 10-year Vietnamese occupation, and touched off  20 years of civil war.\r\nThe 1991 Paris Peace Accords mandated democratic elections and a cease-fire, which was not fully respected by the Khmer Rouge. UN-sponsored elections in 1993 helped restore some semblance of normalcy under a coalition government. Factional fighting in 1997 ended the first coalition government, but a second round of national elections in 1998 led to the formation of another coalition government and renewed political stability. The remaining elements of the Khmer Rouge surrendered in early 1999. Some of the surviving Khmer Rouge leaders were tried for crimes against humanity by a hybrid UN-Cambodian tribunal supported by international assistance. In 2018, the tribunal heard its final cases, but it remains in operation to hear appeals. Elections in July 2003 were relatively peaceful, but it took one year of negotiations between contending political parties before a coalition government was formed. In October 2004, King Norodom SIHANOUK abdicated the throne and his son, Prince Norodom SIHAMONI, was selected to succeed him. Local (Commune Council) elections were held in Cambodia in 2012, with little of the violence that preceded prior elections. National elections in July 2013 were disputed, with the opposition - the Cambodia National Rescue Party (CNRP) - boycotting the National Assembly. The political impasse was ended nearly a year later, with the CNRP agreeing to enter parliament in exchange for commitments by the ruling Cambodian People's Party (CPP) to electoral and legislative reforms. The CNRP made further gains in local commune elections in June 2017, accelerating sitting Prime Minister Hun SEN's efforts to marginalize the CNRP before national elections in 2018. Hun Sen arrested CNRP President Kem SOKHA in September 2017. The Supreme Court dissolved the CNRP in November 2017 and banned its leaders from participating in politics for at least five years. The CNRP's seats in the National Assembly were redistributed to smaller, less influential opposition parties, while all of the CNRP's 5,007 seats in the commune councils throughout the country were reallocated to the CPP. With the CNRP banned, the CPP swept the 2018 national elections, winning all 125 National Assembly seats and effectively turning the country into a one-party state.",
    "coordinates": "13 00 N, 105 00 E",
    "region": "Southeast Asia",
    "total_area": "181,035 sq km",
    "land_area": "176,515 sq km",
    "water_area": "4,520 sq km",
    "land_boundary": "2,530 km",
    "neighbors": {
        "Thailand": "817 km",
        "Vietnam": "1158 km"
    },
    "climate": "tropical; rainy, monsoon season (May to November); dry season (December to April); little seasonal temperature variation",
    "coastline": "443 km",
    "natural_hazards": [
        "monsoonal rains (June to November)",
        "flooding",
        "occasional droughts"
    ],
    "terrain": "mostly low, flat plains; mountains in southwest and north",
    "population_distribution": "population concentrated in the southeast, particularly in and around the capital of Phnom Penh; further distribution is linked closely to the Tonle Sap and Mekong Rivers",
    "natural_resources": [
        "oil and gas",
        "timber",
        "gemstones",
        "iron ore",
        "manganese",
        "phosphates",
        "hydropower potential",
        "arable land"
    ],
    "population": "16,926,984",
    "nationality": "Cambodian(s)",
    "ethnic_groups": {
        "Khmer": "97.6%",
        "Cham": "1.2%",
        "Chinese": "0.1%",
        "Vietnamese": "0.1%",
        "other": "0.9%"
    },
    "languages": {
        "Khmer (official)": "96.3%",
        "other": "3.7%"
    },
    "religions": {
        "Buddhist": "97.9%",
        "Muslim": "1.1%",
        "Christian": "0.5%",
        "other": "0.6%"
    },
    "government_type": "parliamentary constitutional monarchy",
    "national_symbol": "Angkor Wat temple, kouprey (wild ox)",
    "national_colors": [
        "red",
        "blue"
    ],
    "gdp": "$22.09 billion",
    "agriculture": [
        "rice",
        "rubber",
        "corn",
        "vegetables",
        "cashews",
        "cassava",
        "silk"
    ],
    "industries": [
        "tourism",
        "garments",
        "construction",
        "rice milling",
        "fishing",
        "wood and wood products",
        "rubber",
        "cement",
        "gem mining",
        "textiles"
    ],
    "exports": [
        "clothing",
        "timber",
        "rubber",
        "rice",
        "fish",
        "tobacco",
        "footwear"
    ],
    "imports": [
        "petroleum products",
        "cigarettes",
        "gold",
        "construction materials",
        "machinery",
        "motor vehicles",
        "pharmaceutical products"
    ],
    "broadband_subscriptions": "166,200",
    "internet_users": "6,579,808",
    "mobile_subscriptions": "19,417,123",
    "internet_country_code": ".kh",
    "military_and_security_forces": "Royal Cambodian Armed Forces: High Command Headquarters, Royal Cambodian Army, Royal Khmer Navy, Royal Cambodian Air Force; Gendarmerie Royale Khmer (military police force responsible for internal security under Ministry of Interior); the National Counter Terrorism Committee; the National Committee for Maritime Security (performs Coast Guard functions and has representation from military and civilian agencies)",
    "percent_GDP_on_military": "2.3%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Sihanoukville (Kampong Saom)",
        "river port(s)": "Phnom Penh (Mekong)"
    },
    "waterways": "3,700 km",
    "number_of_airports": "16",
    "international_disputes": "Cambodia is concerned about Laos' extensive upstream dam construction; Cambodia and Thailand dispute sections of boundary; in 2011 Thailand and Cambodia resorted to arms in the dispute over the location of the boundary on the precipice surmounted by Preah Vihear Temple ruins, awarded to Cambodia by an International Court of Justice decision in 1962 and part of a UN World Heritage site; Cambodia accuses Vietnam of a wide variety of illicit cross-border activities; progress on a joint development area with Vietnam is hampered by an unresolved dispute over sovereignty of offshore islands",
    "terrorism": "None/Unknown"
}