{
    "id": "location--32",
    "name": "Burma",
    "background": "Various ethnic Burman and ethnic minority city-states or kingdoms occupied the present borders through the 19th century, and several minority ethnic groups continue to maintain independent armies and control territory within the country today, in opposition to the central government. Over a period of 62 years (1824-1886), Britain conquered Burma and incorporated all the groups within the country into its Indian Empire. Burma was administered as a province of India until 1937 when it became a separate, self-governing colony; in 1948, following major battles on its territory during World War II, Burma attained independence from the British Commonwealth. Gen. NE WIN dominated the government from 1962 to 1988, first as military ruler, then as self-appointed president, and later as political kingpin. In response to widespread civil unrest, NE WIN resigned in 1988, but within months the military crushed student-led protests and took power. Since independence, successive Burmese governments have fought on-and-off conflicts with armed ethnic groups seeking autonomy in the country's mountainous border regions.\nMultiparty legislative elections in 1990 resulted in the main opposition party - the National League for Democracy (NLD) - winning a landslide victory. Instead of handing over power, the junta placed NLD leader (and 1991 Nobel Peace Prize recipient) AUNG SAN SUU KYI under house arrest from 1989 to 1995, 2000 to 2002, and from May 2003 to November 2010. In late September 2007, the ruling junta brutally suppressed protests over increased fuel prices led by prodemocracy activists and Buddhist monks, killing an unknown number of people and arresting thousands for participating in the demonstrations - popularly referred to as the Saffron Revolution. In early May 2008, Cyclone Nargis struck Burma, which left over 138,000 dead and tens of thousands injured and homeless. Despite this tragedy, the junta proceeded with its May constitutional referendum, the first vote in Burma since 1990. The 2008 constitution reserves 25% of its seats to the military. Legislative elections held in November 2010, which the NLD boycotted and many in the international community considered flawed, saw the successor ruling junta's mass organization, the Union Solidarity and Development Party garner over 75% of the contested seats.\nThe national legislature convened in January 2011 and selected former Prime Minister THEIN SEIN as president. Although the vast majority of national-level appointees named by THEIN SEIN were former or current military officers, the government initiated a series of political and economic reforms leading to a substantial opening of the long-isolated country. These reforms included releasing hundreds of political prisoners, signing a nationwide cease-fire with several of the country's ethnic armed groups, pursuing legal reform, and gradually reducing restrictions on freedom of the press, association, and civil society. At least due in part to these reforms, AUNG SAN SUU KYI was elected to the national legislature in April 2012 and became chair of the Committee for Rule of Law and Tranquility. Burma served as chair of the Association of Southeast Asian Nations (ASEAN) for 2014. In a flawed but largely credible national legislative election in November 2015 featuring more than 90 political parties, the NLD again won a landslide victory. Using its overwhelming majority in both houses of parliament, the NLD elected HTIN KYAW, AUNG SAN SUU KYI's confidant and long-time NLD supporter, as president. The new legislature created the position of State Counsellor, according AUNG SAN SUU KYI a formal role in the government and making her the de facto head of state. Burma's first credibly elected civilian government after more than five decades of military dictatorship was sworn into office on 30 March 2016. In March 2018, upon HTIN KYAW's resignation, parliament selected WIN MYINT, another long-time ally of AUNG SAN SUU KYI's, as president.\nAttacks in October 2016 and August 2017 on security forces in northern Rakhine State by members of the Arakan Rohingya Salvation Army (ARSA), a Rohingya militant group, resulted in military crackdowns on the Rohingya population that reportedly caused thousands of deaths and human rights abuses. Following the August 2017 violence, over 740,000 Rohingya fled to neighboring Bangladesh as refugees. In November 2017, the US Department of State determined that the August 2017 violence constituted ethnic cleansing of Rohingyas. The UN has called for Burma to allow access to a Fact Finding Mission to investigate reports of human rights violations and abuses and to work with Bangladesh to facilitate repatriation of Rohingya refugees, and in September 2018 the International Criminal Court (ICC) determined it had jurisdiction to investigate reported human rights abuses against Rohingyas. Burma has rejected charges of ethnic cleansing and genocide, and has chosen not to work with the UN Fact Finding Mission or the ICC. In March 2018, President HTIN KYAW announced his voluntary retirement; NLD parliamentarian WIN MYINT was named by the parliament as his successor. In February 2019, the NLD announced it would establish a parliamentary committee to examine options for constitutional reform ahead of national the elections planned for 2020.",
    "coordinates": "22 00 N, 98 00 E",
    "region": "Southeast Asia",
    "total_area": "676,578 sq km",
    "land_area": "653,508 sq km",
    "water_area": "23,070 sq km",
    "land_boundary": "6,522 km",
    "neighbors": {
        "China": "2129 km",
        "India": "1468 km",
        "Laos": "238 km",
        "Thailand": "2416 km"
    },
    "climate": "tropical monsoon; cloudy, rainy, hot, humid summers (southwest monsoon, June to September); less cloudy, scant rainfall, mild temperatures, lower humidity during winter (northeast monsoon, December to April)",
    "coastline": "1,930 km",
    "natural_hazards": [
        "destructive earthquakes and cyclones",
        "flooding and landslides common during rainy season (June to September)",
        "periodic droughts"
    ],
    "terrain": "central lowlands ringed by steep, rugged highlands",
    "population_distribution": "population concentrated along coastal areas and in general proximity to the shores of the Irrawaddy River; the extreme north is relatively underpopulated",
    "natural_resources": [
        "petroleum",
        "timber",
        "tin",
        "antimony",
        "zinc",
        "copper",
        "tungsten",
        "lead",
        "coal",
        "marble",
        "limestone",
        "precious stones",
        "natural gas",
        "hydropower",
        "arable land"
    ],
    "population": "56,590,071",
    "nationality": "Burmese (singular and plural)",
    "ethnic_groups": {
        "Burman": "68%",
        "Shan": "9%",
        "Karen": "7%",
        "Rakhine": "4%",
        "Chinese": "3%",
        "Indian": "2%",
        "Mon": "2%",
        "other": "5%"
    },
    "languages": [
        "Burmese (official)"
    ],
    "religions": {
        "Buddhist": "87.9%",
        "Christian": "6.2%",
        "Muslim": "4.3%",
        "Animist": "0.8%",
        "Hindu": "0.5%",
        "other": "0.2%",
        "none": "0.1%"
    },
    "government_type": "parliamentary republic",
    "national_symbols": "chinthe (mythical lion)",
    "national_colors": [
        "yellow",
        "green",
        "red",
        "white"
    ],
    "gdp": "$67.28 billion",
    "agriculture": [
        "rice",
        "pulses",
        "beans",
        "sesame",
        "groundnuts",
        "sugarcane",
        "fish and fish products",
        "hardwood"
    ],
    "industries": [
        "agricultural processing",
        "wood and wood products",
        "copper",
        "tin",
        "tungsten",
        "iron",
        "cement",
        "construction materials",
        "pharmaceuticals",
        "fertilizer",
        "oil and natural gas",
        "garments",
        "jade and gems"
    ],
    "exports": [
        "natural gas",
        "wood products",
        "pulses and beans",
        "fish",
        "rice",
        "clothing",
        "minerals",
        "including jade and gems"
    ],
    "imports": [
        "fabric",
        "petroleum products",
        "fertilizer",
        "plastics",
        "machinery",
        "transport equipment",
        "cement",
        "construction materials",
        "food products‘ edible oil"
    ],
    "broadband_subscriptions": "129,050",
    "internet_users": "17,064,985",
    "mobile_subscriptions": "61,143,964",
    "internet_country_code": ".mm",
    "military_and_security_forces": "Burmese Defense Service (Tatmadaw): Army (Tatmadaw Kyi), Navy (Tatmadaw Yay), Air Force (Tatmadaw Lay), Directorate of People’s Militia and Border Guard Forces",
    "percent_GDP_on_military": "2.9%",
    "pipelines": [
        "3739 km gas",
        "1321 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Mawlamyine (Moulmein), Sittwe",
        "river port(s)": "Rangoon (Yangon) (Rangoon River)"
    },
    "waterways": "12,800 km",
    "number_of_airports": "64",
    "international_disputes": "over half of Burma's population consists of diverse ethnic groups who have substantial numbers of kin in neighboring countries; Bangladesh struggles to accommodate 912,000 Rohingya, Burmese Muslim minority from Rakhine State, living as refugees in Cox's Bazar; Burmese border authorities are constructing a 200 km (124 mi) wire fence designed to deter illegal cross-border transit and tensions from the military build-up along border with Bangladesh in 2010; Bangladesh referred its maritime boundary claims with Burma and India to the International Tribunal on the Law of the Sea; Burmese forces attempting to dig in to the largely autonomous Shan State to rout local militias tied to the drug trade, prompts local residents to periodically flee into neighboring Yunnan Province in China; fencing along the India-Burma international border at Manipur's Moreh town is in progress to check illegal drug trafficking and movement of militants; over 100,000 mostly Karen refugees and asylum seekers fleeing civil strife, political upheaval, and economic stagnation in Burma were living in remote camps in Thailand near the border as of May 2017",
    "terrorism": "None/Unknown"
}