{
    "id": "location--186",
    "name": "Spain",
    "background": "Spain's powerful world empire of the 16th and 17th centuries ultimately yielded command of the seas to England. Subsequent failure to embrace the mercantile and industrial revolutions caused the country to fall behind Britain, France, and Germany in economic and political power. Spain remained neutral in World War I and II, but suffered through a devastating civil war (1936-39). A peaceful transition to democracy following the death of dictator Francisco FRANCO in 1975, and rapid economic modernization (Spain joined the EU in 1986) gave Spain a dynamic and rapidly growing economy, and made it a global champion of freedom and human rights. More recently, Spain has emerged from a severe economic recession that began in mid-2008, posting four straight years of GDP growth above the EU average. Unemployment has fallen, but remains high, especially among youth. Spain is the Eurozone's fourth largest economy. The country has faced increased domestic turmoil in recent years due to the independence movement in its restive Catalonia region.",
    "coordinates": "40 00 N, 4 00 W",
    "region": "Europe",
    "total_area": "505,370 sq km",
    "land_area": "498,980 sq km",
    "water_area": "6,390 sq km",
    "land_boundary": "1,952.7 km",
    "neighbors": {
        "France": "646 km",
        "Gibraltar": "1.2 km",
        "Portugal": "1224 km",
        "Morocco (Ceuta)": "8 km",
        "Morocco (Melilla)": "10.5 km"
    },
    "climate": "temperate; clear, hot summers in interior, more moderate and cloudy along coast; cloudy, cold winters in interior, partly cloudy and cool along coast",
    "coastline": "4,964 km",
    "natural_hazards": [
        "periodic droughts, occasional flooding",
        "volcanism: volcanic activity in the Canary Islands, located off Africa's northwest coast; Teide (3,715 m) has been deemed a Decade Volcano by the International Association of Volcanology and Chemistry of the Earth's Interior, worthy of study due to its explosive history and close proximity to human populations; La Palma (2,426 m), which last erupted in 1971, is the most active of the Canary Islands volcanoes; Lanzarote is the only other historically active volcano"
    ],
    "terrain": "large, flat to dissected plateau surrounded by rugged hills; Pyrenees Mountains in north",
    "population_distribution": "with the notable exception of Madrid, Sevilla, and Zaragoza, the largest urban agglomerations are found along the Mediterranean and Atlantic coasts; numerous smaller cities are spread throughout the interior reflecting Spain's agrarian heritage; very dense settlement around the capital of Madrid, as well as the port city of Barcelona",
    "natural_resources": [
        "coal",
        "lignite",
        "iron ore",
        "copper",
        "lead",
        "zinc",
        "uranium",
        "tungsten",
        "mercury",
        "pyrites",
        "magnesite",
        "fluorspar",
        "gypsum",
        "sepiolite",
        "kaolin",
        "potash",
        "hydropower",
        "arable land"
    ],
    "population": "50,015,792",
    "nationality": "Spaniard(s)",
    "ethnic_groups": {
        "Spanish": "86.4%",
        "Moroccan": "1.8%",
        "Romanian": "1.3%",
        "other": "10.5%"
    },
    "languages": {
        "Castilian Spanish (official)": "74%",
        "Catalan (official)": "17%",
        "Galician (official)": "7%",
        "Basque (official)": "2%",
        "Aranese (official)": ""
    },
    "religions": {
        "Roman Catholic": "68.9%",
        "atheist": "11.3%",
        "agnostic": "7.6%",
        "other": "2.8%",
        "non-believer": "8.2%",
        "unspecified": "1.1%"
    },
    "government_type": "parliamentary constitutional monarchy",
    "national_symbol": "Pillars of Hercules",
    "national_colors": [
        "red",
        "yellow"
    ],
    "gdp": "$1,314 billion",
    "agriculture": [
        "grain",
        "vegetables",
        "olives",
        "wine grapes",
        "sugar beets",
        "citrus",
        "beef",
        "pork",
        "poultry",
        "dairy products",
        "fish"
    ],
    "industries": [
        "textiles and apparel (including footwear)",
        "food and beverages",
        "metals and metal manufactures",
        "chemicals",
        "shipbuilding",
        "automobiles",
        "machine tools",
        "tourism",
        "clay and refractory products",
        "footwear",
        "pharmaceuticals",
        "medical equipment"
    ],
    "exports": [
        "machinery",
        "motor vehicles",
        "foodstuffs",
        "pharmaceuticals",
        "medicines",
        "other consumer goods"
    ],
    "imports": [
        "machinery and equipment",
        "fuels",
        "chemicals",
        "semi-finished goods",
        "foodstuffs",
        "consumer goods",
        "measuring and medical control instruments"
    ],
    "broadband_subscriptions": "15,176,954",
    "internet_users": "42,478,990",
    "mobile_subscriptions": "54,161,014",
    "internet_country_code": ".es",
    "military_and_security_forces": "Spanish Armed Forces: Army (Ejercito de Tierra), Spanish Navy (Armada Espanola, AE, includes Marine Corps), Spanish Air Force (Ejercito del Aire Espanola, EdA); Civil Guard (Guardia Civil)",
    "percent_GDP_on_military": "0.92%",
    "pipelines": [
        "10481 km gas",
        "358 km oil",
        "4378 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Algeciras, Barcelona, Bilbao, Cartagena, Huelva, Tarragona, Valencia (all in Spain); Las Palmas, Santa Cruz de Tenerife (in the Canary Islands)",
        "container port(s) (TEUs)": "Algeciras (4,389,836), Barcelona (2,968,757), Valencia (4,832,156)",
        "LNG terminal(s) (import)": "Barcelona, Bilbao, Cartagena, Huelva, Mugardos, Sagunto"
    },
    "waterways": "1,000 km",
    "number_of_airports": "135",
    "international_disputes": "in 2002, Gibraltar residents voted overwhelmingly by referendum to reject any \"shared sovereignty\" arrangement; the Government of Gibraltar insists on equal participation in talks between the UK and Spain; Spain disapproves of UK plans to grant Gibraltar greater autonomy; after voters in the UK chose to leave the EU in a June 2016 referendum, Spain again proposed shared sovereignty of Gibraltar; UK officials rejected Spain's joint sovereignty proposal; Morocco protests Spain's control over the coastal enclaves of Ceuta, Melilla, and the islands of Penon de Velez de la Gomera, Penon de Alhucemas, and Islas Chafarinas, and surrounding waters; both countries claim Isla Perejil (Leila Island); Morocco serves as the primary launching site of illegal migration into Spain from North Africa; Portugal does not recognize Spanish sovereignty over the territory of Olivenza based on a difference of interpretation of the 1815 Congress of Vienna and the 1801 Treaty of Badajoz",
    "terrorism": "None/Unknown"
}