{
    "id": "location--56",
    "name": "Djibouti",
    "background": "The region of present-day Djibouti was the site of the medieval Ifat and Adal Sultanates. In the late 19th century, treaties signed by the ruling Somali and Afar sultans with the French allowed the latter to establish the colony of French Somaliland. The designation continued in use until 1967, when the name was changed to the French Territory of the Afars and the Issas. Upon independence in 1977, the country was named after its capital city of Djibouti. Hassan Gouled APTIDON installed an authoritarian one-party state and proceeded to serve as president until 1999. Unrest among the Afar minority during the 1990s led to a civil war that ended in 2001 with a peace accord between Afar rebels and the Somali Issa-dominated government. In 1999, Djibouti's first multiparty presidential election resulted in the election of Ismail Omar GUELLEH as president; he was reelected to a second term in 2005 and extended his tenure in office via a constitutional amendment, which allowed him to serve a third term in 2011 and begin a fourth term in 2016. Djibouti occupies a strategic geographic location at the intersection of the Red Sea and the Gulf of Aden. Its ports handle 95% of Ethiopia's trade. Djibouti's ports also service transshipments between Europe, the Middle East, and Asia. The government holds longstanding ties to France, which maintains a military presence in the country, as does the US, Japan, Italy, Germany, Spain, and China.",
    "coordinates": "11 30 N, 43 00 E",
    "region": "Africa",
    "total_area": "23,200 sq km",
    "land_area": "23,180 sq km",
    "water_area": "20 sq km",
    "land_boundary": "528 km",
    "neighbors": {
        "Ethiopia": "342 km",
        "Somalia": "61 km"
    },
    "climate": "desert; torrid, dry",
    "coastline": "314 km",
    "natural_hazards": [
        "earthquakes",
        "droughts",
        "occasional cyclonic disturbances from the Indian Ocean bring heavy rains and flash floods",
        "volcanism: experiences limited volcanic activity; Ardoukoba (298 m) last erupted in 1978; Manda-Inakir, located along the Ethiopian border, is also historically active"
    ],
    "terrain": "coastal plain and plateau separated by central mountains",
    "population_distribution": "most densely populated areas are in the east; the largest city is Djibouti, with a population over 600,000; no other city in the country has a total population over 50,000 as shown in this population distribution map",
    "natural_resources": [
        "potential geothermal power",
        "gold",
        "clay",
        "granite",
        "limestone",
        "marble",
        "salt",
        "diatomite",
        "gypsum",
        "pumice",
        "petroleum"
    ],
    "population": "921,804",
    "nationality": "Djiboutian(s)",
    "ethnic_groups": {
        "Somali": "60%",
        "Afar": "35%",
        "other": "5%"
    },
    "languages": [
        "French (official)",
        "Arabic (official)",
        "Somali",
        "Afar"
    ],
    "religions": {
        "Sunni Muslim": "94%",
        "Christian": "6%"
    },
    "government_type": "presidential republic",
    "national_symbols": "red star",
    "national_colors": [
        "light blue",
        "green",
        "white",
        "red"
    ],
    "gdp": "$2.029 billion",
    "agriculture": [
        "fruits",
        "vegetables",
        "goats",
        "sheep",
        "camels",
        "animal hides"
    ],
    "industries": [
        "construction",
        "agricultural processing",
        "shipping"
    ],
    "exports": [
        "reexports",
        "hides and skins",
        "scrap metal"
    ],
    "imports": [
        "foods",
        "beverages",
        "transport equipment",
        "chemicals",
        "petroleum products",
        "clothing"
    ],
    "broadband_subscriptions": "25,508",
    "internet_users": "492,221",
    "mobile_subscriptions": "395,037",
    "internet_country_code": ".dj",
    "military_and_security_forces": "Djibouti Armed Forces (FAD): Djibouti National Army (includes Navy, Djiboutian Air Force, National Gendarmerie); Djibouti Coast Guard",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Djibouti"
    },
    "waterways": "Unknown",
    "number_of_airports": "13",
    "international_disputes": "Djibouti maintains economic ties and border accords with \"Somaliland\" leadership while maintaining some political ties to various factions in Somalia; Kuwait is chief investor in the 2008 restoration and upgrade of the Ethiopian-Djibouti rail link; in 2008, Eritrean troops moved across the border on Ras Doumera peninsula and occupied Doumera Island with undefined sovereignty in the Red Sea",
    "terrorism": "None/Unknown"
}