{
    "id": "location--188",
    "name": "Sudan",
    "background": "The region along the Nile River south of Egypt has long been referred to as Nubia. It was the site of the Kingdom of Kerma, which flourished for about a millennium (ca. 2500-1500 B.C.) until absorbed into the New Kingdom of Egypt. By the 11th century B.C., a Kingdom of Kush emerged and regained the region's independence from Egypt; it lasted in various forms until the middle of the fourth century A.D. After the fall of Kush, the Nubians formed three Christian kingdoms of Nobatia, Makuria, and Alodia, the latter two endured until around 1500. Between the 14th and 15th centuries much of Sudan was settled by Arab nomads, and between the 16th–19th centuries it underwent extensive Islamization. Egyptian occupation early in the 19th century was overthrown by a native Mahdist Sudan state (1885-99) that was crushed by the British who then set up an Anglo-Egyptian Sudan - nominally a condominium, but in effect a British colony.Following independence from Anglo-Egyptian co-rule in 1956, military regimes favoring Islamic-oriented governments have dominated national politics. Sudan was embroiled in two prolonged civil wars during most of the remainder of the 20th century. These conflicts were rooted in northern economic, political, and social domination of largely non-Muslim, non-Arab southern Sudanese. The first civil war ended in 1972 but another broke out in 1983. Peace talks gained momentum in 2002-04 with the signing of several accords. The final North/South Comprehensive Peace Agreement (CPA), signed in January 2005, granted the southern rebels autonomy for six years followed by a referendum on independence for Southern Sudan. The referendum was held in January 2011 and indicated overwhelming support for independence. South Sudan became independent on 9 July 2011. Sudan and South Sudan have yet to fully implement security and economic agreements signed in September 2012 relating to the normalization of relations between the two countries. The final disposition of the contested Abyei region has also to be decided. The 30-year reign of President Umar Hassan Ahmad al-BASHIR ended in his ouster in April 2019, and a Sovereignty Council, a joint civilian-military-executive body, holds power as of November 2019.\nFollowing South Sudan's independence, conflict broke out between the government and the Sudan People's Liberation Movement-North in Southern Kordofan and Blue Nile states (together known as the Two Areas), resulting in a humanitarian crisis affecting more than a million people. A earlier conflict that broke out in the western region of Darfur in 2003, displaced nearly 2 million people and caused thousands of deaths.  While some repatriation has taken place, about 1.83 million IDPs remain in Sudan as of May 2019. Fighting in both the Two Areas and Darfur between government forces and opposition has largely subsided, however the civilian populations are affected by low-level violence including inter-tribal conflict and banditry, largely a result of weak rule of law. The UN and the African Union have jointly commanded a Darfur peacekeeping operation (UNAMID) since 2007, but are slowly drawing down as the situation in Darfur becomes more stable. Sudan also has faced refugee influxes from neighboring countries, primarily Ethiopia, Eritrea, Chad, Central African Republic, and South Sudan. Armed conflict, poor transport infrastructure, and denial of access by both the government and armed opposition have impeded the provision of humanitarian assistance to affected populations. However, Sudan's new transitional government has stated its priority to allow greater humanitarian access, as the food security and humanitarian situation in Sudan worsens and as it appeals to the West for greater engagement.",
    "coordinates": "15 00 N, 30 00 E",
    "region": "Africa",
    "total_area": "1,861,484 sq km",
    "land_area": "1,731,671 sq km",
    "water_area": "129,813 sq km",
    "land_boundary": "6,819 km",
    "neighbors": {
        "Chad": "1403 km",
        "Egypt": "1276 km",
        "Eritrea": "682 km",
        "Ethiopia": "744 km",
        "Libya": "382 km",
        "South Sudan": "2158 km"
    },
    "climate": "hot and dry; arid desert; rainy season varies by region (April to November)",
    "coastline": "853 km",
    "natural_hazards": [
        "dust storms and periodic persistent droughts"
    ],
    "terrain": "generally flat, featureless plain; desert dominates the north",
    "population_distribution": "with the exception of a ribbon of settlement that corresponds to the banks of the Nile, northern Sudan, which extends into the dry Sahara, is sparsely populated; more abundant vegetation and broader access to water increases population distribution in the south extending habitable range along nearly the entire border with South Sudan; sizeable areas of population are found around Khartoum, southeast between the Blue and White Nile Rivers, and througout South Darfur as shown on this population distribution map",
    "natural_resources": [
        "petroleum",
        "small reserves of iron ore",
        "copper",
        "chromium ore",
        "zinc",
        "tungsten",
        "mica",
        "silver",
        "gold",
        "hydropower"
    ],
    "population": "45,561,556",
    "nationality": "Sudanese (singular and plural)",
    "ethnic_groups": [
        "unspecified Sudanese Arab",
        "Fur",
        "Beja",
        "Nuba",
        "Fallata"
    ],
    "languages": [
        "Arabic (official)",
        "English (official)",
        "Nubian",
        "Ta Bedawie",
        "Fur"
    ],
    "religions": [
        "Sunni Muslim",
        "small Christian minority"
    ],
    "government_type": "presidential republic",
    "national_symbols": "secretary bird",
    "national_colors": [
        "red",
        "white",
        "black",
        "green"
    ],
    "gdp": "$45.82 billion",
    "agriculture": [
        "cotton",
        "groundnuts",
        "sorghum",
        "millet",
        "wheat",
        "gum Arabic",
        "sugarcane",
        "cassava",
        "mangoes",
        "papaya",
        "bananas",
        "sweet potatoes",
        "sesame seeds",
        "animal feed",
        "sheep and other livestock"
    ],
    "industries": [
        "oil",
        "cotton ginning",
        "textiles",
        "cement",
        "edible oils",
        "sugar",
        "soap distilling",
        "shoes",
        "petroleum refining",
        "pharmaceuticals",
        "armaments",
        "automobile/light truck assembly",
        "milling"
    ],
    "exports": [
        "gold",
        "oil and petroleum products",
        "cotton",
        "sesame",
        "livestock",
        "peanuts",
        "gum Arabic",
        "sugar"
    ],
    "imports": [
        "foodstuffs",
        "manufactured goods",
        "refinery and transport equipment",
        "medicines",
        "chemicals",
        "textiles",
        "wheat"
    ],
    "broadband_subscriptions": "31,352",
    "internet_users": "13,311,404",
    "mobile_subscriptions": "30,100,412",
    "internet_country_code": ".sd",
    "military_and_security_forces": "Sudanese Armed Forces (SAF): Ground Force, Navy, Sudanese Air Force; Rapid Support Forces (paramilitary); Reserve Department (formerly the paramilitary Popular Defense Forces)",
    "percent_GDP_on_military": "1.6%",
    "pipelines": [
        "156 km gas",
        "4070 km oil",
        "1613 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Port Sudan"
    },
    "waterways": "4,068 km",
    "number_of_airports": "67",
    "international_disputes": "the effects of Sudan's ethnic and rebel militia fighting since the mid-20th century have penetrated all of the neighboring states; Chad wishes to be a helpful mediator in resolving the Darfur conflict, and in 2010 established a joint border monitoring force with Sudan, which has helped to reduce cross-border banditry and violence; as of early 2019, more than 590,000 Sudanese refugees are being hosted in the Central African Republic, Chad, Egypt, Ethiopia, Kenya, and South Sudan; Sudan, in turn, is hosting more than 975,000 refugees and asylum seekers, including more than 845,000 from South Sudan; Sudan accuses South Sudan of supporting Sudanese rebel groups; Sudan claims but Egypt de facto administers security and economic development of the Halaib region north of the 22nd parallel boundary; periodic violent skirmishes with Sudanese residents over water and grazing rights persist among related pastoral populations along the border with the Central African Republic; South Sudan-Sudan boundary represents 1 January 1956 alignment, final alignment pending negotiations and demarcation; final sovereignty status of Abyei Area pending negotiations between South Sudan and Sudan",
    "terrorism": "None/Unknown"
}