{
    "id": "location--24",
    "name": "Bolivia",
    "background": "Bolivia, named after independence fighter Simon BOLIVAR, broke away from Spanish rule in 1825; much of its subsequent history has consisted of a series of coups and countercoups, with the last coup occurring in 1978. Democratic civilian rule was established in 1982, but leaders have faced difficult problems of deep-seated poverty, social unrest, and illegal drug production.\nIn December 2005, Bolivians elected Movement Toward Socialism leader Evo MORALES president - by the widest margin of any leader since the restoration of civilian rule in 1982 - after he ran on a promise to change the country's traditional political class and empower the nation's poor, indigenous majority. In December 2009 and October 2014, President MORALES easily won reelection. His party maintained control of the legislative branch of the government, which has allowed him to continue his process of change. In February 2016, MORALES narrowly lost a referendum to approve a constitutional amendment that would have allowed him to compete in the 2019 presidential election. However, a 2017 Supreme Court ruling stating that term limits violate human rights provided the justification for MORALES to be chosen by his party to run again in 2019. MORALES attempted to claim victory in the 20 October 2019 election, but widespread allegations of electoral fraud, rising violence, and pressure from the military ultimately forced him to flee the country. An interim government is preparing new elections for 2020.",
    "coordinates": "17 00 S, 65 00 W",
    "region": "South America",
    "total_area": "1,098,581 sq km",
    "land_area": "1,083,301 sq km",
    "water_area": "15,280 sq km",
    "land_boundary": "7,252 km",
    "neighbors": {
        "Brazil": "3403 km",
        "Chile": "942 km",
        "Paraguay": "753 km",
        "Peru": "1212 km"
    },
    "climate": "varies with altitude; humid and tropical to cold and semiarid",
    "coastline": "0 km",
    "natural_hazards": [
        "flooding in the northeast (March to April)",
        "volcanism: volcanic activity in Andes Mountains on the border with Chile; historically active volcanoes in this region are Irruputuncu (5,163 m), which last erupted in 1995, and the Olca-Paruma volcanic complex (5,762 m to 5,167 m)"
    ],
    "terrain": "rugged Andes Mountains with a highland plateau (Altiplano), hills, lowland plains of the Amazon Basin",
    "population_distribution": "a high altitude plain in the west between two cordillera of the Andes, known as the Altiplano, is the focal area for most of the population; a dense settlement pattern is also found in and around the city of Santa Cruz, located on the eastern side of the Andes",
    "natural_resources": [
        "tin",
        "natural gas",
        "petroleum",
        "zinc",
        "tungsten",
        "antimony",
        "silver",
        "iron",
        "lead",
        "gold",
        "timber",
        "hydropower"
    ],
    "population": "11,639,909",
    "nationality": "Bolivian(s)",
    "ethnic_groups": {
        "mestizo": "68%",
        "indigenous": "20%",
        "white": "5%",
        "cholo/chola": "2%",
        "black": "1%",
        "other": "1%",
        "nspecified 3% ; 44% of respondents indicated feeling part of some indigenous": "group",
        "predominantly Quechua or Aymara": ""
    },
    "languages": {
        "Spanish (official)": "60.7%",
        "Quechua (official)": "21.2%",
        "Aymara (official)": "14.6%",
        "Guarani (official)": "0.6%",
        "other native languages": "0.4%",
        "foreign languages": "2.4%",
        "none": "0.1%"
    },
    "religions": {
        "Roman Catholic": "76.8%",
        "Evangelical and Pentecostal": "8.1%",
        "Protestant": "7.9%",
        "other": "1.7%",
        "none": "5.5%"
    },
    "government_type": "presidential republic",
    "national_symbols": "llama, Andean condor, two national flowers: the cantuta and the patuju",
    "national_colors": [
        "red",
        "yellow",
        "green"
    ],
    "gdp": "$37.78 billion",
    "agriculture": [
        "soybeans",
        "quinoa",
        "Brazil nuts",
        "sugarcane",
        "coffee",
        "corn",
        "rice",
        "potatoes",
        "chia",
        "coca"
    ],
    "industries": [
        "mining",
        "smelting",
        "electricity",
        "petroleum",
        "food and beverages",
        "handicrafts",
        "clothing",
        "jewelry"
    ],
    "exports": [
        "natural gas",
        "silver",
        "zinc",
        "lead",
        "tin",
        "gold",
        "quinoa",
        "soybeans and soy products"
    ],
    "imports": [
        "machinery",
        "petroleum products",
        "vehicles",
        "iron and steel",
        "plastics"
    ],
    "broadband_subscriptions": "504,097",
    "internet_users": "4,955,569",
    "mobile_subscriptions": "11,445,830",
    "internet_country_code": ".bo",
    "military_and_security_forces": "Bolivian Armed Forces: Bolivian Army (Ejercito Boliviano, EB), Bolivian Naval Force (Fuerza Naval Boliviana, FNB, includes Marines), Bolivian Air Force (Fuerza Aerea Boliviana, FAB); Ministry of Interior: National Police (Policía Nacional de Bolivia, PNB; includes Anti-Narcotics Special Forces (Fuerza Especial de Lucha Contra el Narcotráfico, FELCN) and other paramilitary units",
    "percent_GDP_on_military": "1.4%",
    "pipelines": [
        "5457 km gas",
        "51 km liquid petroleum gas",
        "2511 km oil",
        "1627 km refined products"
    ],
    "ports_and_terminals": {
        "river port(s)": "Puerto Aguirre (Paraguay/Parana)"
    },
    "waterways": "10,000 km",
    "number_of_airports": "855",
    "international_disputes": "Chile and Peru rebuff Bolivia's reactivated claim to restore the Atacama corridor, ceded to Chile in 1884, but Chile offers instead unrestricted but not sovereign maritime access through Chile for Bolivian products; contraband smuggling, human trafficking, and illegal narcotic trafficking are problems in the porous areas of its border regions with all of its neighbors (Argentina, Brazil, Chile, Paraguay, and Peru)",
    "terrorism": "None/Unknown"
}