{
    "id": "location--60",
    "name": "Egypt",
    "background": "The regularity and richness of the annual Nile River flood, coupled with semi-isolation provided by deserts to the east and west, allowed for the development of one of the world's great civilizations. A unified kingdom arose circa 3200 B.C., and a series of dynasties ruled in Egypt for the next three millennia. The last native dynasty fell to the Persians in 341 B.C., who in turn were replaced by the Greeks, Romans, and Byzantines. It was the Arabs who introduced Islam and the Arabic language in the 7th century and who ruled for the next six centuries. A local military caste, the Mamluks took control about 1250 and continued to govern after the conquest of Egypt by the Ottoman Turks in 1517. Completion of the Suez Canal in 1869 elevated Egypt as an important world transportation hub. Ostensibly to protect its investments, Britain seized control of Egypt's government in 1882, but nominal allegiance to the Ottoman Empire continued until 1914. Partially independent from the UK in 1922, Egypt acquired full sovereignty from Britain in 1952. The completion of the Aswan High Dam in 1971 and the resultant Lake Nasser have reaffirmed the time-honored place of the Nile River in the agriculture and ecology of Egypt. A rapidly growing population (the largest in the Arab world), limited arable land, and dependence on the Nile all continue to overtax resources and stress society. The government has struggled to meet the demands of Egypt's fast-growing population as it implements far-reaching economic reforms, including the reduction of select subsidies, large-scale infrastructure projects, energy cooperation, and foreign direct investment appeals.\nInspired by the 2010 Tunisian revolution, Egyptian opposition groups led demonstrations and labor strikes countrywide, culminating in President Hosni MUBARAK's ouster in 2011. Egypt's military assumed national leadership until a new legislature was in place in early 2012; later that same year, Muhammad MURSI won the presidential election. Following protests throughout the spring of 2013 against MURSI's government and the Muslim Brotherhood, the Egyptian Armed Forces intervened and removed MURSI from power in July 2013 and replaced him with interim president Adly MANSOUR. Simultaneously, the government began enacting laws to limit freedoms of assembly and expression. In January 2014, voters approved a new constitution by referendum and in May 2014 elected former defense minister Abdelfattah ELSISI president. Egypt elected a new legislature in December 2015, its first Hose of Representatives since 2012. ELSISI was reelected to a second four-year term in March 2018. In April 2019, Egypt approved via national referendum a set of constitutional amendments extending ELSISI's term in office through 2024 and possibly through 2030 if re-elected for a third term. The amendments would also allow future presidents up to two consecutive six-year terms in office, re-establish an upper legislative house, allow for one or more vice presidents, establish a 25% quota for female legislators, reaffirm the military's role as guardian of Egypt, and expand presidential authority to appoint the heads of judicial councils.",
    "coordinates": "27 00 N, 30 00 E",
    "region": "Africa",
    "total_area": "1,001,450 sq km",
    "land_area": "995,450 sq km",
    "water_area": "6,000 sq km",
    "land_boundary": "2,612 km",
    "neighbors": {
        "Israel": "208 km",
        "Libya": "1115 km",
        "Sudan": "1276 km"
    },
    "climate": "desert; hot, dry summers with moderate winters",
    "coastline": "2,450 km",
    "natural_hazards": [
        "periodic droughts",
        "frequent earthquakes",
        "flash floods",
        "landslides",
        "hot, driving windstorms called khamsin occur in spring",
        "dust storms",
        "sandstorms"
    ],
    "terrain": "vast desert plateau interrupted by Nile valley and delta",
    "population_distribution": "approximately 95% of the population lives within 20 km of the Nile River and its delta; vast areas of the country remain sparsely populated or uninhabited as shown in this population distribution map",
    "natural_resources": [
        "petroleum",
        "natural gas",
        "iron ore",
        "phosphates",
        "manganese",
        "limestone",
        "gypsum",
        "talc",
        "asbestos",
        "lead",
        "rare earth elements",
        "zinc"
    ],
    "population": "104,124,440",
    "nationality": "Egyptian(s)",
    "ethnic_groups": {
        "Egyptian": "99.7%",
        "other": "0.3%"
    },
    "languages": [
        "Arabic (official)",
        "Arabic",
        "English",
        "and French widely understood by educated classes"
    ],
    "religions": {
        "Muslim": "90%",
        "Christian": "10%"
    },
    "government_type": "presidential republic",
    "national_symbol": "golden eagle, white lotus",
    "national_colors": [
        "red",
        "white",
        "black"
    ],
    "gdp": "$236.5 billion",
    "agriculture": [
        "cotton",
        "rice",
        "corn",
        "wheat",
        "beans",
        "fruits",
        "vegetables",
        "cattle",
        "water buffalo",
        "sheep",
        "goats"
    ],
    "industries": [
        "textiles",
        "food processing",
        "tourism",
        "chemicals",
        "pharmaceuticals",
        "hydrocarbons",
        "construction",
        "cement",
        "metals",
        "light manufactures"
    ],
    "exports": [
        "crude oil and petroleum products",
        "fruits and vegetables",
        "cotton",
        "textiles",
        "metal products",
        "chemicals",
        "processed food"
    ],
    "imports": [
        "machinery and equipment",
        "foodstuffs",
        "chemicals",
        "wood products",
        "fuels"
    ],
    "broadband_subscriptions": "6,579,762",
    "internet_users": "46,644,728",
    "mobile_subscriptions": "93,784,497",
    "internet_country_code": ".eg",
    "military_and_security_forces": "Egyptian Armed Forces (EAF): Army (includes surface-to-surface missile forces, special forces, Republican Guard), Navy (includes coastal defense, Coast Guard), Air Force, Air Defense Command; Ministry of Interior: Central Security Forces, National Police",
    "percent_GDP_on_military": "1.2%",
    "pipelines": [
        "486 km condensate",
        "74 km condensate/gas",
        "7986 km gas",
        "957 km liquid petroleum gas",
        "5225 km oil",
        "37 km oil/gas/water",
        "895 km refined products",
        "65 km water"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Mediterranean Sea - Alexandria, Damietta, El Dekheila, Port Said",
        "oil terminal(s)": "Ain Sukhna terminal, Sidi Kerir terminal",
        "container port(s) (TEUs)": "Alexandria (1,613,000), Port Said (East) (2,968,308)",
        "LNG terminal(s) (export)": "Damietta, Idku (Abu Qir Bay)"
    },
    "waterways": "3,500 km",
    "number_of_airports": "83",
    "international_disputes": "Sudan claims but Egypt de facto administers security and economic development of Halaib region north of the 22nd parallel boundary; Egypt no longer shows its administration of the Bir Tawil trapezoid in Sudan on its maps; Gazan breaches in the security wall with Egypt in January 2008 highlight difficulties in monitoring the Sinai border; Saudi Arabia claims Egyptian-administered islands of Tiran and Sanafir",
    "terrorism": {
        "Islamic State of Iraq and ash-Sham (ISIS)-Sinai Province": "spread the ISIS caliphate by eliminating the Egyptian Government, destroying Israel, and establishing an Islamic emirate in the Sinaiarea(s) of operation",
        "al-Qa'ida (AQ)": "overthrow the Egyptian Government and, ultimately, establish a pan-Islamic caliphate under a strict Salafi Muslim interpretation of shariaarea(s) of operation",
        "Army of Islam (AOI)": "disrupt the Egyptian Government's efforts to provide security and, ultimately, establish an Islamic caliphatearea(s) of operation"
    }
}