{
    "id": "location--180",
    "name": "Slovakia",
    "background": "Slovakia traces its roots to the 9th century state of Great Moravia. Subsequently, the Slovaks became part of the Hungarian Kingdom, where they remained for the next 1,000 years. After the formation of the dual Austro-Hungarian monarchy in 1867, backlash to language and education policies favoring the use of Hungarian (Magyarization) encouraged the strengthening of Slovak nationalism and a cultivation of cultural ties with the closely related Czechs, who fell administratively under the Austrian half of the empire. After the dissolution of the Austro-Hungarian Empire at the close of World War I, the Slovaks joined the Czechs to form Czechoslovakia. The new state was envisioned as a nation with Czech and Slovak branches. During the interwar period, Slovak nationalist leaders pushed for autonomy within Czechoslovakia, and in 1939 Slovakia became an independent state created by and allied with Nazi Germany. Following World War II, Czechoslovakia was reconstituted and came under communist rule within Soviet-dominated Eastern Europe. In 1968, an invasion by Warsaw Pact troops ended the efforts of Czechoslovakia's leaders to liberalize communist rule and create \"socialism with a human face,\" ushering in a period of repression known as \"normalization.\" The peaceful \"Velvet Revolution\" swept the Communist Party from power at the end of 1989 and inaugurated a return to democratic rule and a market economy. On 1 January 1993, Czechoslovakia underwent a nonviolent \"velvet divorce\" into its two national components, Slovakia and the Czech Republic. Slovakia joined both NATO and the EU in the spring of 2004 and the euro zone on 1 January 2009.",
    "coordinates": "48 40 N, 19 30 E",
    "region": "Europe",
    "total_area": "49,035 sq km",
    "land_area": "48,105 sq km",
    "water_area": "930 sq km",
    "land_boundary": "1,611 km",
    "neighbors": {
        "Czech Republic": "241 km",
        "Hungary": "627 km",
        "Poland": "541 km",
        "Ukraine": "97 km"
    },
    "climate": "temperate; cool summers; cold, cloudy, humid winters",
    "coastline": "0 km",
    "natural_hazards": [
        "flooding"
    ],
    "terrain": "rugged mountains in the central and northern part and lowlands in the south",
    "population_distribution": "a fairly even distribution throughout most of the country; slightly larger concentration in the west in proximity to the Czech border",
    "natural_resources": [
        "lignite",
        "small amounts of iron ore",
        "copper and manganese ore",
        "salt",
        "arable land"
    ],
    "population": "5,440,602",
    "nationality": "Slovak(s)",
    "ethnic_groups": {
        "Slovak": "80.7%",
        "Hungarian": "8.5%",
        "Romani": "2%",
        "other": "1.8%",
        "unspecified": "7%"
    },
    "languages": {
        "Slovak (official)": "78.6%",
        "Hungarian": "9.4%",
        "Roma": "2.3%",
        "Ruthenian": "1%",
        "other or unspecified": "8.8%"
    },
    "religions": {
        "Roman Catholic": "62%",
        "Protestant": "8.2%",
        "Greek Catholic": "3.8%",
        "other or unspecified": "12.5%",
        "none": "13.4%"
    },
    "government_type": "parliamentary republic",
    "national_symbols": "double-barred cross (Cross of St. Cyril and St. Methodius) surmounting three peaks",
    "national_colors": [
        "white",
        "blue",
        "red"
    ],
    "gdp": "$95.96 billion",
    "agriculture": [
        "grains",
        "potatoes",
        "sugar beets",
        "hops",
        "fruit",
        "pigs",
        "cattle",
        "poultry",
        "forest products"
    ],
    "industries": [
        "automobiles",
        "metal and metal products",
        "electricity",
        "gas",
        "coke",
        "oil",
        "nuclear fuel",
        "chemicals",
        "synthetic fibers",
        "wood and paper products",
        "machinery",
        "earthenware and ceramics",
        "textiles",
        "electrical and optical apparatus",
        "rubber products",
        "food and beverages",
        "pharmaceutical"
    ],
    "exports": [
        "vehicles and related parts",
        "machinery and electrical equipment",
        "nuclear reactors and furnaces",
        "iron and steel",
        "mineral oils and fuels"
    ],
    "imports": [
        "machinery and electrical equipment 20%",
        "vehicles and related parts 14%",
        "nuclear reactors and furnaces 12%",
        "fuel and mineral oils 9%"
    ],
    "broadband_subscriptions": "1,507,998",
    "internet_users": "4,391,969",
    "mobile_subscriptions": "7,241,702",
    "internet_country_code": ".sk",
    "military_and_security_forces": "Armed Forces of the Slovak Republic (Ozbrojene Sily Slovenskej Republiky): Land Forces, Air and Air Defense Forces, and a Joint Training and Support Command",
    "percent_GDP_on_military": "1.74%",
    "pipelines": [
        "2270 km gas transmission pipelines",
        "6278 km high-pressure gas distribution pipelines",
        "27023 km mid- and low-pressure gas distribution pipelines ",
        "510 km oil"
    ],
    "ports_and_terminals": {
        "river port(s)": "Bratislava, Komarno (Danube)"
    },
    "waterways": "172 km",
    "number_of_airports": "35",
    "international_disputes": "bilateral government, legal, technical and economic working group negotiations continued between Slovakia and Hungary over Hungary's completion of its portion of the Gabcikovo-Nagymaros hydroelectric dam project along the Danube; as a member state that forms part of the EU's external border, Slovakia has implemented strict Schengen border rules",
    "terrorism": "None/Unknown"
}