{
    "id": "location--207",
    "name": "Ukraine",
    "background": "Ukraine was the center of the first eastern Slavic state, Kyivan Rus, which during the 10th and 11th centuries was the largest and most powerful state in Europe. Weakened by internecine quarrels and Mongol invasions, Kyivan Rus was incorporated into the Grand Duchy of Lithuania and eventually into the Polish-Lithuanian Commonwealth. The cultural and religious legacy of Kyivan Rus laid the foundation for Ukrainian nationalism through subsequent centuries. A new Ukrainian state, the Cossack Hetmanate, was established during the mid-17th century after an uprising against the Poles. Despite continuous Muscovite pressure, the Hetmanate managed to remain autonomous for well over 100 years. During the latter part of the 18th century, most Ukrainian ethnographic territory was absorbed by the Russian Empire. Following the collapse of czarist Russia in 1917, Ukraine achieved a short-lived period of independence (1917-20), but was reconquered and endured a brutal Soviet rule that engineered two forced famines (1921-22 and 1932-33) in which over 8 million died. In World War II, German and Soviet armies were responsible for 7 to 8 million more deaths. Although Ukraine achieved independence in 1991 with the dissolution of the USSR, democracy and prosperity remained elusive as the legacy of state control and endemic corruption stalled efforts at economic reform, privatization, and civil liberties.\nA peaceful mass protest referred to as the \"Orange Revolution\" in the closing months of 2004 forced the authorities to overturn a rigged presidential election and to allow a new internationally monitored vote that swept into power a reformist slate under Viktor YUSHCHENKO. Subsequent internal squabbles in the YUSHCHENKO camp allowed his rival Viktor YANUKOVYCH to stage a comeback in parliamentary (Rada) elections, become prime minister in August 2006, and be elected president in February 2010. In October 2012, Ukraine held Rada elections, widely criticized by Western observers as flawed due to use of government resources to favor ruling party candidates, interference with media access, and harassment of opposition candidates. President YANUKOVYCH's backtracking on a trade and cooperation agreement with the EU in November 2013 - in favor of closer economic ties with Russia - and subsequent use of force against students, civil society activists, and other civilians in favor of the agreement led to a three-month protest occupation of Kyiv's central square. The government's use of violence to break up the protest camp in February 2014 led to all out pitched battles, scores of deaths, international condemnation, a failed political deal, and the president's abrupt departure for Russia. New elections in the spring allowed pro-West president Petro POROSHENKO to assume office in June 2014; he was succeeded by Volodymyr ZELENSKY in May 2019.\nShortly after YANUKOVYCH's departure in late February 2014, Russian President PUTIN ordered the invasion of Ukraine's Crimean Peninsula falsely claiming the action was to protect ethnic Russians living there. Two weeks later, a \"referendum\" was held regarding the integration of Crimea into the Russian Federation. The \"referendum\" was condemned as illegitimate by the Ukrainian Government, the EU, the US, and the UN General Assembly (UNGA). In response to Russia's illegal annexation of Crimea, 100 members of the UN passed UNGA resolution 68/262, rejecting the \"referendum\" as baseless and invalid and confirming the sovereignty, political independence, unity, and territorial integrity of Ukraine. In mid-2014, Russia began supplying proxies in two of Ukraine's eastern provinces with manpower, funding, and materiel driving an armed conflict with the Ukrainian Government that continues to this day. Representatives from Ukraine, Russia, and the unrecognized Russian proxy republics signed the Minsk Protocol and Memorandum in September 2014 to end the conflict. However, this agreement failed to stop the fighting or find a political solution. In a renewed attempt to alleviate ongoing clashes, leaders of Ukraine, Russia, France, and Germany negotiated a follow-on Package of Measures in February 2015 to implement the Minsk agreements. Representatives from Ukraine, Russia, the unrecognized Russian proxy republics, and the Organization for Security and Cooperation in Europe also meet regularly to facilitate implementation of the peace deal. More than 13,000 civilians have been killed or wounded as a result of the Russian intervention in eastern Ukraine.",
    "coordinates": "49 00 N, 32 00 E",
    "region": "AsiaEurope",
    "total_area": "603,550 sq km",
    "land_area": "579,330 sq km",
    "water_area": "24,220 sq km",
    "land_boundary": "5,618 km",
    "neighbors": {
        "Hungary": "128 km",
        "Moldova": "1202 km",
        "Poland": "535 km",
        "Romania": "601 km",
        "Russia": "1944 km",
        "Slovakia": "97 km"
    },
    "climate": "temperate continental; Mediterranean only on the southern Crimean coast; precipitation disproportionately distributed, highest in west and north, lesser in east and southeast; winters vary from cool along the Black Sea to cold farther inland; warm summers across the greater part of the country, hot in the south",
    "coastline": "2,782 km",
    "natural_hazards": [
        "occasional floods",
        "occasional droughts"
    ],
    "terrain": "mostly fertile plains (steppes) and plateaus, with mountains found only in the west (the Carpathians) or in the extreme south of the Crimean Peninsula",
    "population_distribution": "densest settlement in the eastern (Donbas) and western regions; noteable concentrations in and around major urban areas of Kyiv, Kharkiv, Donets'k, Dnipropetrovs'k, and Odesa",
    "natural_resources": [
        "iron ore",
        "coal",
        "manganese",
        "natural gas",
        "oil",
        "salt",
        "sulfur",
        "graphite",
        "titanium",
        "magnesium",
        "kaolin",
        "nickel",
        "mercury",
        "timber",
        "arable land"
    ],
    "population": "43,922,939",
    "nationality": "Ukrainian(s)",
    "ethnic_groups": {
        "Ukrainian": "77.8%",
        "Russian": "17.3%",
        "Belarusian": "0.6%",
        "Moldovan": "0.5%",
        "Crimean Tatar": "0.5%",
        "Bulgarian": "0.4%",
        "Hungarian": "0.3%",
        "Romanian": "0.3%",
        "Polish": "0.3%",
        "Jewish": "0.2%",
        "other": "1.8%"
    },
    "languages": {
        "Ukrainian (official)": "67.5%",
        "Russian": "29.6%",
        "other": "2.9%"
    },
    "religions": [
        "Orthodox and the Ukrainian Orthodox - Moscow Patriarchate)",
        "Ukrainian Greek Catholic",
        "Roman Catholic",
        "Protestant",
        "Muslim",
        "Jewish"
    ],
    "government_type": "semi-presidential republic",
    "national_symbols": "tryzub (trident)",
    "national_colors": [
        "blue",
        "yellow"
    ],
    "gdp": "$112.1 billion",
    "agriculture": [
        "grain",
        "sugar beets",
        "sunflower seeds",
        "vegetables",
        "beef",
        "milk"
    ],
    "industries": [
        "coal",
        "electric power",
        "ferrous and nonferrous metals",
        "machinery and transport equipment",
        "chemicals",
        "food processing"
    ],
    "exports": [
        "ferrous and nonferrous metals",
        "fuel and petroleum products",
        "chemicals",
        "machinery and transport equipment",
        "foodstuffs"
    ],
    "imports": [
        "energy",
        "machinery and equipment",
        "chemicals"
    ],
    "broadband_subscriptions": "5,405,125",
    "internet_users": "25,883,509",
    "mobile_subscriptions": "53,933,592",
    "internet_country_code": ".ua",
    "military_and_security_forces": "Armed Forces of Ukraine (Zbroyni Syly Ukrayiny, ZSU): Ground Forces (Sukhoputni Viys’ka), Naval Forces (Viys’kovo-Mors’ki Syly, VMS), Air Forces (Povitryani Syly, PS), Air Assault Forces (Desantno-shturmovi Viyska, DShV);  Ministry of Internal Affairs: National Guard of Ukraine, State Border Guard Service of Ukraine (includes Maritime Border Guard)",
    "percent_GDP_on_military": "3.9%",
    "pipelines": [
        "36720 km gas",
        "4514 km oil",
        "4363 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Feodosiya (Theodosia), Illichivsk, Mariupol', Mykolayiv, Odesa, Yuzhnyy"
    },
    "waterways": "1,672 km",
    "number_of_airports": "187",
    "international_disputes": "1997 boundary delimitation treaty with Belarus remains unratified due to unresolved financial claims, stalling demarcation and reducing border security; delimitation of land boundary with Russia is complete and demarcation began in 2012; the dispute over the boundary between Russia and Ukraine through the Kerch Strait and Sea of Azov is suspended due to the occupation of Crimea by Russia; Ukraine and Moldova signed an agreement officially delimiting their border in 1999, but the border has not been demarcated due to Moldova's difficulties with the break-away region of Transnistria; Moldova and Ukraine operate joint customs posts to monitor transit of people and commodities through Moldova's Transnistria Region, which remains under the auspices of an Organization for Security and Cooperation in Europe-mandated peacekeeping mission comprised of Moldovan, Transnistrian, Russian, and Ukrainian troops; the ICJ ruled largely in favor of Romania in its dispute submitted in 2004 over Ukrainian-administered Zmiyinyy/Serpilor (Snake) Island and Black Sea maritime boundary delimitation; Romania opposes Ukraine's reopening of a navigation canal from the Danube border through Ukraine to the Black Sea",
    "terrorism": "None/Unknown"
}