{
    "id": "location--43",
    "name": "Colombia",
    "background": "Colombia was one of the three countries that emerged after the dissolution of Gran Colombia in 1830 (the others are Ecuador and Venezuela). A decades-long conflict between government forces, paramilitaries, and antigovernment insurgent groups heavily funded by the drug trade, principally the Revolutionary Armed Forces of Colombia (FARC), escalated during the 1990s. More than 31,000 former United Self Defense Forces of Colombia (AUC) paramilitaries demobilized by the end of 2006, and the AUC as a formal organization ceased to operate. In the wake of the paramilitary demobilization, illegal armed groups arose, whose members include some former paramilitaries. After four years of formal peace negotiations, the Colombian Government signed a final peace accord with the FARC in November 2016, which was subsequently ratified by the Colombian Congress. The accord calls for members of the FARC to demobilize, disarm, and reincorporate into society and politics. The accord also committed the Colombian Government to create three new institutions to form a 'comprehensive system for truth, justice, reparation, and non-repetition,' to include a truth commission, a special unit to coordinate the search for those who disappeared during the conflict, and a 'Special Jurisdiction for Peace' to administer justice for conflict-related crimes. The Colombian Government has stepped up efforts to expand its presence into every one of its administrative departments. Despite decades of internal conflict and drug-related security challenges, Colombia maintains relatively strong democratic institutions characterized by peaceful, transparent elections and the protection of civil liberties.",
    "coordinates": "4 00 N, 72 00 W",
    "region": "South America",
    "total_area": "1,138,910 sq km",
    "land_area": "1,038,700 sq km",
    "water_area": "100,210 sq km",
    "land_boundary": "6,672 km",
    "neighbors": {
        "Ecuador": "708 km",
        "Panama": "339 km",
        "Peru": "1494 km",
        "Venezuela": "2341 km"
    },
    "climate": "tropical along coast and eastern plains; cooler in highlands",
    "coastline": "3,208 km",
    "natural_hazards": [
        "highlands subject to volcanic eruptions",
        "occasional earthquakes",
        "periodic droughts",
        "volcanism: Galeras (4,276 m) is one of Colombia's most active volcanoes, having erupted in 2009 and 2010 causing major evacuations; it has been deemed a Decade Volcano by the International Association of Volcanology and Chemistry of the Earth's Interior, worthy of study due to its explosive history and close proximity to human populations; Nevado del Ruiz (5,321 m), 129 km (80 mi) west of Bogota, erupted in 1985 producing lahars (mudflows) that killed 23,000 people; the volcano last erupted in 1991; additionally, after 500 years of dormancy, Nevado del Huila reawakened in 2007 and has experienced frequent eruptions since then; other historically active volcanoes include Cumbal, Dona Juana, Nevado del Tolima, and Purace"
    ],
    "terrain": "flat coastal lowlands, central highlands, high Andes Mountains, eastern lowland plains (Llanos)",
    "population_distribution": "the majority of people live in the north and west where agricultural opportunities and natural resources are found; the vast grasslands of the llanos to the south and east, which make up approximately 60% of the country, are sparsely populated",
    "natural_resources": [
        "petroleum",
        "natural gas",
        "coal",
        "iron ore",
        "nickel",
        "gold",
        "copper",
        "emeralds",
        "hydropower"
    ],
    "population": "49,084,841",
    "nationality": "Colombian(s)",
    "ethnic_groups": {
        "mestizo and white": "87.6%",
        "Afro-Colombian": "6.8%",
        "Amerindian": "4.3%",
        "unspecified": "1.4%"
    },
    "languages": [
        "Spanish (official)"
    ],
    "religions": {
        "Roman Catholic": "79%",
        "Protestant": "14%",
        "other": "2%",
        "unspecified": "5%"
    },
    "government_type": "presidential republic",
    "national_symbol": "Andean condor",
    "national_colors": [
        "yellow",
        "blue",
        "red"
    ],
    "gdp": "$314.5 billion",
    "agriculture": [
        "coffee",
        "cut flowers",
        "bananas",
        "rice",
        "tobacco",
        "corn",
        "sugarcane",
        "cocoa beans",
        "oilseed",
        "vegetables",
        "shrimp",
        "forest products"
    ],
    "industries": [
        "textiles",
        "food processing",
        "oil",
        "clothing and footwear",
        "beverages",
        "chemicals",
        "cement",
        "gold",
        "coal",
        "emeralds"
    ],
    "exports": [
        "petroleum",
        "coal",
        "emeralds",
        "coffee",
        "nickel",
        "cut flowers",
        "bananas",
        "apparel"
    ],
    "imports": [
        "industrial equipment",
        "transportation equipment",
        "consumer goods",
        "chemicals",
        "paper products",
        "fuels",
        "electricity"
    ],
    "broadband_subscriptions": "6,678,543",
    "internet_users": "29,990,017",
    "mobile_subscriptions": "64,513,977",
    "internet_country_code": ".co",
    "military_and_security_forces": "Military Forces of Colombia (Fuerzas Militares de Colombia): National Army (Ejercito Nacional), Republic of Colombia Navy (Armada Republica de Colombia, ARC; includes Coast Guard), Colombian Air Force (Fuerza Aerea de Colombia, FAC); Colombian National Police (civilian force that is part of the Ministry of Defense)",
    "percent_GDP_on_military": "3.2%",
    "pipelines": [
        "4991 km gas",
        "6796 km oil",
        "3429 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Atlantic Ocean (Caribbean) - Cartagena, Santa Marta, Turbo",
        "oil terminal(s)": "Covenas offshore terminal",
        "container port(s) (TEUs)": "Cartagena (2,663,415)",
        "river port(s)": "Barranquilla (Rio Magdalena)",
        "dry bulk cargo port(s)": "Puerto Bolivar (coal)"
    },
    "waterways": "24,725 km",
    "number_of_airports": "836",
    "international_disputes": "in December 2007, ICJ allocated San Andres, Providencia, and Santa Catalina islands to Colombia under 1928 Treaty but did not rule on 82 degrees W meridian as maritime boundary with Nicaragua; managed dispute with Venezuela over maritime boundary and Venezuelan-administered Los Monjes Islands near the Gulf of Venezuela; Colombian-organized illegal narcotics, guerrilla, and paramilitary activities penetrate all neighboring borders and have caused Colombian citizens to flee mostly into neighboring countries; Colombia, Honduras, Nicaragua, Jamaica, and the US assert various claims to Bajo Nuevo and Serranilla Bank",
    "terrorism": "None/Unknown"
}