{
    "id": "location--80",
    "name": "Greenland",
    "background": "Greenland, the world's largest island, is about 80% ice-capped. Vikings reached the island in the 10th century from Iceland; Danish colonization began in the 18th century, and Greenland became an integral part of the Danish Realm in 1953. It joined the European Community (now the EU) with Denmark in 1973 but withdrew in 1985 over a dispute centered on stringent fishing quotas. Greenland remains a member of the Overseas Countries and Territories Association of the EU. Greenland was granted self-government in 1979 by the Danish parliament; the law went into effect the following year. Greenland voted in favor of increased self-rule in November 2008 and acquired greater responsibility for internal affairs when the Act on Greenland Self-Government was signed into law in June 2009. Denmark, however, continues to exercise control over several policy areas on behalf of Greenland, including foreign affairs, security, and financial policy in consultation with Greenland's Self-Rule Government.",
    "coordinates": "72 00 N, 40 00 W",
    "region": "Arctic Region",
    "total_area": "2,166,086 sq km",
    "land_area": "2,166,086 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "arctic to subarctic; cool summers, cold winters",
    "coastline": "44,087 km",
    "natural_hazards": [
        "continuous permafrost over northern two-thirds of the island"
    ],
    "terrain": "flat to gradually sloping icecap covers all but a narrow, mountainous, barren, rocky coast",
    "population_distribution": "settlement concentrated on the southwest shoreline, with limited settlements scattered along the remaining coast; interior is uninhabited",
    "natural_resources": [
        "coal",
        "iron ore",
        "lead",
        "zinc",
        "molybdenum",
        "diamonds",
        "gold",
        "platinum",
        "niobium",
        "tantalite",
        "uranium",
        "fish",
        "seals",
        "whales",
        "hydropower",
        "possible oil and gas"
    ],
    "population": "57,616",
    "nationality": "Greenlander(s)",
    "ethnic_groups": {
        "Greenlandic": "89.7%",
        "Danish": "7.8%",
        "other Nordic": "1.1%",
        "and other": "1.4%"
    },
    "languages": [
        "Greenlandic",
        "Danish",
        "English"
    ],
    "religions": [
        "Evangelical Lutheran",
        "traditional Inuit spiritual beliefs"
    ],
    "government_type": "parliamentary democracy (Parliament of Greenland or Inatsisartut)",
    "national_symbol": "polar bear",
    "national_colors": [
        "red",
        "white"
    ],
    "gdp": "$2.221 billion",
    "agriculture": [
        "sheep",
        "cattle",
        "reindeer",
        "fish",
        "shellfish"
    ],
    "industries": [
        "fish processing (mainly shrimp and Greenland halibut)",
        "anorthosite and ruby mining",
        "handicrafts",
        "hides and skins",
        "small shipyards"
    ],
    "exports": [
        "fish and fish products"
    ],
    "imports": [
        "machinery and transport equipment",
        "manufactured goods",
        "food",
        "petroleum products"
    ],
    "broadband_subscriptions": "13,192",
    "internet_users": "40,084",
    "mobile_subscriptions": "62,537",
    "internet_country_code": ".gl",
    "military_and_security_forces": "no regular military forces or conscription.",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Sisimiut"
    },
    "waterways": "Unknown",
    "number_of_airports": "15",
    "international_disputes": "managed dispute between Canada and Denmark over Hans Island in the Kennedy Channel between Canada's Ellesmere Island and Greenland; Denmark (Greenland) and Norway have made submissions to the Commission on the Limits of the Continental Shelf (CLCS) and Russia is collecting additional data to augment its 2001 CLCS submission",
    "terrorism": "None/Unknown"
}