{
    "id": "location--211",
    "name": "Uruguay",
    "background": "Montevideo, founded by the Spanish in 1726 as a military stronghold, soon took advantage of its natural harbor to become an important commercial center. Claimed by Argentina but annexed by Brazil in 1821, Uruguay declared its independence four years later and secured its freedom in 1828 after a three-year struggle. The administrations of President Jose BATLLE in the early 20th century launched widespread political, social, and economic reforms that established a statist tradition. A violent Marxist urban guerrilla movement named the Tupamaros, launched in the late 1960s, led Uruguay's president to cede control of the government to the military in 1973. By yearend, the rebels had been crushed, but the military continued to expand its hold over the government. Civilian rule was restored in 1985. In 2004, the left-of-center Frente Amplio Coalition won national elections that effectively ended 170 years of political control previously held by the Colorado and National (Blanco) parties. Uruguay's political and labor conditions are among the freest on the continent.",
    "coordinates": "33 00 S, 56 00 W",
    "region": "South America",
    "total_area": "176,215 sq km",
    "land_area": "175,015 sq km",
    "water_area": "1,200 sq km",
    "land_boundary": "1,591 km",
    "neighbors": {
        "Brazil": "1050 km"
    },
    "climate": "warm temperate; freezing temperatures almost unknown",
    "coastline": "660 km",
    "natural_hazards": [
        "seasonally high winds (the pampero is a chilly and occasional violent wind that blows north from the Argentine pampas), droughts, floods",
        "because of the absence of mountains, which act as weather barriers, all locations are particularly vulnerable to rapid changes from weather fronts"
    ],
    "terrain": "mostly rolling plains and low hills; fertile coastal lowland",
    "population_distribution": "most of the country's population resides in the southern half of the country; approximately 80% of the populace is urban, living in towns or cities; nearly half of the population lives in and around the capital of Montevideo",
    "natural_resources": [
        "arable land",
        "hydropower",
        "minor minerals",
        "fish"
    ],
    "population": "3,387,605",
    "nationality": "Uruguayan(s)",
    "ethnic_groups": {
        "white": "87.7%",
        "black": "4.6%",
        "indigenous": "2.4%",
        "other": "0.3%",
        "none or unspecified": "5%"
    },
    "languages": [
        "Spanish (official)"
    ],
    "religions": {
        "Roman Catholic": "47.1%",
        "non-Catholic Christians": "11.1%",
        "nondenominational": "23.2%",
        "Jewish": "0.3%",
        "atheist or agnostic": "17.2%",
        "other": "1.1%"
    },
    "government_type": "presidential republic",
    "national_symbols": "Sun of May (a sun-with-face symbol)",
    "national_colors": [
        "blue",
        "white",
        "yellow"
    ],
    "gdp": "$59.18 billion",
    "agriculture": [
        "Cellulose",
        "beef",
        "soybeans",
        "rice",
        "wheat",
        "dairy products",
        "fish",
        "lumber",
        "tobacco",
        "wine"
    ],
    "industries": [
        "food processing",
        "electrical machinery",
        "transportation equipment",
        "petroleum products",
        "textiles",
        "chemicals",
        "beverages"
    ],
    "exports": [
        "beef",
        "soybeans",
        "cellulose",
        "rice",
        "wheat",
        "wood",
        "dairy products",
        "wool"
    ],
    "imports": [
        "refined oil",
        "crude oil",
        "passenger and other transportation vehicles",
        "vehicle parts",
        "cellular phones"
    ],
    "broadband_subscriptions": "977,390",
    "internet_users": "2,300,557",
    "mobile_subscriptions": "5,170,624",
    "internet_country_code": ".uy",
    "military_and_security_forces": "Armed Forces of Uruguay (Fuerzas Armadas del Uruguay): National Army (Ejercito Nacional), National Navy (Armada Nacional, includes Maritime National Prefecture (Coast Guard)), Uruguayan Air Force (Fuerza Aerea); Guardia Nacional Republicana (paramilitary regiment of the National Police)",
    "percent_GDP_on_military": "2%",
    "pipelines": [
        "257 km gas",
        "160 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Montevideo"
    },
    "waterways": "1,600 km",
    "number_of_airports": "133",
    "international_disputes": "in 2010, the ICJ ruled in favor of Uruguay's operation of two paper mills on the Uruguay River, which forms the border with Argentina; the two countries formed a joint pollution monitoring regime; uncontested boundary dispute between Brazil and Uruguay over Braziliera/Brasiliera Island in the Quarai/Cuareim River leaves the tripoint with Argentina in question; smuggling of firearms and narcotics continues to be an issue along the Uruguay-Brazil border",
    "terrorism": "None/Unknown"
}