{
    "id": "location--45",
    "name": "Democratic Republic of the Congo",
    "background": "The Kingdom of Kongo ruled the area around the mouth of the Congo River from the 14th to 19th centuries. To the center and east, the Kingdoms of Luba and Lunda ruled from the 16th and 17th centuries to the 19th century. in the 1870s, European exploration of the Congo Basin, sponsored by King Leopold II of Belgium, eventually allowed the ruler to acquire rights to the Congo territory and to make it his private property under the name of the Congo Free State. During the Free State, the king's colonial military forced the local population to produce rubber. From 1885 to 1908, millions of Congolese people died as a result of disease and exploitation. International condemnation finally forced Leopold to cede the land to Belgium, creating the Belgian Congo.The Republic of the Congo gained its independence from Belgium in 1960, but its early years were marred by political and social instability. Col. Joseph MOBUTU seized power and declared himself president in a November 1965 coup. He subsequently changed his name - to MOBUTU Sese Seko - as well as that of the country - to Zaire. MOBUTU retained his position for 32 years through several sham elections, as well as through brutal force. Ethnic strife and civil war, touched off by a massive inflow of refugees in 1994 from conflict in Rwanda and Burundi, led in May 1997 to the toppling of the MOBUTU regime by a rebellion backed by Rwanda and Uganda and fronted by Laurent KABILA. KABILA renamed the country the Democratic Republic of the Congo (DRC), but in August 1998 his regime was itself challenged by a second insurrection again backed by Rwanda and Uganda. Troops from Angola, Chad, Namibia, Sudan, and Zimbabwe intervened to support KABILA's regime. In January 2001, KABILA was assassinated and his son, Joseph KABILA, was named head of state. In October 2002, the new president was successful in negotiating the withdrawal of Rwandan forces occupying the eastern DRC; two months later, the Pretoria Accord was signed by all remaining warring parties to end the fighting and establish a government of national unity. Presidential, National Assembly, and provincial legislatures took place in 2006, with Joseph KABILA elected to office.\nNational elections were held in November 2011 and disputed results allowed Joseph KABILA to be reelected to the presidency. While the DRC constitution barred President KABILA from running for a third term, the DRC Government delayed national elections originally slated for November 2016, to 30 December 2018. This failure to hold elections as scheduled fueled significant civil and political unrest, with sporadic street protests by KABILA's opponents and exacerbation of tensions in the tumultuous eastern DRC regions. Presidential, legislative, and provincial elections were held in late December 2018 and early 2019 across most of the country. The DRC Government canceled presidential elections in the cities of Beni and Butembo (citing concerns over an ongoing Ebola outbreak in the region) as well as Yumbi (which had recently experienced heavy violence).\nOpposition candidate Felix TSHISEKEDI was announced the election winner on 10 January 2019 and inaugurated two weeks later. This was the first transfer of power to an opposition candidate without significant violence or a coup since the DRC's independence. \nThe DRC, particularly in the East, continues to experience violence perpetrated by more than 100 armed groups active in the region, including the Allied Democratic Forces (ADF), the Democratic Forces for the Liberation of Rwanda (FDLR), and assorted Mai Mai militias. The UN Organization Stabilization Mission in the DRC (MONUSCO) has operated in the region since 1999 and is the largest and most expensive UN peacekeeping mission in the world.",
    "coordinates": "0 00 N, 25 00 E",
    "region": "Africa",
    "total_area": "2,344,858 sq km",
    "land_area": "2,267,048 sq km",
    "water_area": "77,810 sq km",
    "land_boundary": "10,481 km",
    "neighbors": {
        "Burundi": "236 km",
        "Central African Republic": "1747 km",
        "Republic of the Congo": "1229 km",
        "Rwanda": "221 km",
        "South Sudan": "714 km",
        "Tanzania": "479 km",
        "Uganda": "877 km",
        "Zambia": "2332 km"
    },
    "climate": "tropical; hot and humid in equatorial river basin; cooler and drier in southern highlands; cooler and wetter in eastern highlands; north of Equator - wet season (April to October), dry season (December to February); south of Equator - wet season (November to March), dry season (April to October)",
    "coastline": "37 km",
    "natural_hazards": [
        "periodic droughts in south",
        "Congo River floods (seasonal)",
        "active volcanoes in the east along the Great Rift Valley",
        "volcanism: Nyiragongo (3,470 m), which erupted in 2002 and is experiencing ongoing activity, poses a major threat to the city of Goma, home to a quarter million people; the volcano produces unusually fast-moving lava, known to travel up to 100 km /hr; Nyiragongo has been deemed a Decade Volcano by the International Association of Volcanology and Chemistry of the Earth's Interior, worthy of study due to its explosive history and close proximity to human populations; its neighbor, Nyamuragira, which erupted in 2010, is Africa's most active volcano; Visoke is the only other historically active volcano"
    ],
    "terrain": "vast central basin is a low-lying plateau; mountains in east",
    "population_distribution": "urban clusters are spread throughout the country, particularly in the northeast along the boarder with Uganda, Rwanda, and Burundi; the largest city is the capital, Kinshasha, located in the west along the Congo River; the south is least densely populated as shown in this population distribution map",
    "natural_resources": [
        "cobalt",
        "copper",
        "niobium",
        "tantalum",
        "petroleum",
        "industrial and gem diamonds",
        "gold",
        "silver",
        "zinc",
        "manganese",
        "tin",
        "uranium",
        "coal",
        "hydropower",
        "timber"
    ],
    "population": "101,780,263",
    "nationality": "Congolese (singular and plural)",
    "ethnic_groups": {
        "more than 200 African ethnic groups of which the majority are Bantu; the four largest tribes - Mongo": "",
        "Luba": "",
        "Kongo": "",
        "d the Mangbetu-Azande - make up about 45% of the": "population"
    },
    "languages": [
        "French (official)",
        "Lingala",
        "Kingwana",
        "Kikongo",
        "Tshiluba"
    ],
    "religions": {
        "Roman Catholic": "29.9%",
        "Protestant": "26.7%",
        "Kimbanguist": "2.8%",
        "other Christian": "36.5%",
        "Muslim": "1.3%",
        "other": "1.2%",
        "none": "1.3%",
        "unspecified": ".2%"
    },
    "government_type": "semi-presidential republic",
    "national_symbols": "leopard",
    "national_colors": [
        "sky blue",
        "red",
        "yellow"
    ],
    "gdp": "$41.44 billion",
    "agriculture": [
        "coffee",
        "sugar",
        "palm oil",
        "rubber",
        "tea",
        "cotton",
        "cocoa",
        "quinine",
        "cassava",
        "bananas",
        "plantains",
        "peanuts",
        "root crops",
        "corn",
        "fruits",
        "wood products"
    ],
    "industries": [
        "mining (copper, cobalt, gold, diamonds, coltan, zinc, tin, tungsten)",
        "mineral processing",
        "consumer products (textiles, plastics, footwear, cigarettes)",
        "metal products",
        "processed foods and beverages",
        "timber",
        "cement",
        "commercial ship repair"
    ],
    "exports": [
        "diamonds",
        "copper",
        "gold",
        "cobalt",
        "wood products",
        "crude oil",
        "coffee"
    ],
    "imports": [
        "foodstuffs",
        "mining and other machinery",
        "transport equipment",
        "fuels"
    ],
    "broadband_subscriptions": "4,620",
    "internet_users": "8,231,357",
    "mobile_subscriptions": "36,470,600",
    "internet_country_code": ".cd",
    "military_and_security_forces": "Armed Forces of the Democratic Republic of the Congo (Forces d'Armees de la Republique Democratique du Congo, FARDC): Land Forces, National Navy (La Marine Nationale), Congolese Air Force (Force Aerienne Congolaise, FAC); Republican Guard (responsible for presidential security)",
    "percent_GDP_on_military": "0.7%",
    "pipelines": [
        "62 km gas",
        "77 km oil",
        "756 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Banana",
        "river or lake port(s)": "Boma, Bumba, Kinshasa, Kisangani, Matadi, Mbandaka (Congo)"
    },
    "waterways": "15,000 km",
    "number_of_airports": "198",
    "international_disputes": "heads of the Great Lakes states and UN pledged in 2004 to abate tribal, rebel, and militia fighting in the region, including northeast Congo, where the UN Organization Mission in the Democratic Republic of the Congo (MONUC), organized in 1999, maintains over 16,500 uniformed peacekeepers; members of Uganda's Lord's Resistance Army forces continue to seek refuge in Congo's Garamba National Park as peace talks with the Uganda Government evolve; the location of the boundary in the broad Congo River with the Republic of the Congo is indefinite except in the Pool Malebo/Stanley Pool area; Uganda and DRC dispute Rukwanzi Island in Lake Albert and other areas on the Semliki River with hydrocarbon potential; boundary commission continues discussions over Congolese-administered triangle of land on the right bank of the Lunkinda River claimed by Zambia near the DRC village of Pweto; DRC accuses Angola of shifting monuments",
    "terrorism": "None/Unknown"
}