{
    "id": "location--106",
    "name": "Kenya",
    "background": "Founding president and liberation struggle icon Jomo KENYATTA led Kenya from independence in 1963 until his death in 1978, when Vice President Daniel Arap MOI took power in a constitutional succession. The country was a de facto one-party state from 1969 until 1982, after which time the ruling Kenya African National Union (KANU) changed the constitution to make itself the sole legal party in Kenya. MOI acceded to internal and external pressure for political liberalization in late 1991. The ethnically fractured opposition failed to dislodge KANU from power in elections in 1992 and 1997, which were marred by violence and fraud. President MOI stepped down in December 2002 following fair and peaceful elections. Mwai KIBAKI, running as the candidate of the multiethnic, united opposition group, the National Rainbow Coalition (NARC), defeated KANU candidate Uhuru KENYATTA, the son of founding president Jomo KENYATTA, and assumed the presidency following a campaign centered on an anticorruption platform.\nKIBAKI's reelection in December 2007 brought charges of vote rigging from Orange Democratic Movement (ODM) candidate Raila ODINGA and unleashed two months of violence in which approximately 1,100 people died. African Union-sponsored mediation led by former UN Secretary General Kofi ANNAN in late February 2008 resulted in a power-sharing accord bringing ODINGA into the government in the restored position of prime minister. The power sharing accord included a broad reform agenda, the centerpiece of which was constitutional reform. In August 2010, Kenyans overwhelmingly adopted a new constitution in a national referendum. The new constitution introduced additional checks and balances to executive power and devolved power and resources to 47 newly created counties. It also eliminated the position of prime minister. Uhuru KENYATTA won the first presidential election under the new constitution in March 2013, and was sworn into office the following month; he began a second term in November 2017 following a contentious, repeat election.",
    "coordinates": "1 00 N, 38 00 E",
    "region": "Africa",
    "total_area": "580,367 sq km",
    "land_area": "569,140 sq km",
    "water_area": "11,227 sq km",
    "land_boundary": "3,457 km",
    "neighbors": {
        "Somalia": "684 km",
        "South Sudan": "317 km",
        "Tanzania": "775 km",
        "Uganda": "814 km"
    },
    "climate": "varies from tropical along coast to arid in interior",
    "coastline": "536 km",
    "natural_hazards": [
        "recurring drought",
        "flooding during rainy seasons",
        "volcanism: limited volcanic activity; the Barrier (1,032 m) last erupted in 1921; South Island is the only other historically active volcano"
    ],
    "terrain": "low plains rise to central highlands bisected by Great Rift Valley; fertile plateau in west",
    "population_distribution": "population heavily concentrated in the west along the shore of Lake Victoria; other areas of high density include the capital of Nairobi, and in the southeast along the Indian Ocean coast as shown in this population distribution map",
    "natural_resources": [
        "limestone",
        "soda ash",
        "salt",
        "gemstones",
        "fluorspar",
        "zinc",
        "diatomite",
        "gypsum",
        "wildlife",
        "hydropower"
    ],
    "population": "53,527,936",
    "nationality": "Kenyan(s)",
    "ethnic_groups": {
        "Kikuyu": "17.1%",
        "Luhya": "14.3%",
        "Kalenjin": "13.4%",
        "Luo": "10.7%",
        "Kamba": "9.8%",
        "Somali": "5.8%",
        "Kisii": "5.7%",
        "Mijikenda": "5.2%",
        "Meru": "4.2%",
        "Maasai": "2.5%",
        "Turkana": "2.1%",
        "non-Kenyan": "1%",
        "other": "8.2%"
    },
    "languages": [
        "English (official)",
        "Kiswahili (official)",
        "numerous indigenous languages"
    ],
    "religions": {
        "Christian": "85.5%",
        "Muslim": "10.9%",
        "other": "1.8%",
        "none": "1.6%",
        "don't know/no answer": "0.2%"
    },
    "government_type": "presidential republic",
    "national_symbol": "lion",
    "national_colors": [
        "black",
        "red",
        "green",
        "white"
    ],
    "gdp": "$79.22 billion",
    "agriculture": [
        "tea",
        "coffee",
        "corn",
        "wheat",
        "sugarcane",
        "fruit",
        "vegetables",
        "dairy products",
        "beef",
        "fish",
        "pork",
        "poultry",
        "eggs"
    ],
    "industries": [
        "small-scale consumer goods (plastic, furniture, batteries, textiles, clothing, soap, cigarettes, flour)",
        "agricultural products",
        "horticulture",
        "oil refining",
        "aluminum",
        "steel",
        "lead",
        "cement",
        "commercial ship repair",
        "tourism",
        "information technology"
    ],
    "exports": [
        "tea",
        "horticultural products",
        "coffee",
        "petroleum products",
        "fish",
        "cement",
        "apparel"
    ],
    "imports": [
        "machinery and transportation equipment",
        "oil",
        "petroleum products",
        "motor vehicles",
        "iron and steel",
        "resins and plastics"
    ],
    "broadband_subscriptions": "371,498",
    "internet_users": "9,129,243",
    "mobile_subscriptions": "49,501,430",
    "internet_country_code": ".ke",
    "military_and_security_forces": "Kenya Defence Forces: Kenya Army, Kenya Navy, Kenya Air Force",
    "percent_GDP_on_military": "1.3%",
    "pipelines": [
        "4 km oil",
        "1,432 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Kisumu, Mombasa",
        "LNG terminal(s) (import)": "Mombasa"
    },
    "waterways": "Unknown",
    "number_of_airports": "197",
    "international_disputes": "Kenya served as an important mediator in brokering Sudan's north-south separation in February 2005; as of March 2019, Kenya provides shelter to nearly 475,000 refugees and asylum seekers, including Ugandans who flee across the border periodically to seek protection from Lord's Resistance Army rebels; Kenya works hard to prevent the clan and militia fighting in Somalia from spreading across the border, which has long been open to nomadic pastoralists; the boundary that separates Kenya's and Sudan's sovereignty is unclear in the \"Ilemi Triangle,\" which Kenya has administered since colonial times; in 2018, Kenya signed an MoU with Uganda and South Sudan to help demarcate their borders",
    "terrorism": "None/Unknown"
}