{
    "id": "location--111",
    "name": "Kuwait",
    "background": "Kuwait has been ruled by the AL-SABAH dynasty since the 18th century. The threat of Ottoman invasion in 1899 prompted Amir Mubarak AL-SABAH to seek protection from Britain, ceding foreign and defense responsibility to Britain until 1961, when the country attained its independence. Kuwait was attacked and overrun by Iraq in August 1990. Following several weeks of aerial bombardment, a US-led UN coalition began a ground assault in February 1991 that liberated Kuwait in four days. In 1992, the Amir reconstituted the parliament that he had dissolved in 1986. Amid the 2010-11 uprisings and protests across the Arab world, stateless Arabs, known as Bidoon, staged small protests in early 2011 demanding citizenship, jobs, and other benefits available to Kuwaiti nationals. Other demographic groups, notably Islamists and Kuwaitis from tribal backgrounds, soon joined the growing protest movements, which culminated in late 2011 with the resignation of the prime minister amidst allegations of corruption. Demonstrations renewed in late 2012 in response to an amiri decree amending the electoral law that lessened the voting power of the tribal blocs. An opposition coalition of Sunni Islamists, tribal populists, and some liberals, largely boycotted legislative elections in 2012 and 2013, which ushered in a legislature more amenable to the government's agenda. Faced with the prospect of painful subsidy cuts, oppositionists and independents actively participated in the November 2016 election, winning nearly half of the seats but a cohesive opposition alliance largely ceased to exist with the 2016 election and the opposition became increasingly factionalized. Since coming to power in 2006, the Amir has dissolved the National Assembly on seven occasions (the Constitutional Court annulled the Assembly elections in June 2012 and again in June 2013) and shuffled the cabinet over a dozen times, usually citing political stagnation and gridlock between the legislature and the government.",
    "coordinates": "29 30 N, 45 45 E",
    "region": "Middle East",
    "total_area": "17,818 sq km",
    "land_area": "17,818 sq km",
    "water_area": "0 sq km",
    "land_boundary": "475 km",
    "neighbors": {
        "Saudi Arabia": "221 km"
    },
    "climate": "dry desert; intensely hot summers; short, cool winters",
    "coastline": "499 km",
    "natural_hazards": [
        "sudden cloudbursts are common from October to April and bring heavy rain, which can damage roads and houses",
        "sandstorms and dust storms occur throughout the year but are most common between March and August"
    ],
    "terrain": "flat to slightly undulating desert plain",
    "population_distribution": "densest settlement is along the Persian Gulf, particularly in Kuwait City and on Bubiyan Island; significant population threads extend south and west along highways that radiate from the capital, particularly in the southern half of the country",
    "natural_resources": [
        "petroleum",
        "fish",
        "shrimp",
        "natural gas"
    ],
    "population": "2,993,706",
    "nationality": "Kuwaiti(s)",
    "ethnic_groups": {
        "Kuwaiti": "30.4%",
        "other Arab": "27.4%",
        "Asian": "40.3%",
        "African": "1%",
        "other": ".9%"
    },
    "languages": [
        "Arabic (official)",
        "English  widely spoken"
    ],
    "religions": {
        "Muslim": "74.6%",
        "Christian": "18.2%",
        "other and unspecified": "7.2%"
    },
    "government_type": "constitutional monarchy (emirate)",
    "national_symbols": "golden falcon",
    "national_colors": [
        "green",
        "white",
        "red",
        "black"
    ],
    "gdp": "$120.7 billion",
    "agriculture": [
        "fish"
    ],
    "industries": [
        "petroleum",
        "petrochemicals",
        "cement",
        "shipbuilding and repair",
        "water desalination",
        "food processing",
        "construction materials"
    ],
    "exports": [
        "oil and refined products",
        "fertilizers"
    ],
    "imports": [
        "food",
        "construction materials",
        "vehicles and parts",
        "clothing"
    ],
    "broadband_subscriptions": "103,821",
    "internet_users": "2,904,801",
    "mobile_subscriptions": "7,099,848",
    "internet_country_code": ".kw",
    "military_and_security_forces": "Kuwaiti Armed Forces: Kuwaiti Land Forces (KLF), Kuwaiti Navy, Kuwaiti Air Force (Al-Quwwat al-Jawwiya al-Kuwaitiya; includes Kuwaiti Air Defense Force, KADF), 25th Commando Brigade, and the Kuwait Emiri Guard Brigade; Kuwaiti National Guard (KNG); Coast Guard (Ministry of Interior)",
    "percent_GDP_on_military": "5.6%",
    "pipelines": [
        "261 km gas",
        "540 km oil",
        "57 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Ash Shu'aybah, Ash Shuwaykh, Az Zawr (Mina' Sa'ud), Mina' 'Abd Allah, Mina' al Ahmadi"
    },
    "waterways": "Unknown",
    "number_of_airports": "7",
    "international_disputes": "Kuwait and Saudi Arabia continue negotiating a joint maritime boundary with Iran; no maritime boundary exists with Iraq in the Persian Gulf",
    "terrorism": "None/Unknown"
}