{
    "name": "Maldives",
    "background": "A sultanate since the 12th century, the Maldives became a British protectorate in 1887. The islands became a republic in 1968, three years after independence. President Maumoon Abdul GAYOOM dominated Maldives' political scene for 30 years, elected to six successive terms by single-party referendums. Following political demonstrations in the capital Male in August 2003, GAYOOM and his government pledged to embark upon a process of liberalization and democratic reforms, including a more representative political system and expanded political freedoms. Political parties were legalized in 2005.\nIn June 2008, a constituent assembly - termed the \"Special Majlis\" - finalized a new constitution ratified by GAYOOM in August 2008. The first-ever presidential elections under a multi-candidate, multi-party system were held in October 2008. GAYOOM was defeated in a runoff poll by Mohamed NASHEED, a political activist who had been jailed several years earlier by the GAYOOM regime. In early February 2012, after several weeks of street protests in response to his ordering the arrest of a top judge, NASHEED purportedly resigned the presidency and handed over power to Vice President Mohammed WAHEED Hassan Maniku. A government-appointed Commission of National Inquiry concluded there was no evidence of a coup, but NASHEED contends that police and military personnel forced him to resign. NASHEED, WAHEED, and Abdulla YAMEEN Abdul Gayoom ran in the 2013 elections with YAMEEN ultimately winning the presidency after three rounds of voting. As president, YAMEEN weakened democratic institutions, curtailed civil liberties, jailed his political opponents, restricted the press, and exerted control over the judiciary to strengthen his hold on power and limit dissent. In September 2018, YAMEEN lost his reelection bid to Ibrahim Mohamed SOLIH, a parliamentarian of the Maldivian Democratic Party (MDP), who had the support of a coalition of four parties that came together to defeat YAMEEN and restore democratic norms to Maldives. In April 2019, SOLIH's MDP won 65 of 87 seats in parliament.",
    "coordinates": "3 15 N, 73 00 E",
    "region": "Asia",
    "total_area": "298 sq km",
    "land_area": "298 sq km",
    "water_area": "0 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "tropical; hot, humid; dry, northeast monsoon (November to March); rainy, southwest monsoon (June to August)",
    "coastline": "644 km",
    "natural_hazards": [
        "tsunamis",
        "low elevation of islands makes them sensitive to sea level rise"
    ],
    "terrain": "flat, with white sandy beaches",
    "population_distribution": "about a third of the population lives in the centrally located capital city of Male and almost a tenth in southern Addu City; the remainder of the populace is spread over the 200 or so populated islands of the archipelago",
    "natural_resources": [
        "fish"
    ],
    "population": "391,904",
    "nationality": "Maldivian(s)",
    "ethnic_groups": [
        "homogeneous mixture of Sinhalese",
        "Dravidian",
        "Arab",
        "Australasian",
        "and African resulting from historical changes in regional hegemony over marine trade routes"
    ],
    "languages": [
        "Dhivehi (official)",
        "English"
    ],
    "religions": [
        "Sunni Muslim"
    ],
    "government_type": "presidential republic",
    "national_symbols": "coconut palm, yellowfin tuna",
    "national_colors": [
        "red",
        "green",
        "white"
    ],
    "gdp": "$4.505 billion",
    "agriculture": [
        "coconuts",
        "corn",
        "sweet potatoes",
        "fish"
    ],
    "industries": [
        "tourism",
        "fish processing",
        "shipping",
        "boat building",
        "coconut processing",
        "woven mats",
        "rope",
        "handicrafts",
        "coral and sand mining"
    ],
    "exports": [
        "fish"
    ],
    "imports": [
        "petroleum products",
        "clothing",
        "intermediate and capital goods"
    ],
    "broadband_subscriptions": "53,470",
    "internet_users": "232,210",
    "mobile_subscriptions": "857,934",
    "internet_country_code": ".mv",
    "military_and_security_forces": "the Republic of Maldives has no distinct army, navy, or air force but a single security unit called the Maldives National Defence Force (MNDF) comprised of ground forces, an air element, a coastguard, a presidential security division, and a special protection group",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Male"
    },
    "waterways": "Unknown",
    "number_of_airports": "9",
    "international_disputes": "none",
    "terrorism": "None/Unknown"
}