{
    "name": "Morocco",
    "background": "In 788, about a century after the Arab conquest of North Africa, a series of Moroccan Muslim dynasties began to rule in Morocco. In the 16th century, the Sa'adi monarchy, particularly under Ahmad al-MANSUR (1578-1603), repelled foreign invaders and inaugurated a golden age. The Alaouite Dynasty, to which the current Moroccan royal family belongs, dates from the 17th century. In 1860, Spain occupied northern Morocco and ushered in a half-century of trade rivalry among European powers that saw Morocco's sovereignty steadily erode; in 1912, the French imposed a protectorate over the country. A protracted independence struggle with France ended successfully in 1956. The internationalized city of Tangier and most Spanish possessions were turned over to the new country that same year. Sultan MOHAMMED V, the current monarch's grandfather, organized the new state as a constitutional monarchy and in 1957 assumed the title of king. Since Spain's 1976 withdrawal from what is today called Western Sahara, Morocco has extended its de facto administrative control to roughly 75% of this territory; however, the UN does not recognize Morocco as the administering power for Western Sahara. The UN since 1991 has monitored a cease-fire between Morocco and the Polisario Front - an organization advocating the territory's independence - and restarted negotiations over the status of the territory in December 2018.\nKing MOHAMMED VI in early 2011 responded to the spread of pro-democracy protests in the region by implementing a reform program that included a new constitution, passed by popular referendum in July 2011, under which some new powers were extended to parliament and the prime minister, but ultimate authority remains in the hands of the monarch. In November 2011, the Justice and Development Party (PJD) - a moderate Islamist party - won the largest number of seats in parliamentary elections, becoming the first Islamist party to lead the Moroccan Government. In September 2015, Morocco held its first direct elections for regional councils, one of the reforms included in the 2011 constitution. The PJD again won the largest number of seats in nationwide parliamentary elections in October 2016.",
    "coordinates": "32 00 N, 5 00 W",
    "region": "Africa",
    "total_area": "446,550 sq km",
    "land_area": "446,300 sq km",
    "water_area": "250 sq km",
    "land_boundary": "2,362.5 km",
    "neighbors": {
        "Western Sahara": "444 km",
        "Spain (Ceuta)": "8 km",
        "Spain (Melilla)": "10.5 km"
    },
    "climate": "Mediterranean, becoming more extreme in the interior",
    "coastline": "1,835 km",
    "natural_hazards": [
        "northern mountains geologically unstable and subject to earthquakes",
        "periodic droughts",
        "windstorms",
        "flash floods",
        "landslides"
    ],
    "terrain": "mountainous northern coast (Rif Mountains) and interior (Atlas Mountains) bordered by large plateaus with intermontane valleys, and fertile coastal plains",
    "population_distribution": "the highest population density is found along the Atlantic and Mediterranean coasts; a number of densely populated agglomerations are found scattered through the Atlas Mountains",
    "natural_resources": [
        "phosphates",
        "iron ore",
        "manganese",
        "lead",
        "zinc",
        "fish",
        "salt"
    ],
    "population": "35,561,654",
    "nationality": "Moroccan(s)",
    "ethnic_groups": {
        "Arab-Berber": "99%",
        "other": "1%"
    },
    "languages": {
        "Arabic (official)": "",
        "Berber languages": "",
        "Tachelhit": "",
        "Tarifit)": "",
        "French": ""
    },
    "religions": {
        "Muslim": "99%",
        "other 1%; note - Jewish about": "6,000"
    },
    "government_type": "parliamentary constitutional monarchy",
    "national_symbols": "pentacle symbol, lion",
    "national_colors": [
        "red",
        "green"
    ],
    "gdp": "$109.3 billion",
    "agriculture": [
        "barley",
        "wheat",
        "citrus fruits",
        "grapes",
        "vegetables",
        "olives",
        "livestock",
        "wine"
    ],
    "industries": [
        "automotive parts",
        "phosphate mining and processing",
        "aerospace",
        "food processing",
        "leather goods",
        "textiles",
        "construction",
        "energy",
        "tourism"
    ],
    "exports": [
        "clothing and textiles",
        "automobiles",
        "electric components",
        "inorganic chemicals",
        "transistors",
        "crude minerals",
        "fertilizers (including phosphates)",
        "petroleum products",
        "citrus fruits",
        "vegetables",
        "fish"
    ],
    "imports": [
        "crude petroleum",
        "textile fabric",
        "telecommunications equipment",
        "wheat",
        "gas and electricity",
        "transistors",
        "plastics"
    ],
    "broadband_subscriptions": "1,552,599",
    "internet_users": "19,611,643",
    "mobile_subscriptions": "44,737,885",
    "internet_country_code": ".ma",
    "military_and_security_forces": "Royal Armed Forces: Royal Moroccan Army, Royal Moroccan Navy (includes Coast Guard, marines), Royal Moroccan Air Force, Royal Morroccan Gendarmerie, Morroccan Royal Guard (provides security for the royal family; officially part of the Royal Army); Force Auxiliaire (a paramilitary force under the Ministry of Interior that supplements the military and the police as needed)",
    "percent_GDP_on_military": "3.1%",
    "pipelines": [
        "944 km gas",
        "270 km oil",
        "175 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Casablanca, Jorf Lasfar, Mohammedia, Safi, Tangier",
        "container port(s) (TEUs)": "Tangier (3,312,409)",
        "LNG terminal(s) (import)": "Jorf Lasfar"
    },
    "waterways": "Unknown",
    "number_of_airports": "55",
    "international_disputes": "claims and administers Western Sahara whose sovereignty remains unresolved; Morocco protests Spain's control over the coastal enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera, the islands of Penon de Alhucemas and Islas Chafarinas, and surrounding waters; both countries claim Isla Perejil (Leila Island); discussions have not progressed on a comprehensive maritime delimitation, setting limits on resource exploration and refugee interdiction, since Morocco's 2002 rejection of Spain's unilateral designation of a median line from the Canary Islands; Morocco serves as one of the primary launching areas of illegal migration into Spain from North Africa; Algeria's border with Morocco remains an irritant to bilateral relations, each nation accusing the other of harboring militants and arms smuggling; the National Liberation Front's assertions of a claim to Chirac Pastures in southeastern Morocco is a dormant dispute",
    "terrorism": "Unknown"
}