{
    "name": "Netherlands",
    "background": "The Dutch United Provinces declared their independence from Spain in 1579; during the 17th century, they became a leading seafaring and commercial power, with settlements and colonies around the world. After a 20-year French occupation, a Kingdom of the Netherlands was formed in 1815. In 1830, Belgium seceded and formed a separate kingdom. The Netherlands remained neutral in World War I, but suffered German invasion and occupation in World War II. A modern, industrialized nation, the Netherlands is also a large exporter of agricultural products. The country was a founding member of NATO and the EEC (now the EU) and participated in the introduction of the euro in 1999. In October 2010, the former Netherlands Antilles was dissolved and the three smallest islands - Bonaire, Sint Eustatius, and Saba - became special municipalities in the Netherlands administrative structure. The larger islands of Sint Maarten and Curacao joined the Netherlands and Aruba as constituent countries forming the Kingdom of the Netherlands.\nIn February 2018, the Sint Eustatius island council (governing body) was dissolved and replaced by a government commissioner to restore the integrity of public administration. According to the Dutch Government, the intervention will be as \"short as possible and as long as needed.\"",
    "coordinates": "52 30 N, 5 45 E",
    "region": "Europe",
    "total_area": "41,543 sq km",
    "land_area": "33,893 sq km",
    "water_area": "7,650 sq km",
    "land_boundary": "1,053 km",
    "neighbors": {
        "Germany": "575 km"
    },
    "climate": "temperate; marine; cool summers and mild winters",
    "coastline": "451 km",
    "natural_hazards": [
        "flooding",
        "volcanism: Mount Scenery (887 m), located on the island of Saba in the Caribbean, last erupted in 1640; Round Hill (601 m), a dormant volcano also known as The Quill, is located on the island of St. Eustatius in the Caribbean; these islands are at the northern end of the volcanic island arc of the Lesser Antilles that extends south to Grenada"
    ],
    "terrain": "mostly coastal lowland and reclaimed land (polders); some hills in southeast",
    "population_distribution": "an area known as the Randstad, anchored by the cities of Amsterdam, Rotterdam, the Hague, and Utrecht, is the most densely populated region; the north tends to be less dense, though sizeable communities can be found throughout the entire country",
    "natural_resources": [
        "natural gas",
        "petroleum",
        "peat",
        "limestone",
        "salt",
        "sand and gravel",
        "arable land"
    ],
    "population": "17,280,397",
    "nationality": "Dutchman(men), Dutchwoman(women)",
    "ethnic_groups": {
        "Dutch": "76.9%", 
        "EU": "6.4%", 
        "Turkish": "2.4%", 
        "Moroccan": "2.3%", 
        "Indonesian": "2.1%", 
        "German": "2.1%", 
        "Surinamese": "2%", 
        "Polish": "1%", 
        "other": "4.8%"
    },
    "languages": {
        "Dutch (official)": ""
    },
    "religions": {
        "Roman Catholic": "23.6%", 
        "Protestant": "14.9%", 
        "Muslim": "5.1%", 
        "other": "5.6%", 
        "none": "50.7%"},
    "government_type": "parliamentary constitutional monarchy; part of the Kingdom of the Netherlands",
    "national_symbols": "lion, tulip",
    "national_colors": ["orange"],
    "gdp": "$832.2 billion",
    "agriculture": [
        "vegetables",
        "ornamentals",
        "dairy",
        "poultry and livestock products",
        "propagation materials"
    ],
    "industries": [
        "agroindustries",
        "metal and engineering products",
        "electrical machinery and equipment",
        "chemicals",
        "petroleum",
        "construction",
        "microelectronics",
        "fishing"
    ],
    "exports": [
        "machinery and transport equipment",
        "chemicals",
        "mineral fuels",
        "food and livestock",
        "manufactured goods"
    ],
    "imports": [
        "machinery and transport equipment",
        "chemicals",
        "fuels",
        "foodstuffs",
        "clothing"
    ],
    "broadband_subscriptions": "7,406,700",
    "internet_users": "15,385,203",
    "mobile_subscriptions": "21,108,000",
    "internet_country_code": ".nl",
    "military_and_security_forces": "Royal Netherlands Army, Royal Netherlands Navy (includes Naval Air Service and Marine Corps), Royal Netherlands Air Force (Koninklijke Luchtmacht, KLu), Royal Netherlands Marechaussee (Gendarmerie)",
    "percent_GDP_on_military": "1.4%",
    "pipelines": [
        "14000 km gas",
        "2500 km oil and refined products",
        "3000 km chemicals"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "IJmuiden, Vlissingen",
        "container port(s) (TEUs)": "Rotterdam (13,734,000)",
        "LNG terminal(s) (import)": "Rotterdam",
        "river port(s)": "Amsterdam (Nordsee Kanaal); Moerdijk (Hollands Diep River); Rotterdam (Rhine River); Terneuzen (Western Scheldt River)"
    },
    "waterways": "6,237 km",
    "number_of_airports": "29",
    "international_disputes": "none"
}