{
    "name": "Niger",
    "background": "Niger became independent from France in 1960 and experienced single-party and military rule until 1991, when Gen. Ali SAIBOU was forced by public pressure to allow multiparty elections, which resulted in a democratic government in 1993. Political infighting brought the government to a standstill and in 1996 led to a coup by Col. Ibrahim BARE. In 1999, BARE was killed in a counter coup by military officers who restored democratic rule and held elections that brought Mamadou TANDJA to power in December of that year. TANDJA was reelected in 2004 and in 2009 spearheaded a constitutional amendment allowing him to extend his term as president. In February 2010, military officers led a coup that deposed TANDJA and suspended the constitution. ISSOUFOU Mahamadou was elected in April 2011 following the coup and reelected to a second term in early 2016. Niger is one of the poorest countries in the world with minimal government services and insufficient funds to develop its resource base, and is ranked last in the world on the United Nations Development Programme’s Human Development Index. The largely agrarian and subsistence-based economy is frequently disrupted by extended droughts common to the Sahel region of Africa. The Nigerien Government continues its attempts to diversify the economy through increased oil production and mining projects. A Tuareg rebellion emerged in 2007 and ended in 2009. Niger is facing increased security concerns on its borders from various external threats including insecurity in Libya, spillover from the conflict in Mali, and violent extremism in northeastern Nigeria.",
    "coordinates": "16 00 N, 8 00 E",
    "region": "Africa",
    "total_area": "1,267,000 sq km",
    "land_area": "1,266,700 sq km",
    "water_area": "300 sq km",
    "land_boundary": "5,834 km",
    "neighbors": {
        "Benin": "277 km",
        "Burkina Faso": "622 km",
        "Chad": "1196 km",
        "Libya": "342 km",
        "Mali": "838 km",
        "Nigeria": "1608 km"
    },
    "climate": "desert; mostly hot, dry, dusty; tropical in extreme south",
    "coastline": "0 km",
    "natural_hazards": [
        "recurring droughts"
    ],
    "terrain": "predominately desert plains and sand dunes; flat to rolling plains in south; hills in north",
    "population_distribution": "majority of the populace is located in the southernmost extreme of the country along the border with Nigeria and Benin",
    "natural_resources": [
        "uranium",
        "coal",
        "iron ore",
        "tin",
        "phosphates",
        "gold",
        "molybdenum",
        "gypsum",
        "salt",
        "petroleum"
    ],
    "population": "22,772,361",
    "nationality": "Nigerien(s)",
    "ethnic_groups": {
        "Hausa": "53.1%", 
        "Zarma/Songhai": "21.2%", 
        "Tuareg": "11%", 
        "Fulani (Peuhl)": "6.5%", 
        "Kanuri": "5.9%", 
        "Gurma": "0.8%", 
        "Arab": "0.4%", 
        "Tubu": "0.4%", 
        "other/unavailable": "0.9%"
    },
    "languages": {
        "French (official)": "",
        "Hausa": "",
        "Djerma": ""
    },
    "religions": {
        "Muslim": "99.3%", 
        "Christian": "0.3%", 
        "animist": "0.2%", 
        "none": "0.1%"},
    "government_type": "semi-presidential republic",
    "national_symbols": "zebu",
    "national_colors": ["orange", "white", "green"],
    "gdp": "$8.224 billion",
    "agriculture": [
        "cowpeas",
        "cotton",
        "peanuts",
        "millet",
        "sorghum",
        "cassava",
        "rice",
        "cattle",
        "sheep",
        "goats",
        "camels",
        "donkeys",
        "horses",
        "poultry"
    ],
    "industries": [
        "uranium mining",
        "petroleum",
        "cement",
        "brick",
        "soap",
        "textiles",
        "food processing",
        "chemicals",
        "slaughterhouses"
    ],
    "exports": [
        "uranium ore",
        "livestock",
        "cowpeas",
        "onions"
    ],
    "imports": [
        "foodstuffs",
        "machinery",
        "vehicles and parts",
        "petroleum",
        "cereals"
    ],
    "broadband_subscriptions": "8,650",
    "internet_users": "805,702",
    "mobile_subscriptions": "8,778,884",
    "internet_country_code": ".ne",
    "military_and_security_forces": "Nigerien Armed Forces (Forces Armees Nigeriennes, FAN): Army, Nigerien Air Force (Force Aerienne du Niger), Niger Gendarmerie (GN); Ministry of Interior: Niger National Guard (GNN)",
    "percent_GDP_on_military": "1.8%",
    "pipelines": [
        "464 km oil"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "300 km",
    "number_of_airports": "30",
    "international_disputes": "Libya claims about 25,000 sq km in a currently dormant dispute in the Tommo region; location of Benin-Niger-Nigeria tripoint is unresolved; only Nigeria and Cameroon have heeded the Lake Chad Commission's admonition to ratify the delimitation treaty that also includes the Chad-Niger and Niger-Nigeria boundaries; the dispute with Burkina Faso was referred to the ICJ in 2010"
}