{
    "name": "Peru",
    "background": "Ancient Peru was the seat of several prominent Andean civilizations, most notably that of the Incas whose empire was captured by Spanish conquistadors in 1533. Peru declared its independence in 1821, and remaining Spanish forces were defeated in 1824. After a dozen years of military rule, Peru returned to democratic leadership in 1980, but experienced economic problems and the growth of a violent insurgency. President Alberto FUJIMORI's election in 1990 ushered in a decade that saw a dramatic turnaround in the economy and significant progress in curtailing guerrilla activity. Nevertheless, the president's increasing reliance on authoritarian measures and an economic slump in the late 1990s generated mounting dissatisfaction with his regime, which led to his resignation in 2000. A caretaker government oversaw a new election in the spring of 2001, which installed Alejandro TOLEDO Manrique as the new head of government - Peru's first democratically elected president of indigenous ethnicity. The presidential election of 2006 saw the return of Alan GARCIA Perez who, after a disappointing presidential term from 1985 to 1990, oversaw a robust economic rebound. Former army officer Ollanta HUMALA Tasso was elected president in June 2011, and carried on the sound, market-oriented economic policies of the three preceding administrations. Poverty and unemployment levels have fallen dramatically in the last decade, and today Peru boasts one of the best performing economies in Latin America. Pedro Pablo KUCZYNSKI Godard won a very narrow presidential runoff election in June 2016. Facing impeachment after evidence surfaced of his involvement in a vote-buying scandal, President KUCZYNSKI offered his resignation on 21 March 2018. Two days later, First Vice President Martin Alberto VIZCARRA Cornejo was sworn in as president. On 30 September 2019, President VIZCARRA invoked his constitutional authority to dissolve Peru's Congress after months of battling with the body over anticorruption reforms. New congressional elections are scheduled for 26 January 2020.",
    "coordinates": "10 00 S, 76 00 W",
    "region": "South America",
    "total_area": "1,285,216 sq km",
    "land_area": "1,279,996 sq km",
    "water_area": "5,220 sq km",
    "land_boundary": "7,062 km",
    "neighbors": {
        "Brazil": "2659 km",
        "Chile": "168 km",
        "Colombia": "1494 km",
        "Ecuador": "1529 km"
    },
    "climate": "varies from tropical in east to dry desert in west; temperate to frigid in Andes",
    "coastline": "2,414 km",
    "natural_hazards": [
        "earthquakes", "tsunamis", "flooding", "landslides",
        "mild volcanic activity: volcanic activity in the Andes Mountains; Ubinas (5,672 m), which last erupted in 2009, is the country's most active volcano; other historically active volcanoes include El Misti, Huaynaputina, Sabancaya, and Yucamane"
    ],
    "terrain": "western coastal plain (costa), high and rugged Andes in center (sierra), eastern lowland jungle of Amazon Basin (selva)",
    "population_distribution": "approximately one-third of the population resides along the desert coastal belt in the west, with a strong focus on the capital city of Lima; the Andean highlands, or sierra, which is strongly identified with the country's Amerindian population, contains roughly half of the overall population; the eastern slopes of the Andes, and adjoining rainforest, are sparsely populated",
    "natural_resources": [
        "copper",
        "silver",
        "gold",
        "petroleum",
        "timber",
        "fish",
        "iron ore",
        "coal",
        "phosphate",
        "potash",
        "hydropower",
        "natural gas"
    ],
    "population": "31,914,989",
    "nationality": "Peruvian(s)",
    "ethnic_groups": {
        "mestizo (mixed Amerindian and white)":"60.2%", 
        "Amerindian":"25.8%",
        "white":"5.9%",
        "African descent":"3.6%",
        "other (includes Chinese and Japanese descent)":"1.2%",
        "unspecified":"3.3%"},
    "languages": {
        "Spanish (official)": "82.9%",
        "Quechua (official)": "13.6%",
        "Aymara (official)": "1.6%",
        "Ashaninka": "0.3%",
        "other native languages": "0.8%",
        "other": "0.2%",
        "none": "0.1%",
        "unspecified": "0.7%"
    },
    "religions": {
        "Roman Catholic": "60%", 
        "Christian": "14.6%", 
        "other": ".3%", 
        "none": "4%", 
        "unspecified": "21.1%"},
    "government_type": "presidential republic",
    "national_symbols": "vicuna (a camelid related to the llama)",
    "national_colors": ["red", "white"],
    "gdp": "$214.2 billion",
    "agriculture": [
        "artichokes",
        "asparagus",
        "avocados",
        "blueberries",
        "coffee",
        "cocoa",
        "cotton",
        "sugarcane",
        "rice",
        "potatoes",
        "corn",
        "plantains",
        "grapes",
        "oranges",
        "pineapples",
        "guavas",
        "bananas",
        "apples",
        "lemons",
        "pears",
        "coca",
        "tomatoes",
        "mangoes",
        "barley",
        "medicinal plants",
        "quinoa",
        "palm oil",
        "marigolds",
        "onions",
        "wheat",
        "dry beans",
        "poultry",
        "beef",
        "pork",
        "dairy products",
        "guinea pigs",
        "fish"
    ],
    "industries": [
        "mining and refining of minerals",
        "steel",
        "metal fabrication",
        "petroleum extraction and refining",
        "natural gas and natural gas liquefaction",
        "fishing and fish processing",
        "cement",
        "glass",
        "textiles",
        "clothing",
        "food processing",
        "beer",
        "soft drinks",
        "rubber",
        "machinery",
        "electrical machinery",
        "chemicals",
        "furniture"
    ],
    "exports": [
        "copper",
        "gold",
        "lead",
        "zinc",
        "tin",
        "iron ore",
        "molybdenum",
        "silver",
        "crude petroleum and petroleum products",
        "natural gas",
        "coffee",
        "asparagus and other vegetables",
        "fruit",
        "apparel and textiles",
        "fishmeal",
        "fish",
        "chemicals",
        "fabricated metal products and machinery",
        "alloys"
    ],
    "imports": [
        "petroleum and petroleum products",
        "chemicals",
        "plastics",
        "machinery",
        "vehicles",
        "TV sets",
        "power shovels",
        "front-end loaders",
        "telephones and telecommunication equipment",
        "iron and steel",
        "wheat",
        "corn",
        "soybean products",
        "paper",
        "cotton",
        "vaccines and medicines"
    ],
    "broadband_subscriptions": "2,310,217",
    "internet_users": "13,975,422",
    "mobile_subscriptions": "38,915,386",
    "internet_country_code": ".pe",
    "military_and_security_forces": "Joint Command of the Armed Forces of Peru: Peruvian Army (Ejercito del Peru), Peruvian Navy (Marina de Guerra del Peru, MGP, includes naval air, naval infantry, and Coast Guard), Air Force of Peru (Fuerza Aerea del Peru, FAP); Ministry of the Interior (Ministerio del Interior): Peruvian National Police (Policía Nacional del Perú, PNP)",
    "percent_GDP_on_military": "1.2%",
    "pipelines": [
        "786 km extra heavy crude",
        "1526 km gas",
        "679 km liquid petroleum gas",
        "1033 km oil",
        "15 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Callao, Matarani, Paita",
        "oil terminal(s)": "Conchan oil terminal, La Pampilla oil terminal",
        "container port(s) (TEUs)": "Callao (2,250,200)",
        "river port(s)": "Iquitos, Pucallpa, Yurimaguas (Amazon)"
    },
    "waterways": "8,808 km",
    "number_of_airports": "191",
    "international_disputes": "Chile and Ecuador rejected Peru's November 2005 unilateral legislation to shift the axis of their joint treaty-defined maritime boundaries along the parallels of latitude to equidistance lines which favor Peru; organized illegal narcotics operations in Colombia have penetrated Peru's shared border; Peru rejects Bolivia's claim to restore maritime access through a sovereign corridor through Chile along the Peruvian border"
}