{
    "name": "Saint Martin",
    "background": "Although sighted by Christopher COLUMBUS in 1493 and claimed for Spain, it was the Dutch who occupied the island in 1631 to exploit its salt deposits. The Spanish retook the island in 1633, but continued to be harassed by the Dutch. The Spanish finally relinquished Saint Martin to the French and Dutch, who divided it between themselves in 1648. Friction between the two sides caused the border to frequently fluctuate over the next two centuries, with the French eventually holding the greater portion of the island (about 61%). The cultivation of sugar cane introduced African slavery to the island in the late 18th century; the practice was not abolished until 1848. The island became a free port in 1939; the tourism industry was dramatically expanded during the 1970s and 1980s. In 2003, the populace of Saint Martin voted to secede from Guadeloupe and in 2007, the northern portion of the island became a French overseas collectivity. In 2010, the southern Dutch portion of the island became the independent nation of Sint Maarten within the Kingdom of the Netherlands. On 6 September 2017, Hurricane Irma passed over the island of Saint Martin causing extensive damage to roads, communications, electrical power, and housing; the UN estimated that 90% of the buildings were damaged or destroyed.",
    "coordinates": "18 05 N, 63 57 W",
    "region": "Central America and the Caribbean",
    "total_area": "54.4 sq km",
    "land_area": "54.4 sq km",
    "water_area": "",
    "land_boundary": "16 km",
    "neighbors": {},
    "climate": "temperature averages 27-29 degrees Celsius all year long; low humidity, gentle trade winds, brief, intense rain showers; hurricane season stretches from July to November",
    "coastline": "58.9 km",
    "natural_hazards": [
        "subject to hurricanes from July to November"
    ],
    "terrain": "Unknown",
    "population_distribution": "most of the population is found along the coast, with a largest concentrations around the capital Marigot, Orleans, and Grand-Case",
    "natural_resources": [
        "salt"
    ],
    "population": "32,556",
    "nationality": "Unknown",
    "ethnic_groups": {
        "other Creole": "",
        "black": "",
        "Guadeloupe Mestizo": "",
        "white": "",
        "East Indian": ""
    },
    "languages": {
        "French (official)": "",
        "English": "",
        "Dutch": "",
        "French Patois": "",
        "Spanish": "",
        "Papiamento": ""
    },
    "religions": {
        "Roman Catholic": "",
        "Jehovah's Witness": "",
        "Protestant": "",
        "Hindu": ""
    },
    "government_type": "parliamentary democracy (Territorial Council); overseas collectivity of France",
    "national_symbols": "brown pelican",
    "national_colors": [
        "cerulean blue",
        "gold",
        "black",
        "white"
    ],
    "gdp": "$0.5615 billion",
    "agriculture": "Unknown",
    "industries": [
        "tourism",
        "light industry and manufacturing",
        "heavy industry"
    ],
    "exports": "Unknown",
    "imports": [
        "crude petroleum",
        "food",
        "manufactured items"
    ],
    "broadband_subscriptions": "Unknown",
    "internet_users": "1,100",
    "mobile_subscriptions": "Unknown",
    "internet_country_code": ".mf; note - .gp, the Internet country code for Guadeloupe, and .fr, the Internet country code for France, might also be encountered",
    "military_and_security_forces": "Unknown",
    "percent_GDP_on_military": "Unknown",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "Unknown",
    "number_of_airports": "1",
    "international_disputes": "Unknown",
    "terrorism": "Unknown"
}