{
    "name": "Saudi Arabia",
    "background": "Saudi Arabia is the birthplace of Islam and home to Islam's two holiest shrines in Mecca and Medina. The king's official title is the Custodian of the Two Holy Mosques. The modern Saudi state was founded in 1932 by ABD AL-AZIZ bin Abd al-Rahman Al SAUD (Ibn Saud) after a 30-year campaign to unify most of the Arabian Peninsula. One of his male descendants rules the country today, as required by the country's 1992 Basic Law. Following Iraq's invasion of Kuwait in 1990, Saudi Arabia accepted the Kuwaiti royal family and 400,000 refugees while allowing Western and Arab troops to deploy on its soil for the liberation of Kuwait the following year. The continuing presence of foreign troops on Saudi soil after the liberation of Kuwait became a source of tension between the royal family and the public until all operational US troops left the country in 2003. Major terrorist attacks in May and November 2003 spurred a strong ongoing campaign against domestic terrorism and extremism. US troops returned to the Kingdom in October 2019 after attacks on Saudi oil infrastructure.\nFrom 2005 to 2015, King ABDALLAH bin Abd al-Aziz Al Saud incrementally modernized the Kingdom. Driven by personal ideology and political pragmatism, he introduced a series of social and economic initiatives, including expanding employment and social opportunities for women, attracting foreign investment, increasing the role of the private sector in the economy, and discouraging businesses from hiring foreign workers. These reforms have accelerated under King SALMAN bin Abd al-Aziz, who ascended to the throne in 2015, and has since lifted the Kingdom's ban on women driving and allowed cinemas to operate for the first time in decades. Saudi Arabia saw some protests during the 2011 Arab Spring but not the level of bloodshed seen in protests elsewhere in the region. Shia Muslims in the Eastern Province protested primarily against the detention of political prisoners, endemic discrimination, and Bahraini and Saudi Government actions in Bahrain. Riyadh took a cautious but firm approach by arresting some protesters but releasing most of them quickly and by using its state-sponsored clerics to counter political and Islamist activism.\nThe government held its first-ever elections in 2005 and 2011, when Saudis went to the polls to elect municipal councilors. In December 2015, women were allowed to vote and stand as candidates for the first time in municipal council elections, with 19 women winning seats. After King SALMAN ascended to the throne in 2015, he placed the first next-generation prince, MUHAMMAD BIN NAYIF bin Abd al-Aziz Al Saud, in the line of succession as Crown Prince. He designated his son, MUHAMMAD BIN SALMAN bin Abd al-Aziz Al Saud, as the Deputy Crown Prince. In March 2015, Saudi Arabia led a coalition of 10 countries in a military campaign to restore the legitimate government of Yemen, which had been ousted by Huthi forces allied with former president ALI ABDULLAH al-Salih. The war in Yemen has drawn international criticism for civilian casualties and its effect on the country’s dire humanitarian situation. In December 2015, then Deputy Crown Prince MUHAMMAD BIN SALMAN announced Saudi Arabia would lead a 34-nation Islamic Coalition to fight terrorism (it has since grown to 41 nations). In May 2017, Saudi Arabia inaugurated the Global Center for Combatting Extremist Ideology (also known as \"Etidal\") as part of its ongoing efforts to counter violent extremism. In June 2017, King SALMAN elevated MUHAMMAD BIN SALMAN to Crown Prince.\nThe country remains a leading producer of oil and natural gas and holds about 16% of the world's proven oil reserves as of 2015. The government continues to pursue economic reform and diversification, particularly since Saudi Arabia's accession to the WTO in 2005, and promotes foreign investment in the Kingdom. In April 2016, the Saudi Government announced a broad set of socio-economic reforms, known as Vision 2030. Low global oil prices throughout 2015 and 2016 significantly lowered Saudi Arabia’s governmental revenue. In response, the government cut subsidies on water, electricity, and gasoline; reduced government employee compensation packages; and announced limited new land taxes. In coordination with OPEC and some key non-OPEC countries, Saudi Arabia agreed cut oil output in early 2017 to regulate supply and help elevate global prices.",
    "coordinates": "25 00 N, 45 00 E",
    "region": "Middle East",
    "total_area": "2,149,690 sq km",
    "land_area": "2,149,690 sq km",
    "water_area": "0 sq km",
    "land_boundary": "4,272 km",
    "neighbors": {
        "Jordan": "731 km",
        "Kuwait": "221 km",
        "Oman": "658 km",
        "Qatar": "87 km",
        "UAE": "457 km",
        "Yemen": "1307 km"
    },
    "climate": "harsh, dry desert with great temperature extremes",
    "coastline": "2,640 km",
    "natural_hazards": [
        "frequent sand and dust storms",
        "volcanism: despite many volcanic formations, there has been little activity in the past few centuries; volcanoes include Harrat Rahat, Harrat Khaybar, Harrat Lunayyir, and Jabal Yar"
    ],
    "terrain": "mostly sandy desert",
    "population_distribution": "historically a population that was mostly nomadic or semi-nomadic, the Saudi population has become more settled since petroleum was discovered in the 1930s; most of the economic activities - and with it the country's population - is concentrated in a wide area across the middle of the peninsula, from Ad Dammam in the east, through Riyadh in the interior, to Mecca-Medina in the west near the Red Sea",
    "natural_resources": [
        "petroleum",
        "natural gas",
        "iron ore",
        "gold",
        "copper"
    ],
    "population": "34,173,498",
    "nationality": "Saudi(s)",
    "ethnic_groups": {"Arab": "90%", "Afro-Asian": "10%"},
    "languages": {
        "Arabic (official)": ""
    },
    "religions": {
        "Muslim (official)":"", 
        "other":""},
    "government_type": "absolute monarchy",
    "national_symbols": "palm tree surmounting two crossed swords",
    "national_colors": ["green", "white"],
    "gdp": "$686.7 billion",
    "agriculture": [
        "wheat",
        "barley",
        "tomatoes",
        "melons",
        "dates",
        "citrus",
        "mutton",
        "chickens",
        "eggs",
        "milk"
    ],
    "industries": [
        "crude oil production",
        "petroleum refining",
        "basic petrochemicals",
        "ammonia",
        "industrial gases",
        "sodium hydroxide (caustic soda)",
        "cement",
        "fertilizer",
        "plastics",
        "metals",
        "commercial ship repair",
        "commercial aircraft repair",
        "construction"
    ],
    "exports": [
        "petroleum and petroleum products"
    ],
    "imports": [
        "machinery and equipment",
        "foodstuffs",
        "chemicals",
        "motor vehicles",
        "textiles"
    ],
    "broadband_subscriptions": "6,821,873",
    "internet_users": "20,768,456",
    "mobile_subscriptions": "41,310,584",
    "internet_country_code": ".sa",
    "military_and_security_forces": "Ministry of Defense: Royal Saudi Land Forces, Royal Saudi Naval Forces (includes marines, special forces, naval aviation), Royal Saudi Air Force, Royal Saudi Air Defense Forces, Royal Saudi Strategic Missiles Force; Ministry of the National Guard (SANG); Ministry of Interior: Border Guard, Facilities Security Force",
    "percent_GDP_on_military": "8%",
    "pipelines": [
        "209 km condensate",
        "2940 km gas",
        "1183 km liquid petroleum gas",
        "5117 km oil",
        "1151 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Ad Dammam, Al Jubayl, Jeddah, King Abdulla, Yanbu'",
        "container port(s) (TEUs)": "Ad Dammam (1,582,388), Jeddah (4,150,000), King Abdulla (1,695,322)"
    },
    "waterways": "Unknown",
    "number_of_airports": "214",
    "international_disputes": "Saudi Arabia has reinforced its concrete-filled security barrier along sections of the now fully demarcated border with Yemen to stem illegal cross-border activities; Kuwait and Saudi Arabia continue discussions on a maritime boundary with Iran; Saudi Arabia claims Egyptian-administered islands of Tiran and Sanafir"
}