{
    "name": "Senegal",
    "background": "The French colonies of Senegal and French Sudan were merged in 1959 and granted independence in 1960 as the Mali Federation. The union broke up after only a few months. Senegal joined with The Gambia to form the nominal confederation of Senegambia in 1982. The envisaged integration of the two countries was never implemented, and the union was dissolved in 1989. The Movement of Democratic Forces in the Casamance has led a low-level separatist insurgency in southern Senegal since the 1980s. Several attempts at reaching a comprehensive peace agreement have failed to resolve the conflict but, despite sporadic incidents of violence, an unofficial cease-fire has remained largely in effect since 2012. Senegal remains one of the most stable democracies in Africa and has a long history of participating in international peacekeeping and regional mediation. Senegal was ruled by the Socialist Party of Senegal, first under President Léopold Sédar SENGHOR, and then President Abdou DIOUF, for 40 years until Abdoulaye WADE was elected president in 2000. He was re-elected in 2007 and during his two terms amended Senegal's constitution over a dozen times to increase executive power and weaken the opposition. His decision to run for a third presidential term sparked a large public backlash that led to his defeat in a March 2012 runoff with Macky SALL. A 2016 constitutional referendum reduced the term to five years with a maximum of two consecutive terms for future presidents - the change did not apply to SALL's first term. SALL won his bid for re-election in February 2019; his term will end in 2024. A month after the election, the National Assembly voted to abolish the office of the prime minister. Opposition organizations and civil society have criticized the decision as a further concentration of power in the executive branch at the expense of the legislative and judicial branches.",
    "coordinates": "14 00 N, 14 00 W",
    "region": "Africa",
    "total_area": "196,722 sq km",
    "land_area": "192,530 sq km",
    "water_area": "4,192 sq km",
    "land_boundary": "2,684 km",
    "neighbors": {
        "Guinea": "363 km",
        "Guinea-Bissau": "341 km",
        "Mali": "489 km",
        "Mauritania": "742 km"
    },
    "climate": "tropical; hot, humid; rainy season (May to November) has strong southeast winds; dry season (December to April) dominated by hot, dry, harmattan wind",
    "coastline": "531 km",
    "natural_hazards": [
        "lowlands seasonally flooded",
        "periodic droughts"
    ],
    "terrain": "generally low, rolling, plains rising to foothills in southeast",
    "population_distribution": "the population is concentrated in the west, with Dakar anchoring a well-defined core area; approximately 70% of the population is rural",
    "natural_resources": [
        "fish",
        "phosphates",
        "iron ore"
    ],
    "population": "15,736,368",
    "nationality": "Senegalese (singular and plural)",
    "ethnic_groups": {
        "Wolof": "37.1%",
        "Pular": "26.2%",
        "Serer": "17%",
        "Mandinka": "5.6%",
        "Jola": "4.5%",
        "Soninke": "1.4%",
        "other": "8.3%"
    },
    "languages": {
        "French (official)": "",
        "Wolof": "",
        "Pular": "",
        "Jola": "",
        "Mandinka": "",
        "Serer": "",
        "Soninke": ""
    },
    "religions": {
        "Muslim": "95.9%",
        "Christian": "4.1%"
    },
    "government_type": "presidential republic",
    "national_symbols": "lion",
    "national_colors": [
        "green",
        "yellow",
        "red"
    ],
    "gdp": "$21.11 billion",
    "agriculture": [
        "peanuts",
        "millet",
        "corn",
        "sorghum",
        "rice",
        "cotton",
        "tomatoes",
        "green vegetables",
        "cattle",
        "poultry",
        "pigs",
        "fish"
    ],
    "industries": [
        "agricultural and fish processing",
        "phosphate mining",
        "fertilizer production",
        "petroleum refining",
        "zircon",
        "gold mining",
        "construction materials",
        "ship construction and repair"
    ],
    "exports": [
        "fish",
        "groundnuts (peanuts)",
        "petroleum products",
        "phosphates",
        "cotton"
    ],
    "imports": [
        "food and beverages",
        "capital goods",
        "fuels"
    ],
    "broadband_subscriptions": "129,820",
    "internet_users": "3,675,209",
    "mobile_subscriptions": "16,559,942",
    "internet_country_code": ".sn",
    "military_and_security_forces": "Senegalese Armed Forces: Army, Senegalese National Navy (Marine Senegalaise, MNS), Senegalese Air Force (Armee de l'Air du Senegal), National Gendarmerie (includes Territorial and Mobile components)",
    "percent_GDP_on_military": "1.5%",
    "pipelines": [
        "43 km gas",
        "8 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Dakar"
    },
    "waterways": "1,000 km",
    "number_of_airports": "20",
    "international_disputes": "cross-border trafficking in persons, timber, wildlife, and cannabis; rebels from the Movement of Democratic Forces in the Casamance find refuge in Guinea-Bissau",
    "terrorism": "Unknown"
}