{
    "name": "Sierra Leone",
    "background": "The British set up a trading post near present-day Freetown in the 17th century. Originally, the trade involved timber and ivory, but later it expanded to slaves. Following the American Revolution, a colony was established in 1787 and Sierra Leone became a destination for resettling black loyalists who had originally been resettled in Nova Scotia. After the abolition of the slave trade in 1807, British crews delivered thousands of Africans liberated from illegal slave ships to Sierra Leone, particularly Freetown. The colony gradually expanded inland during the course of the 19th century; independence was attained in 1961. Democracy is slowly being reestablished after the civil war (1991-2002) that resulted in tens of thousands of deaths and the displacement of more than 2 million people (about one-third of the population). The military, which took over full responsibility for security following the departure of UN peacekeepers at the end of 2005, has developed as a guarantor of the country's stability; the armed forces remained on the sideline during the 2007, 2012, and 2018 national elections. In March 2014, the closure of the UN Integrated Peacebuilding Office in Sierra Leone marked the end of more than 15 years of peacekeeping and political operations in Sierra Leone. The government's stated priorities include free primary and secondary education, economic growth, accountable governance, health, and infrastructure.",
    "coordinates": "8 30 N, 11 30 W",
    "region": "Africa",
    "total_area": "71,740 sq km",
    "land_area": "71,620 sq km",
    "water_area": "120 sq km",
    "land_boundary": "1,093 km",
    "neighbors": {
        "Liberia": "299 km"
    },
    "climate": "tropical; hot, humid; summer rainy season (May to December); winter dry season (December to April)",
    "coastline": "402 km",
    "natural_hazards": [
        "dry, sand-laden harmattan winds blow from the Sahara (December to February)",
        "sandstorms, dust storms"
    ],
    "terrain": "coastal belt of mangrove swamps, wooded hill country, upland plateau, mountains in east",
    "population_distribution": "population clusters are found in the lower elevations of the south and west; the northern third of the country is less populated",
    "natural_resources": [
        "diamonds",
        "titanium ore",
        "bauxite",
        "iron ore",
        "gold",
        "chromite"
    ],
    "population": "6,624,933",
    "nationality": "Sierra Leonean(s)",
    "ethnic_groups": {
        "Temne": "35.5%",
        "Mende": "33.2%",
        "Limba": "6.4%",
        "Kono": "4.4%",
        "Fullah": "3.4%",
        "Loko": "2.9%",
        "Koranko": "2.8%",
        "Sherbro": "2.6%",
        "Mandingo": "2.4%",
        "Creole": "1.2%",
        "other Sierra Leone": "4.7%",
        "other foreign": "0.3%",
        "unspecified": "0.2%"
    },
    "languages": [
        "English (official)",
        "Mende",
        "Temne",
        "Krio"
    ],
    "religions": {
        "Muslim": "78.6%",
        "Christian": "20.8%",
        "other": "0.3%",
        "unspecified": "0.2%"
    },
    "government_type": "presidential republic",
    "national_symbols": "lion",
    "national_colors": [
        "green",
        "white",
        "blue"
    ],
    "gdp": "$3.612 billion",
    "agriculture": [
        "rice",
        "coffee",
        "cocoa",
        "palm kernels",
        "palm oil",
        "peanuts",
        "cashews",
        "poultry",
        "cattle",
        "sheep",
        "pigs",
        "fish"
    ],
    "industries": [
        "diamond mining",
        "iron ore",
        "rutile and bauxite mining",
        "small-scale manufacturing (beverages, textiles, footwear)"
    ],
    "exports": [
        "iron ore",
        "diamonds",
        "rutile",
        "cocoa",
        "coffee",
        "fish"
    ],
    "imports": [
        "foodstuffs",
        "machinery and equipment",
        "fuels and lubricants",
        "chemicals"
    ],
    "broadband_subscriptions": "Unknown",
    "internet_users": "708,615",
    "mobile_subscriptions": "6,279,270",
    "internet_country_code": ".sl",
    "military_and_security_forces": "Republic of Sierra Leone Armed Forces (RSLAF): Army (includes Maritime Wing and Air Wing)",
    "percent_GDP_on_military": "0.7%",
    "pipelines": [
        "Unknown"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Freetown, Pepel, Sherbro Islands"
    },
    "waterways": "800 km",
    "number_of_airports": "8",
    "international_disputes": "Sierra Leone opposes Guinean troops' continued occupation of Yenga, a small village on the Makona River that serves as a border with Guinea; Guinea's forces came to Yenga in the mid-1990s to help the Sierra Leonean military to suppress rebels and to secure their common border but have remained there even after both countries signed a 2005 agreement acknowledging that Yenga belonged to Sierra Leone; in 2012, the two sides signed a declaration to demilitarize the area",
    "terrorism": "None/Unknown"
}