{
    "name": "South Africa",
    "background": "Some of the earliest human remains in the fossil record are found in South Africa. By about A.D. 500, Bantu speaking groups began settling into what is now northeastern South Africa displacing Khoisan speaking groups to the southwest. Dutch traders landed at the southern tip of present-day South Africa in 1652 and established a stopover point on the spice route between the Netherlands and the Far East, founding the city of Cape Town. After the British seized the Cape of Good Hope area in 1806, many of the settlers of Dutch descent (Afrikaners, also called \"Boers\" (farmers) at the time) trekked north to found their own republics, Transvaal and Orange Free State. In the 1820s, several decades of wars began as the Zulus expanded their territory, moving out of what is today southeastern South Africa and clashing with other indigenous peoples and with expanding European settlements. The discovery of diamonds (1867) and gold (1886) spurred wealth and immigration from Europe.The Anglo-Zulu War (1879) resulted in the incorporation of the Zulu kingdom's territory into the British Empire. Subsequently, the Afrikaner republics were incorporated into the British Empire after their defeat in the Second South African War (1899-1902). However, the British and the Afrikaners ruled together beginning in 1910 under the Union of South Africa, which became a republic in 1961 after a whites-only referendum. In 1948, the National Party was voted into power and instituted a policy of apartheid – billed as \"separate development\" of the races - which favored the white minority at the expense of the black majority and other non-white groups. The African National Congress (ANC) led the opposition to apartheid and many top ANC leaders, such as Nelson MANDELA, spent decades in South Africa's prisons. Internal protests and insurgency, as well as boycotts by some Western nations and institutions, led to the regime's eventual willingness to negotiate a peaceful transition to majority rule.\nThe first multi-racial elections in 1994 following the end of apartheid ushered in majority rule under an ANC-led government. South Africa has since struggled to address apartheid-era imbalances in wealth, housing, education, and health care. Jacob ZUMA became president in 2009 and was reelected in 2014, but resigned in February 2018 after numerous corruption scandals and gains by opposition parties in municipal elections in 2016. His successor, Cyril RAMAPHOSA, has made some progress in reigning in corruption, though many challenges persist. In May 2019 national elections, the country’s sixth since the end of apartheid, the ANC won a majority of parliamentary seats, delivering RAMAPHOSA a five-year term.",
    "coordinates": "29 00 S, 24 00 E",
    "region": "Africa",
    "total_area": "1,219,090 sq km",
    "land_area": "1,214,470 sq km",
    "water_area": "4,620 sq km",
    "land_boundary": "5,244 km",
    "neighbors": {
        "Lesotho": "1106 km",
        "Mozambique": "496 km",
        "Namibia": "1005 km",
        "Eswatini": "438 km",
        "Zimbabwe": "230 km"
    },
    "climate": "mostly semiarid; subtropical along east coast; sunny days, cool nights",
    "coastline": "2,798 km",
    "natural_hazards": [
        "prolonged droughts",
        "volcanism: the volcano forming Marion Island in the Prince Edward Islands, which last erupted in 2004, is South Africa's only active volcano"
    ],
    "terrain": "vast interior plateau rimmed by rugged hills and narrow coastal plain",
    "population_distribution": "the population concentrated along the southern and southeastern coast, and inland around Pretoria; the eastern half of the country is more densly populated than the west",
    "natural_resources": [
        "gold",
        "chromium",
        "antimony",
        "coal",
        "iron ore",
        "manganese",
        "nickel",
        "phosphates",
        "tin",
        "rare earth elements",
        "uranium",
        "gem diamonds",
        "platinum",
        "copper",
        "vanadium",
        "salt",
        "natural gas"
    ],
    "population": "56,463,617",
    "nationality": "South African(s)",
    "ethnic_groups": {
        "black African": "80.9%", "colored": "8.8%", "white": "7.8%", 
        "Indian/Asian": "2.5%"},
    "languages": {
        "isiZulu (official)": "24.7%",
        "isiXhosa (official)": "15.6%",
        "Afrikaans (official)": "12.1%",
        "Sepedi (official)": "9.8%",
        "Setswana (official)": "8.9%",
        "English (official)": "8.4%",
        "Sesotho (official)": "8%",
        "Xitsonga (official)": "4%",
        "siSwati (official)": "2.6%",
        "Tshivenda (official)": "2.5%",
        "isiNdebele (official)": "1.6%",
        "other": "1.9%"
    },
    "religions": {
        "Christian": "86%", 
        "ancestral, tribal, animist, or other traditional African religions": "5.4%", 
        "Muslim": "1.9%", 
        "other": "1.5%", 
        "nothing in particular": "5.2%"},
    "government_type": "parliamentary republic",
    "national_symbols": "springbok (antelope), king protea flower",
    "national_colors": ["red", "green", "blue", "yellow", "black", "white"],
    "gdp": "$349.3 billion",
    "agriculture": [
        "corn",
        "wheat",
        "sugarcane",
        "fruits",
        "vegetables",
        "beef",
        "poultry",
        "mutton",
        "wool",
        "dairy products"
    ],
    "industries": [
        "mining (world's largest producer of platinum, gold, chromium)",
        "automobile assembly",
        "metalworking",
        "machinery",
        "textiles",
        "iron and steel",
        "chemicals",
        "fertilizer",
        "foodstuffs",
        "commercial ship repair"
    ],
    "exports": [
        "gold",
        "diamonds",
        "platinum",
        "other metals and minerals",
        "machinery and equipment"
    ],
    "imports": [
        "machinery and equipment",
        "chemicals",
        "petroleum products",
        "scientific instruments",
        "foodstuffs"
    ],
    "broadband_subscriptions": "1,107,013",
    "internet_users": "29,322,380",
    "mobile_subscriptions": "92,427,958",
    "internet_country_code": ".za",
    "military_and_security_forces": "South African National Defence Force (SANDF): South African Army (includes Reserve Force), South African Navy (SAN), South African Air Force (SAAF), South African Military Health Services",
    "pipelines": [
        "94 km condensate",
        "1293 km gas",
        "992 km oil",
        "1460 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Cape Town, Durban, Port Elizabeth, Richards Bay, Saldanha Bay",
        "container port(s) (TEUs)": "Durban (2,699,978)",
        "LNG terminal(s) (import)": "Mossel Bay"
    },
    "waterways": "Unknown",
    "number_of_airports": "407",
    "international_disputes": "South Africa has placed military units to assist police operations along the border of Lesotho, Zimbabwe, and Mozambique to control smuggling, poaching, and illegal migration; the governments of South Africa and Namibia have not signed or ratified the text of the 1994 Surveyor's General agreement placing the boundary in the middle of the Orange River"
}