{
    "name": "Taiwan",
    "background": "First inhabited by Austronesian people, Taiwan became home to Han immigrants beginning in the late Ming Dynasty (17th century). In 1895, military defeat forced China's Qing Dynasty to cede Taiwan to Japan, which then governed Taiwan for 50 years. Taiwan came under Chinese Nationalist (Kuomintang, KMT) control after World War II. With the communist victory in the Chinese civil war in 1949, the Nationalist-controlled Republic of China government and 2 million Nationalists fled to Taiwan and continued to claim to be the legitimate government for mainland China and Taiwan based on a 1947 Constitution drawn up for all of China. Until 1987, however, the Nationalist government ruled Taiwan under a civil war martial law declaration dating to 1948. Beginning in the 1970s, Nationalist authorities gradually began to incorporate the native population into the governing structure beyond the local level. The democratization process expanded rapidly in the 1980s, leading to the then illegal founding of Taiwan’s first opposition party (the Democratic Progressive Party or DPP) in 1986 and the lifting of martial law the following year. Taiwan held legislative elections in 1992, the first in over forty years, and its first direct presidential election in 1996. In the 2000 presidential elections, Taiwan underwent its first peaceful transfer of power with the KMT loss to the DPP and afterwards experienced two additional democratic transfers of power in 2008 and 2016. Throughout this period, the island prospered, became one of East Asia's economic \"Tigers,\" and after 2000 became a major investor in mainland China as cross-Strait ties matured. The dominant political issues continue to be economic reform and growth as well as management of sensitive relations between Taiwan and China.",
    "coordinates": "23 30 N, 121 00 E",
    "region": "Southeast Asia",
    "total_area": "35,980 sq km",
    "land_area": "32,260 sq km",
    "water_area": "3,720 sq km",
    "land_boundary": "0 km",
    "neighbors": "Unknown",
    "climate": "tropical; marine; rainy season during southwest monsoon (June to August); persistent and extensive cloudiness all year",
    "coastline": "1,566.3 km",
    "natural_hazards": [
        "earthquakes",
        "typhoons",
        "volcanism: Kueishantao Island (401 m), east of Taiwan, is its only historically active volcano, although it has not erupted in centuries"
    ],
    "terrain": "eastern two-thirds mostly rugged mountains; flat to gently rolling plains in west",
    "population_distribution": "distribution exhibits a peripheral coastal settlement pattern, with the largest populations on the north and west coasts",
    "natural_resources": [
        "small deposits of coal",
        "natural gas",
        "limestone",
        "marble",
        "asbestos",
        "arable land"
    ],
    "population": "23,603,049",
    "nationality": "Taiwan (singular and plural)",
    "ethnic_groups": {
        "Han Chinese":"95%", "indigenous Malayo-Polynesian peoples": "2.3%"},
    "languages": {
        "Mandarin Chinese (official)": "",
        "Taiwanese": "",
        "Hakka dialects": "",
        "approximately 16 indigenous languages": ""
    },
    "religions": {
        "Buddhist": "35.3%", 
        "Taoist": "33.2%", 
        "Christian": "3.9%", 
        "folk (includes Confucian) approximately": "10%", 
        "none or unspecified": "18.2%"},
    "government_type": "semi-presidential republic",
    "national_symbols": "white, 12-rayed sun on blue field",
    "national_colors": ["blue", "white", "red"],
    "gdp": "$572.6 billion",
    "agriculture": [
        "rice",
        "vegetables",
        "fruit",
        "tea",
        "flowers",
        "pigs",
        "poultry",
        "fish"
    ],
    "industries": [
        "electronics",
        "communications and information technology products",
        "petroleum refining",
        "chemicals",
        "textiles",
        "iron and steel",
        "machinery",
        "cement",
        "food processing",
        "vehicles",
        "consumer products",
        "pharmaceuticals"
    ],
    "exports": [
        "semiconductors",
        "petrochemicals",
        "automobile/auto parts",
        "ships",
        "wireless communication equipment",
        "flat display displays",
        "steel",
        "electronics",
        "plastics",
        "computers"
    ],
    "imports": [
        "oil/petroleum",
        "semiconductors",
        "natural gas",
        "coal",
        "steel",
        "computers",
        "wireless communication equipment",
        "automobiles",
        "fine chemicals",
        "textiles"
    ],
    "broadband_subscriptions": "5,725,022",
    "internet_users": "20,601,000",
    "mobile_subscriptions": "29,340,886",
    "internet_country_code": ".tw",
    "military_and_security_forces": "Republic of China Armed Forces: Republic of China Army, Republic of China Navy (includes Marine Corps), Republic of China Air Force, Military Police Command, Armed Forces Reserve Command; Taiwan Coast Guard Administration (a law enforcement organization with homeland security functions during peacetime and national defense missions during wartime)",
    "pipelines": [
        "25 km condensate",
        "2200 km gas",
        "13500 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Keelung (Chi-lung), Kaohsiung, Hualian, Taichung",
        "container port(s) (TEUs)": "Kaohsiung (10,271,018), Taichung (1,660,663), Taipei (1,561,743)",
        "LNG terminal(s) (import)": "Yung An (Kaohsiung), Taichung"
    },
    "waterways": "Unknown",
    "number_of_airports": "37",
    "international_disputes": "involved in complex dispute with Brunei, China, Malaysia, the Philippines, and Vietnam over the Spratly Islands, and with China and the Philippines over Scarborough Reef; the 2002 \"Declaration on the Conduct of Parties in the South China Sea\" has eased tensions but falls short of a legally binding \"code of conduct\" desired by several of the disputants; Paracel Islands are occupied by China, but claimed by Taiwan and Vietnam; in 2003, China and Taiwan became more vocal in rejecting both Japan's claims to the uninhabited islands of the Senkaku-shoto (Diaoyu Tai) and Japan's unilaterally declared exclusive economic zone in the East China Sea where all parties engage in hydrocarbon prospecting"
}