{
    "name": "Tajikistan",
    "background": "The Tajik people came under Russian imperial rule in the 1860s and 1870s, but Russia's hold on Central Asia weakened following the Revolution of 1917. At that time, bands of indigenous guerrillas (called \"basmachi\") fiercely contested Bolshevik control of the area, which was not fully reestablished until 1925. Tajikistan was first created as an autonomous republic within Uzbekistan in 1924, but in 1929 the USSR designated Tajikistan a separate republic and transferred to it much of present-day Sughd province. Ethnic Uzbeks form a substantial minority in Tajikistan, and ethnic Tajiks an even larger minority in Uzbekistan. Tajikistan became independent in 1991 following the breakup of the Soviet Union, and experienced a civil war between political, regional, and religious factions from 1992 to 1997.\nThough the country holds general elections for both the presidency (once every seven years) and parliament (once every five years), observers note an electoral system rife with irregularities and abuse, with results that are neither free nor fair. President Emomali RAHMON, who came to power in 1994 during the civil war, used an attack planned by a disaffected deputy defense minister in 2015 to ban the last major opposition political party in Tajikistan. In December 2015, RAHMON further strengthened his position by having himself declared \"Founder of Peace and National Unity, Leader of the Nation,\" with limitless terms and lifelong immunity through constitutional amendments ratified in a referendum. The referendum also lowered the minimum age required to run for president from 35 to 30, which would make RAHMON's son Rustam EMOMALI, the current mayor of the capital city of Dushanbe, eligible to run for president in 2020. The country remains the poorest in the former Soviet sphere. Tajikistan became a member of the WTO in March 2013. However, its economy continues to face major challenges, including dependence on remittances from Tajikistani migrant laborers working in Russia and Kazakhstan, pervasive corruption, and the opiate trade and other destabilizing violence emanating from neighboring Afghanistan. Tajikistan has endured several domestic security incidents since 2010, including armed conflict between government forces and local strongmen in the Rasht Valley and between government forces and criminal groups in Gorno-Badakhshan Autonomous Oblast. Tajikistan suffered its first ISIS-claimed attack in 2018, when assailants attacked a group of Western bicyclists with vehicles and knives, killing four.",
    "coordinates": "39 00 N, 71 00 E",
    "region": "Asia",
    "total_area": "144,100 sq km",
    "land_area": "141,510 sq km",
    "water_area": "2,590 sq km",
    "land_boundary": "4,130 km",
    "neighbors": {
        "China": "477 km",
        "Kyrgyzstan": "984 km",
        "Uzbekistan": "1312 km"
    },
    "climate": "mid-latitude continental, hot summers, mild winters; semiarid to polar in Pamir Mountains",
    "coastline": "0 km",
    "natural_hazards": [
        "earthquakes",
        "floods"
    ],
    "terrain": "mountainous region dominated by the Trans-Alay Range in the north and the Pamirs in the southeast; western Fergana Valley in north, Kofarnihon and Vakhsh Valleys in southwest",
    "population_distribution": "the country's population is concentrated at lower elevations, with perhaps as much as 90% of the people living in valleys; overall density increases from east to west",
    "natural_resources": [
        "hydropower",
        "some petroleum",
        "uranium",
        "mercury",
        "brown coal",
        "lead",
        "zinc",
        "antimony",
        "tungsten",
        "silver",
        "gold"
    ],
    "population": "8,873,669",
    "nationality": "Tajikistani(s)",
    "ethnic_groups": {
        "Tajik": "84.3%", "Uzbek": "13.8%", "other": "2%"},
    "languages": {
        "Tajik (official)": "84.4%",
        "Uzbek": "11.9%",
        "Kyrgyz": "0.8%",
        "Russian": "0.5%",
        "other": "2.4%"
    },
    "religions": {"Muslim": "98%", "other": "2%"},
    "government_type": "presidential republic",
    "national_symbols": "crown surmounted by an arc of seven, five-pointed stars; snow leopard",
    "national_colors": ["red", "white", "green"],
    "gdp": "$7.144 billion",
    "agriculture": [
        "cotton",
        "grain",
        "fruits",
        "grapes",
        "vegetables",
        "cattle",
        "sheep",
        "goats"
    ],
    "industries": [
        "aluminum",
        "cement",
        "coal",
        "gold",
        "silver",
        "antimony",
        "textile",
        "vegetable oil"
    ],
    "exports": [
        "aluminum",
        "electricity",
        "cotton",
        "fruits",
        "vegetable oil",
        "textiles"
    ],
    "imports": [
        "petroleum products",
        "aluminum oxide",
        "machinery and equipment",
        "foodstuffs"
    ],
    "broadband_subscriptions": "6,000",
    "internet_users": "1,705,345",
    "mobile_subscriptions": "9,400,000",
    "internet_country_code": ".tj",
    "military_and_security_forces": "Armed Forces of the Republic of Tajikistan: Land Forces, Mobile Forces, Air and Air Defense Forces; National Guard; Ministry of Internal Affairs: Internal Troops (reserves for Armed Forces in wartime); State Committee on National Security: Border Guard Forces",
    "pipelines": [
        "549 km gas",
        "38 km oil"
    ],
    "ports_and_terminals": "Unknown",
    "waterways": "200 km",
    "number_of_airports": "24",
    "international_disputes": "in 2006, China and Tajikistan pledged to commence demarcation of the revised boundary agreed to in the delimitation of 2002; talks continue with Uzbekistan to delimit border and remove minefields; disputes in Isfara Valley delay delimitation with Kyrgyzstan"
}