{
    "name": "Thailand",
    "background": "A unified Thai kingdom was established in the mid-14th century. Known as Siam until 1939, Thailand is the only Southeast Asian country never to have been colonized by a European power. A bloodless revolution in 1932 led to the establishment of a constitutional monarchy. After the Japanese invaded Thailand in 1941, the government split into a pro-Japan faction and a pro-Ally faction backed by the King. Following the war, Thailand became a US treaty ally in 1954 after sending troops to Korea and later fighting alongside the US in Vietnam. Thailand since 2005 has experienced several rounds of political turmoil including a military coup in 2006 that ousted then Prime Minister THAKSIN Chinnawat, followed by large-scale street protests by competing political factions in 2008, 2009, and 2010. THAKSIN's youngest sister, YINGLAK Chinnawat, in 2011 led the Puea Thai Party to an electoral win and assumed control of the government.\nIn early May 2014, after months of large-scale anti-government protests in Bangkok beginning in November 2013, YINGLAK was removed from office by the Constitutional Court and in late May 2014 the Royal Thai Army, led by Royal Thai Army Gen. PRAYUT Chan-ocha, staged a coup against the caretaker government. PRAYUT was appointed prime minister in August 2014. PRAYUT also serves as the head of the National Council for Peace and Order (NCPO), a military-affiliated body that oversees the interim government. This body created several interim institutions to promote reform and draft a new constitution, which was passed in a national referendum in August 2016. In late 2017, PRAYUT announced elections would be held by November 2018; he has subsequently suggested they might occur in February 2019. As of mid-December 2018, a previoulsy held ban on campaigning and political activity has been lifted and per parliamentary laws, an election must be held within 150 days. King PHUMIPHON Adunyadet passed away in October 2016 after 70 years on the throne; his only son, WACHIRALONGKON Bodinthrathepphayawarangkun, ascended the throne in December 2016. He signed the new constitution in April 2017. Thailand has also experienced violence associated with the ethno-nationalist insurgency in its southern Malay-Muslim majority provinces. Since January 2004, thousands have been killed and wounded in the insurgency.",
    "coordinates": "15 00 N, 100 00 E",
    "region": "Southeast Asia",
    "total_area": "513,120 sq km",
    "land_area": "510,890 sq km",
    "water_area": "2,230 sq km",
    "land_boundary": "5,673 km",
    "neighbors": {
        "Cambodia": "817 km",
        "Laos": "1845 km",
        "Malaysia": "595 km"
    },
    "climate": "tropical; rainy, warm, cloudy southwest monsoon (mid-May to September); dry, cool northeast monsoon (November to mid-March); southern isthmus always hot and humid",
    "coastline": "3,219 km",
    "natural_hazards": [
        "land subsidence in Bangkok area resulting from the depletion of the water table",
        "droughts"
    ],
    "terrain": "central plain; Khorat Plateau in the east; mountains elsewhere",
    "population_distribution": "highest population density is found in and around Bangkok; significant population clusters found througout large parts of the country, particularly north and northeast of Bangkok and in the extreme southern region of the country",
    "natural_resources": [
        "tin",
        "rubber",
        "natural gas",
        "tungsten",
        "tantalum",
        "timber",
        "lead",
        "fish",
        "gypsum",
        "lignite",
        "fluorite",
        "arable land"
    ],
    "population": "68,977,400",
    "nationality": "Thai (singular and plural)",
    "ethnic_groups": {"Thai": "97.5%", "Burmese": "1.3%", "other": "1.1%", 
        "unspecified": ".1%"},
    "languages": {
        "Thai (official)": "90.7%",
        "Thai and other languages": "6.4%",
        "only other languages": ""
    },
    "religions": {"Buddhist": "94.6%", "Muslim": "4.3%", "Christian": "1%", "other":""},
    "government_type": "constitutional monarchy",
    "national_symbols": "garuda (mythical half-man, half-bird figure), elephant",
    "national_colors": ["red", "white", "blue"],
    "gdp": "$455.4 billion",
    "agriculture": [
        "rice",
        "cassava",
        "rubber",
        "corn",
        "sugarcane",
        "coconuts",
        "palm oil",
        "pineapple",
        "livestock",
        "fish products"
    ],
    "industries": [
        "tourism",
        "textiles and garments",
        "agricultural processing",
        "beverages",
        "tobacco",
        "cement",
        "light manufacturing such as jewelry and electric appliances",
        "computers and parts",
        "integrated circuits",
        "furniture",
        "plastics",
        "automobiles and automotive parts",
        "agricultural machinery",
        "air conditioning and refrigeration",
        "ceramics",
        "aluminum",
        "chemical",
        "environmental management",
        "glass",
        "granite and marble",
        "leather",
        "machinery and metal work",
        "petrochemical",
        "petroleum refining",
        "pharmaceuticals",
        "printing",
        "pulp and paper",
        "rubber",
        "sugar",
        "rice",
        "fishing",
        "cassava",
        "world's second-largest tungsten producer and third-largest tin producer"
    ],
    "exports": [
        "automobiles and parts",
        "computer and parts",
        "jewelry and precious stones",
        "polymers of ethylene in primary forms",
        "refine fuels",
        "electronic integrated circuits",
        "chemical products",
        "rice",
        "fish products",
        "rubber products",
        "sugar",
        "cassava",
        "poultry",
        "machinery and parts",
        "iron and steel and their products"
    ],
    "imports": [
        "machinery and parts",
        "crude oil",
        "electrical machinery and parts",
        "chemicals",
        "iron & steel and product",
        "electronic integrated circuit",
        "automobile’s parts",
        "jewelry including silver bars and gold",
        "computers and parts",
        "electrical household appliances",
        "soybean",
        "soybean meal",
        "wheat",
        "cotton",
        "dairy products"
    ],
    "broadband_subscriptions": "9,189,000",
    "internet_users": "32,398,778",
    "mobile_subscriptions": "125,098,000",
    "internet_country_code": ".th",
    "military_and_security_forces": "Royal Thai Armed Forces (Kongthap Thai, RTARF): Royal Thai Army (Kongthap Bok Thai, RTA, includes paramilitary Thai Rangers (Thahan Phrahan)), Royal Thai Navy (Kongthap Ruea Thai, RTN, includes Royal Thai Marine Corps), Royal Thai Air Force (Kongthap Akaat Thai, RTAF); Interior Ministry paramilitary forces: Volunteer Defense Corps",
    "percent_GDP_on_military": "1.3%",
    "pipelines": [
        "2 km condensate",
        "5900 km gas",
        "85 km liquid petroleum gas",
        "1 km oil",
        "1097 km refined products"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Bangkok, Laem Chabang, Map Ta Phut, Prachuap Port, Si Racha",
        "container port(s) (TEUs)": "Laem Chabang (7,227,431)",
        "LNG terminal(s) (import)": "Map Ta Phut"
    },
    "waterways": "4,000 km",
    "number_of_airports": "101",
    "international_disputes": "separatist violence in Thailand's predominantly Malay-Muslim southern provinces prompt border closures and controls with Malaysia to stem insurgent activities; Southeast Asian states have enhanced border surveillance to check the spread of avian flu; talks continue on completion of demarcation with Laos but disputes remain over several islands in the Mekong River; despite continuing border committee talks, Thailand must deal with Karen and other ethnic rebels, refugees, and illegal cross-border activities; Cambodia and Thailand dispute sections of boundary; in 2011, Thailand and Cambodia resorted to arms in the dispute over the location of the boundary on the precipice surmounted by Preah Vihear temple ruins, awarded to Cambodia by ICJ decision in 1962 and part of a planned UN World Heritage site; Thailand is studying the feasibility of jointly constructing the Hatgyi Dam on the Salween river near the border with Burma; in 2004, international environmentalist pressure prompted China to halt construction of 13 dams on the Salween River that flows through China, Burma, and Thailand; approximately 100,000 mostly Karen refugees fleeing civil strife, political upheaval and economic stagnation in Burma live in remote camps in Thailand near the border"
}