{
    "name": "Togo",
    "background": "French Togoland became Togo in 1960. Gen. Gnassingbe EYADEMA, installed as military ruler in 1967, ruled Togo with a heavy hand for almost four decades. Despite the facade of multi-party elections instituted in the early 1990s, the government was largely dominated by President EYADEMA, whose Rally of the Togolese People (RPT) party has been in power almost continually since 1967 and its successor, the Union for the Republic, maintains a majority of seats in today's legislature. Upon EYADEMA's death in February 2005, the military installed the president's son, Faure GNASSINGBE, and then engineered his formal election two months later. Democratic gains since then allowed Togo to hold its first relatively free and fair legislative elections in October 2007. Since 2007, President GNASSINGBE has started the country along a gradual path to democratic reform. Togo has since held multiple presidential and legislative elections deemed generally free and fair by international observers. Despite those positive moves, political reconciliation has moved slowly, and the country experiences periodic outbursts of violent protest by frustrated citizens. Recent constitutional changes to institute a runoff system in presidential elections and establish term limits has done little to reduce the resentment many Togolese feel after over 50 years of one-family rule.",
    "coordinates": "8 00 N, 1 10 E",
    "region": "Africa",
    "total_area": "56,785 sq km",
    "land_area": "54,385 sq km",
    "water_area": "2,400 sq km",
    "land_boundary": "1,880 km",
    "neighbors": {
        "Burkina Faso": "131 km",
        "Ghana": "1098 km"
    },
    "climate": "tropical; hot, humid in south; semiarid in north",
    "coastline": "56 km",
    "natural_hazards": [
        "hot, dry harmattan wind can reduce visibility in north during winter",
        "periodic droughts"
    ],
    "terrain": "gently rolling savanna in north; central hills; southern plateau; low coastal plain with extensive lagoons and marshes",
    "population_distribution": "one of the more densely populated African nations with most of the population residing in rural communities, density is highest in the south on or near the Atlantic coast",
    "natural_resources": [
        "phosphates",
        "limestone",
        "marble",
        "arable land"
    ],
    "population": "8,608,444",
    "nationality": "Togolese (singular and plural)",
    "ethnic_groups": {
        "Adja-Ewe/Mina": "42.4%", 
        "Kabye/Tem": "25.9%", 
        "Para-Gourma/Akan": "17.1%", 
        "Akposso/Akebu": "4.1%", 
        "Ana-Ife": "3.2%", 
        "other Togolese": "1.7%", 
        "foreigners": "5.2%", 
        "no response": ".4%"},
    "languages": {
        "French (official)": "",
        "Ewe and Mina": "",
        "Kabye and Dagomba": ""
    },
    "religions": {
        "Christian": "43.7%", 
        "folk": "35.6%", 
        "Muslim": "14%", 
        "Hindu": ".1%", 
        "Buddhist": ".1%", 
        "Jewish": ".1%", 
        "other": ".5%", 
        "none": "6.2%"},
    "government_type": "presidential republic",
    "national_symbols": "lion",
    "national_colors": ["green", "yellow", "red", "white"],
    "gdp": "$4.767 billion",
    "agriculture": [
        "coffee",
        "cocoa",
        "cotton",
        "yams",
        "cassava",
        "corn",
        "beans",
        "rice",
        "millet",
        "sorghum",
        "livestock",
        "fish"
    ],
    "industries": [
        "phosphate mining",
        "agricultural processing",
        "cement",
        "handicrafts",
        "textiles",
        "beverages"
    ],
    "exports": [
        "reexports",
        "cotton",
        "phosphates",
        "coffee",
        "cocoa"
    ],
    "imports": [
        "machinery and equipment",
        "foodstuffs",
        "petroleum products"
    ],
    "broadband_subscriptions": "26,156",
    "internet_users": "877,310",
    "mobile_subscriptions": "6,144,507",
    "internet_country_code": ".tg",
    "military_and_security_forces": "Togolese Armed Forces (Forces Armees Togolaise, FAT): Togolese Army (l'Armee de Terre), Togolese Navy (Forces Naval Togolaises), Togolese Air Force (Armee de l’Air), National Gendarmerie",
    "percent_GDP_on_military": "3.1%",
    "pipelines": [
        "62 km gas"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Kpeme, Lome"
    },
    "waterways": "50 km",
    "number_of_airports": "8",
    "international_disputes": "in 2001, Benin claimed Togo moved boundary monuments - joint commission continues to resurvey the boundary; talks continue between Benin and Togo on funding the Adjrala hydroelectric dam on the Mona River"
}