{
    "name": "Turkey",
    "background": "Modern Turkey was founded in 1923 from the remnants of the defeated Ottoman Empire by national hero Mustafa KEMAL, who was later honored with the title Ataturk or \"Father of the Turks.\" Under his leadership, the country adopted radical social, legal, and political reforms. After a period of one-party rule, an experiment with multi-party politics led to the 1950 election victory of the opposition Democrat Party and the peaceful transfer of power. Since then, Turkish political parties have multiplied, but democracy has been fractured by periods of instability and military coups (1960, 1971, 1980), which in each case eventually resulted in a return of formal political power to civilians. In 1997, the military again helped engineer the ouster - popularly dubbed a \"post-modern coup\" - of the then Islamic-oriented government. An unsuccessful coup attempt was made in July 2016 by a faction of the Turkish Armed Forces.\nTurkey intervened militarily on Cyprus in 1974 to prevent a Greek takeover of the island and has since acted as patron state to the \"Turkish Republic of Northern Cyprus,\" which only Turkey recognizes. A separatist insurgency begun in 1984 by the Kurdistan Workers' Party (PKK), a US-designated terrorist organization, has long dominated the attention of Turkish security forces and claimed more than 40,000 lives. In 2013, the Turkish Government and the PKK conducted negotiations aimed at ending the violence, however intense fighting resumed in 2015. Turkey joined the UN in 1945 and in 1952 it became a member of NATO. In 1963, Turkey became an associate member of the European Community; it began accession talks with the EU in 2005. Over the past decade, economic reforms, coupled with some political reforms, have contributed to a growing economy, although economic growth slowed in recent years.\nFrom 2015 and continuing through 2016, Turkey witnessed an uptick in terrorist violence, including major attacks in Ankara, Istanbul, and throughout the predominantly Kurdish southeastern region of Turkey. On 15 July 2016, elements of the Turkish Armed forces attempted a coup that ultimately failed following widespread popular resistance. More than 240 people were killed and over 2,000 injured when Turkish citizens took to the streets en masse to confront the coup forces. The government accused followers of the Fethullah Gulen transnational religious and social movement (\"Hizmet\") for allegedly instigating the failed coup and designates the movement's followers as terrorists. Since the attempted coup, Turkish Government authorities arrested, suspended, or dismissed more than 130,000 security personnel, journalists, judges, academics, and civil servants due to their alleged connection to Gulen's movement. Following the failed coup, the Turkish Government instituted a State of Emergency from July 2016 to July 2018. The Turkish Government conducted a referendum on 16 April 2017 in which voters approved constitutional amendments changing Turkey from a parliamentary to a presidential system. The amendments went into effect fully following the presidential and parliamentary elections in June 2018.",
    "coordinates": "39 00 N, 35 00 E",
    "region": "Middle East",
    "total_area": "783,562 sq km",
    "land_area": "769,632 sq km",
    "water_area": "13,930 sq km",
    "land_boundary": "2,816 km",
    "neighbors": {
        "Azerbaijan": "17 km",
        "Bulgaria": "223 km",
        "Georgia": "273 km",
        "Greece": "192 km",
        "Iran": "534 km",
        "Iraq": "367 km",
        "Syria": "899 km"
    },
    "climate": "temperate; hot, dry summers with mild, wet winters; harsher in interior",
    "coastline": "7,200 km",
    "natural_hazards": [
        "severe earthquakes, especially in northern Turkey, along an arc extending from the Sea of Marmara to Lake Van",
        "landslides",
        "flooding",
        "volcanism: limited volcanic activity; its three historically active volcanoes; Ararat, Nemrut Dagi, and Tendurek Dagi have not erupted since the 19th century or earlier"
    ],
    "terrain": "high central plateau (Anatolia); narrow coastal plain; several mountain ranges",
    "population_distribution": "the most densely populated area is found around the Bosporus in the northwest where 20% of the population lives in Istanbul; with the exception of Ankara, urban centers remain small and scattered throughout the interior of Anatolia; an overall pattern of peripheral development exists, particularly along the Aegean Sea coast in the west, and the Tigris and Euphrates River systems in the southeast",
    "natural_resources": [
        "coal",
        "iron ore",
        "copper",
        "chromium",
        "antimony",
        "mercury",
        "gold",
        "barite",
        "borate",
        "celestite (strontium)",
        "emery",
        "feldspar",
        "limestone",
        "magnesite",
        "marble",
        "perlite",
        "pumice",
        "pyrites (sulfur)",
        "clay",
        "arable land",
        "hydropower"
    ],
    "population": "82,017,514",
    "nationality": "Turk(s)",
    "ethnic_groups": {
        "Turkish": "70-75%",
        "Kurdish": "19%",
        "other minorities": "7-12%"
    },
    "languages": [
        "Turkish (official)",
        "Kurdish",
        "other minority languages"
    ],
    "religions": {
        "Muslim": "99.8%",
        "other": "0.2%"
    },
    "government_type": "presidential republic",
    "national_symbols": "vertical crescent moon with adjacent five-pointed star",
    "national_colors": [
        "red",
        "white"
    ],
    "gdp": "$851.5 billion",
    "agriculture": [
        "tobacco",
        "cotton",
        "grain",
        "olives",
        "sugar beets",
        "hazelnuts",
        "pulses",
        "citrus",
        "livestock"
    ],
    "industries": [
        "textiles",
        "food processing",
        "automobiles",
        "electronics",
        "mining (coal, chromate, copper, boron)",
        "steel",
        "petroleum",
        "construction",
        "lumber",
        "paper"
    ],
    "exports": [
        "apparel",
        "foodstuffs",
        "textiles",
        "metal manufactures",
        "transport equipment"
    ],
    "imports": [
        "machinery",
        "chemicals",
        "semi-finished goods",
        "fuels",
        "transport equipment"
    ],
    "broadband_subscriptions": "13,407,226",
    "internet_users": "46,838,412",
    "mobile_subscriptions": "80,117,999",
    "internet_country_code": ".tr",
    "military_and_security_forces": "Turkish Armed Forces (TSK): Turkish Land Forces (Turk Kara Kuvvetleri), Turkish Naval Forces (Turk Deniz Kuvvetleri; includes naval air and naval infantry), Turkish Air Forces (Turk Hava Kuvvetleri); Ministry of Interior: Gendarmerie of the Turkish Republic, Turkish Coast Guard Command",
    "percent_GDP_on_military": "1.89%",
    "pipelines": [
        "14,666 km gas",
        "3,293 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Aliaga, Ambarli, Diliskelesi, Eregli, Izmir, Kocaeli (Izmit), Mersin (Icel), Limani, Yarimca",
        "container port(s) (TEUs)": "Ambarli (3,131,621), Mersin (Icel) (1,592,000)",
        "LNG terminal(s) (import)": "Izmir Aliaga, Marmara Ereglisi"
    },
    "waterways": "1,200 km",
    "number_of_airports": "98",
    "international_disputes": "complex maritime, air, and territorial disputes with Greece in the Aegean Sea; status of north Cyprus question remains; Turkey has expressed concern over the status of Kurds in Iraq; in 2009, Swiss mediators facilitated an accord reestablishing diplomatic ties between Armenia and Turkey, but neither side has ratified the agreement and the rapprochement effort has faltered; Turkish authorities have complained that blasting from quarries in Armenia might be damaging the medieval ruins of Ani, on the other side of the Arpacay valley",
    "terrorism": {
        "Islamic State of Iraq and ash-Sham (ISIS) networks in Turkey": "replace the Turkish Government with an Islamic state and implement ISIS's strict interpretation of shariaarea(s) of operation",
        "Revolutionary People's Liberation Party/Front (DHKP/C)": "install a Marxist-Leninist government in Turkeyarea(s) of operation",
        "al-Nusrah Front": "overthrow Syrian President Bashar al-ASAD's regime, absorb like-minded Syrian rebel groups, and ultimately, establish a regional Islamic caliphatearea(s) of operation",
        "al-Qa'ida (AQ)": "radicalize the Turkish populace and eventually overthrow the Turkish Government as part of a long-term plan to establish a pan-Islamic caliphate under a strict Salafi Muslim interpretation of shariaarea(s) of operation",
        "Kurdistan Workers' Party (PKK)": "advance Kurdish autonomy, political, and cultural rights in Turkey, Iran, Iraq, and Syriaarea(s) of operation"
    }
}