{
    "name": "Yemen",
    "background": "The Kingdom of Yemen (colloquially known as North Yemen) became independent from the Ottoman Empire in 1918 and in 1962 became the Yemen Arab Republic. The British, who had set up a protectorate area around the southern port of Aden in the 19th century, withdrew in 1967 from what became the People's Republic of Southern Yemen (colloquially known as South Yemen). Three years later, the southern government adopted a Marxist orientation and changed the country's name to the People's Democratic Republic of Yemen. The massive exodus of hundreds of thousands of Yemenis from the south to the north contributed to two decades of hostility between the states. The two countries were formally unified as the Republic of Yemen in 1990. A southern secessionist movement and brief civil war in 1994 was quickly subdued. In 2000, Saudi Arabia and Yemen agreed to delineate their border.\nFighting in the northwest between the government and the Huthis, a Zaydi Shia Muslim minority, continued intermittently from 2004 to 2010, and then again from 2014-present. The southern secessionist movement was revitalized in 2007.\nPublic rallies in Sana'a against then President Ali Abdallah SALIH - inspired by similar demonstrations in Tunisia and Egypt - slowly built momentum starting in late January 2011 fueled by complaints over high unemployment, poor economic conditions, and corruption. By the following month, some protests had resulted in violence, and the demonstrations had spread to other major cities. By March the opposition had hardened its demands and was unifying behind calls for SALIH's immediate ouster. In April 2011, the Gulf Cooperation Council (GCC), in an attempt to mediate the crisis in Yemen, proposed the GCC Initiative, an agreement in which the president would step down in exchange for immunity from prosecution. SALIH's refusal to sign an agreement led to further violence. The UN Security Council passed Resolution 2014 in October 2011 calling for an end to the violence and completing a power transfer deal. In November 2011, SALIH signed the GCC Initiative to step down and to transfer some of his powers to Vice President Abd Rabuh Mansur HADI. Following HADI's uncontested election victory in February 2012, SALIH formally transferred all presidential powers. In accordance with the GCC Initiative, Yemen launched a National Dialogue Conference (NDC) in March 2013 to discuss key constitutional, political, and social issues. HADI concluded the NDC in January 2014 and planned to begin implementing subsequent steps in the transition process, including constitutional drafting, a constitutional referendum, and national elections.\nThe Huthis, perceiving their grievances were not addressed in the NDC, joined forces with SALIH and expanded their influence in northwestern Yemen, which culminated in a major offensive against military units and rival tribes and enabled their forces to overrun the capital, Sanaa, in September 2014. In January 2015, the Huthis surrounded the presidential palace, HADI's residence, and key government facilities, prompting HADI and the cabinet to submit their resignations. HADI fled to Aden in February 2015 and rescinded his resignation. He subsequently escaped to Oman and then moved to Saudi Arabia and asked the GCC to intervene militarily in Yemen to protect the legitimate government from the Huthis. In March, Saudi Arabia assembled a coalition of Arab militaries and began airstrikes against the Huthis and Huthi-affiliated forces. Ground fighting between Huthi-aligned forces and anti-Huthi groups backed by the Saudi-led coalition continued through 2016. In 2016, the UN brokered a months-long cessation of hostilities that reduced airstrikes and fighting, and initiated peace talks in Kuwait. However, the talks ended without agreement. The Huthis and SALIH’s political party announced a Supreme Political Council in August 2016 and a National Salvation Government, including a prime minister and several dozen cabinet members, in November 2016, to govern in Sanaa and further challenge the legitimacy of HADI’s government. However, amid rising tensions between the Huthis and SALIH, sporadic clashes erupted in mid-2017, and escalated into open fighting that ended when Huthi forces killed SALIH in early December 2017. In 2018, anti-Huthi forces made the most battlefield progress in Yemen since early 2016, most notably in Al Hudaydah Governorate. In December 2018, the Huthis and Yemeni Government participated in the first UN-brokered peace talks since 2016, agreeing to a limited ceasefire in Al Hudaydah Governorate and the establishment of a UN Mission to monitor the agreement. In April 2019, Yemen’s parliament convened in Say'un for the first time since the conflict broke out in 2014. In August 2019, violence erupted between HADI's government and the pro-secessionist Southern Transition Council (STC) in southern Yemen. In November 2019, HADI's government and the STC signed a power-sharing agreement to end the fighting between them.",
    "coordinates": "15 00 N, 48 00 E",
    "region": "Middle East",
    "total_area": "527,968 sq km",
    "land_area": "527,968 sq km",
    "water_area": "0 sq km",
    "land_boundary": "1,601 km",
    "neighbors": {
        "Saudi Arabia": "1307 km"
    },
    "climate": "mostly desert; hot and humid along west coast; temperate in western mountains affected by seasonal monsoon; extraordinarily hot, dry, harsh desert in east",
    "coastline": "1,906 km",
    "natural_hazards": [
        "sandstorms and dust storms in summer",
        "volcanism: limited volcanic activity; Jebel at Tair (Jabal al-Tair, Jebel Teir, Jabal al-Tayr, Jazirat at-Tair) (244 m), which forms an island in the Red Sea, erupted in 2007 after awakening from dormancy; other historically active volcanoes include Harra of Arhab, Harras of Dhamar, Harra es-Sawad, and Jebel Zubair, although many of these have not erupted in over a century"
    ],
    "terrain": "narrow coastal plain backed by flat-topped hills and rugged mountains; dissected upland desert plains in center slope into the desert interior of the Arabian Peninsula",
    "population_distribution": "the vast majority of the population is found in the Asir Mountains (part of the larger Sarawat Mountain system), located in the far western region of the country",
    "natural_resources": [
        "petroleum",
        "fish",
        "rock salt",
        "marble",
        "small deposits of coal",
        "gold",
        "lead",
        "nickel",
        "copper",
        "fertile soil in west"
    ],
    "population": "29,884,405",
    "nationality": "Yemeni(s)",
    "ethnic_groups": {"predominantly Arab":"", "Afro-Arab":"", "South Asian":"", "European":""},
    "languages": {
        "Arabic (official)": ""
    },
    "religions": {
        "Muslim": "99.1%", 
        "other": "0.9%"},
    "government_type": "in transition",
    "national_symbols": "golden eagle",
    "national_colors": ["red", "white", "black"],
    "gdp": "$31.27 billion",
    "agriculture": [
        "grain",
        "fruits",
        "vegetables",
        "pulses",
        "qat",
        "coffee",
        "cotton",
        "dairy products",
        "livestock (sheep, goats, cattle, camels)",
        "poultry",
        "fish"
    ],
    "industries": [
        "crude oil production and petroleum refining",
        "small-scale production of cotton textiles",
        "leather goods",
        "food processing",
        "handicrafts",
        "aluminum products",
        "cement",
        "commercial ship repair",
        "natural gas production"
    ],
    "exports": [
        "crude oil",
        "coffee",
        "dried and salted fish",
        "liquefied natural gas"
    ],
    "imports": [
        "food and live animals",
        "machinery and equipment",
        "chemicals"
    ],
    "broadband_subscriptions": "386,330",
    "internet_users": "6,732,928",
    "mobile_subscriptions": "15,297,789",
    "internet_country_code": ".ye",
    "military_and_security_forces": "Land Forces (includes seven Military Regional Commands, supported by Strategic Reserve Units), Naval and Coastal Defense Forces (includes Navy Infantry or Marine units and Coast Guard), Air and Air Defense Force (although it still exists in name, in practice many of the officers and soldiers in this branch have been distributed to other military branches and jobs), Border Guards, Strategic Reserve Forces (supports the Land Forces at the discretion of the Armed Forces Commander-in-Chief and also includes a Missile Group, Presidential Protection Brigades, and Special Operations Forces), Minister of Defense Intelligence Authority (consists of the Department of Military Intelligence [active], Department of Reconnaissance [active], Department of Military Security [inactive], and the Electronic Warfare Department [inactive])",
    "percent_GDP_on_military": "4%",
    "pipelines": [
        "641 km gas",
        "22 km liquid petroleum gas",
        "1370 km oil"
    ],
    "ports_and_terminals": {
        "major seaport(s)": "Aden, Al Hudaydah, Al Mukalla"
    },
    "waterways": "Unknown",
    "number_of_airports": "57",
    "international_disputes": "Saudi Arabia has reinforced its concrete-filled security barrier along sections of the fully demarcated border with Yemen to stem illegal cross-border activities"
}