{
    "name": "Zimbabwe",
    "background": "A series of trading states developed in the area of Zimbabwe prior to the arrival of the first European explorers; the largest of these was the Kingdom of Zimbabwe (ca. 1220-1450). In the 1880s, European colonists arrived with the British South Africa Company (BSAC), which obtained mining rights and established company rule over the area. The southern portion of BSAC holdings were annexed by the UK in 1923 and became the British colony of Southern Rhodesia. A 1961 constitution was formulated that favored whites in power. In 1965 the government unilaterally declared its independence, but the UK did not recognize the act and demanded more complete voting rights for the black African majority in the country (then called Rhodesia). UN sanctions and a guerrilla uprising finally led to free elections in 1979 and independence (as Zimbabwe) in 1980. Robert MUGABE, the nation's first prime minister, was the country's only ruler (as president since 1987) from independence until his resignation in November 2017. His chaotic land redistribution campaign, which began in 1997 and intensified after 2000, caused an exodus of white farmers, crippled the economy, and ushered in widespread shortages of basic commodities. Ignoring international condemnation, MUGABE rigged the 2002 presidential election to ensure his reelection.\nIn 2005, the capital city of Harare embarked on Operation Restore Order, ostensibly an urban rationalization program, which resulted in the destruction of the homes or businesses of 700,000 mostly poor supporters of the opposition. MUGABE in 2007 instituted price controls on all basic commodities causing panic buying and leaving store shelves empty for months. General elections in both 2008 and 2013 were severely flawed and widely condemned, but allowed MUGABE to remain president. As a prerequisite to holding the 2013 election, Zimbabwe enacted a new constitution by referendum, although many provisions in the new constitution have yet to be codified in law. In November 2017, Vice President Emmerson MNANGAGWA took over following a military intervention that forced MUGABE to resign. MNANGAGWA was inaugurated president days later, promising to hold presidential elections in 2018. In July 2018, MNANGAGWA won the presidential election after a close contest with Movement for Democratic Change Alliance candidate Nelson CHAMISA. MNANGAGWA has since resorted to the government's longstanding practice of violently disrupting protests or opposition rallies. Official inflation rates soared in 2019, approaching 500% by the end of the year. MUGABE died in September 2019.",
    "coordinates": "20 00 S, 30 00 E",
    "region": "Africa",
    "total_area": "390,757 sq km",
    "land_area": "386,847 sq km",
    "water_area": "3,910 sq km",
    "land_boundary": "3,229 km",
    "neighbors": {
        "Mozambique": "1402 km",
        "South Africa": "230 km",
        "Zambia": "763 km"
    },
    "climate": "tropical; moderated by altitude; rainy season (November to March)",
    "coastline": "0 km",
    "natural_hazards": [
        "recurring droughts",
        "floods and severe storms are rare"
    ],
    "terrain": "mostly high plateau with higher central plateau (high veld); mountains in east",
    "population_distribution": "Aside from major urban agglomerations in Harare and Bulawayo, population distribution is fairly even, with slightly greater overall numbers in the eastern half",
    "natural_resources": [
        "coal",
        "chromium ore",
        "asbestos",
        "gold",
        "nickel",
        "copper",
        "iron ore",
        "vanadium",
        "lithium",
        "tin",
        "platinum group metals"
    ],
    "population": "14,546,314",
    "nationality": "Zimbabwean(s)",
    "ethnic_groups": {
        "African": "99.4%",
        "other": "0.4%",
        "unspecified": "0.2%"
    },
    "languages": {
        "Shona (official)": "",
        "Ndebele (official)": "",
        "English (official)": "",
        "13 minority languages (official)": ""
    },
    "religions": {
        "Protestant": "74.8%",
        "Roman Catholic": "7.3%",
        "other Christian": "5.3%",
        "traditional": "1.5%",
        "Muslim": "0.5%",
        "other": "0.1%",
        "none": "10.5%"
    },
    "government_type": "presidential republic",
    "national_symbols": "Zimbabwe bird symbol, African fish eagle, flame lily",
    "national_colors": [
        "green",
        "yellow",
        "red",
        "black",
        "white"
    ],
    "gdp": "$17.64 billion",
    "agriculture": [
        "tobacco",
        "corn",
        "cotton",
        "wheat",
        "coffee",
        "sugarcane",
        "peanuts",
        "sheep",
        "goats",
        "pigs"
    ],
    "industries": [
        "mining (coal, gold, platinum, copper, nickel, tin, diamonds, clay, numerous metallic and nonmetallic ores)",
        "steel",
        "wood products",
        "cement",
        "chemicals",
        "fertilizer",
        "clothing and footwear",
        "foodstuffs",
        "beverages"
    ],
    "exports": [
        "platinum",
        "cotton",
        "tobacco",
        "gold",
        "ferroalloys",
        "textiles/clothing"
    ],
    "imports": [
        "machinery and transport equipment",
        "other manufactures",
        "chemicals",
        "fuels",
        "food products"
    ],
    "broadband_subscriptions": "203,056",
    "internet_users": "3,363,256",
    "mobile_subscriptions": "12,908,992",
    "internet_country_code": ".zw",
    "military_and_security_forces": "Zimbabwe Defense Forces (ZDF): Zimbabwe National Army (ZNA), Air Force of Zimbabwe (AFZ)",
    "percent_GDP_on_military": "0.7%",
    "pipelines": [
        "270 km refined products"
    ],
    "ports_and_terminals": {
        "river port(s)": "Binga, Kariba (Zambezi)"
    },
    "waterways": "Unknown",
    "number_of_airports": "196",
    "international_disputes": "Namibia has supported, and in 2004 Zimbabwe dropped objections to, plans between Botswana and Zambia to build a bridge over the Zambezi River, thereby de facto recognizing a short, but not clearly delimited, Botswana-Zambia boundary in the river; South Africa has placed military units to assist police operations along the border of Lesotho, Zimbabwe, and Mozambique to control smuggling, poaching, and illegal migration",
    "terrorism": "Unknown"
}